const cron = require('node-cron');
const myDate = require('../routes/librarys/myDate');
const myLogger = require('../routes/librarys/myLogger');
// const { sequelize } = require('../models');
const { Sequelize, QueryTypes } = require('sequelize');
require('dotenv').config();

let is_cron_executing = false;

// 10초마다 실행
cron.schedule('*/10 * * * * *', async() => {
  const processId = process.env.NODE_APP_INSTANCE;
  if (Number(processId) !== 0) {
    return;
  }


  if (is_cron_executing) {
    myLogger.info('db_init_check 크론 동작중... ' + myDate().format('YYYY-MM-DD HH:mm:ss'));
    return;
  }

  is_cron_executing = true;

  myLogger.info('db_init_check 크론 시작 ' + myDate().format('YYYY-MM-DD HH:mm:ss') + ' => ' + processId);

  const sequelize = new Sequelize(process.env.MAIN_DB_DEFAULT_DATABASE, process.env.MAIN_DB_USER, process.env.MAIN_DB_PASSWORD, {
    host: process.env.MAIN_DB_IP,
    port: process.env.MAIN_DB_PORT,
    dialect: process.env.MAIN_DB_TYPE
  });
  await sequelize.authenticate();
  const queryInterface = sequelize.getQueryInterface();

  const table_name = 'DB_init';
  const table_name_exist_result = await sequelize.query(`SHOW TABLES IN \`${process.env.MAIN_DB_DEFAULT_DATABASE}\` LIKE '${table_name}';`, {
    type: QueryTypes.SELECT,
  });

  myLogger.info(`table_name_exist_result.length = ${table_name_exist_result.length}`);
  
  if (table_name_exist_result.length === 0) {

    // 초기 필요 데이터 삽입 시작
    // FmsCodeGroups
    await sequelize.query(`
        INSERT INTO \`FmsCodeGroups\` (\`seq\`, \`codeGroup\`, \`codeGroupName\`, \`codeGroupDescription\`, \`createdAt\`, \`updatedAt\`, \`status\`, \`isDeletedRow\`) VALUES
        (2, 'CMPST', '회사 상태', NULL, '2021-03-30 11:33:17', '2021-03-30 12:04:59', 1, 'N'),
        (16, 'FDUCS', '파일 다운로드 URL 접근 제한 값 상태', NULL, '2021-04-19 13:38:57', NULL, 1, 'N'),
        (13, 'FDUCT', '파일 다운로드 URL 접근 제한 종류', NULL, '2021-04-19 11:24:33', NULL, 1, 'N'),
        (12, 'FDUST', '파일 다운로드 URL 상태', NULL, '2021-04-19 10:44:55', NULL, 1, 'N'),
        (9, 'FIMSS', '파일 이미지 상태', NULL, '2021-04-12 15:50:37', NULL, 1, 'N'),
        (8, 'FIMST', '파일 이미지 종류', NULL, '2021-04-12 15:29:37', NULL, 1, 'N'),
        (7, 'FISTS', '파일 상태', NULL, '2021-04-12 12:59:04', NULL, 1, 'N'),
        (10, 'FVSTS', '파일 버전 상태', NULL, '2021-04-12 22:18:20', NULL, 1, 'N'),
        (17, 'LOGTY', '로그 종류', NULL, '2021-05-01 12:43:12', NULL, 1, 'N'),
        (5, 'MENUS', '메뉴 상태', NULL, '2021-04-04 17:06:34', NULL, 1, 'N'),
        (3, 'MNCAT', '메뉴 카테고리 상태', NULL, '2021-03-30 19:39:14', NULL, 1, 'N'),
        (6, 'PEGRS', '권한 그룹 상태', NULL, '2021-04-07 14:05:25', NULL, 1, 'N'),
        (11, 'USLEV', '회원 등급', NULL, '2021-04-13 17:17:39', NULL, 1, 'N'),
        (1, 'USRST', '회원 상태', NULL, '2021-03-29 09:04:22', '2021-03-30 12:04:59', 1, 'N');
      `, { 
        type: QueryTypes.INSERT 
      }
    );



    // FmsCodes
    await sequelize.query(`
        INSERT INTO \`FmsCodes\` (\`seq\`, \`codeGroup\`, \`code\`, \`codeName\`, \`codeDescription\`, \`codeValue1\`, \`codeValue2\`, \`sortNo\`, \`createdAt\`, \`updatedAt\`, \`status\`, \`isDeletedRow\`) VALUES
        (26, 'CMPST', 'CMPST00000001', '정상', NULL, NULL, NULL, 1, '2021-04-11 19:45:57', NULL, 1, 'N'),
        (27, 'CMPST', 'CMPST00000002', '승인대기중', NULL, NULL, NULL, 2, '2021-04-11 19:46:07', NULL, 1, 'N'),
        (28, 'CMPST', 'CMPST00000003', '이용정지', NULL, NULL, NULL, 3, '2021-04-11 19:46:16', NULL, 1, 'N'),
        (44, 'FDUCS', 'FDUCS00000001', '적용', NULL, NULL, NULL, 1, '2021-04-19 13:42:32', NULL, 1, 'N'),
        (45, 'FDUCS', 'FDUCS00000002', '미적용', NULL, NULL, NULL, 2, '2021-04-19 13:42:32', NULL, 1, 'N'),
        (41, 'FDUCT', 'FDUCT00000001', '특정 IP 제한', NULL, NULL, NULL, 1, '2021-04-19 11:25:28', NULL, 1, 'N'),
        (42, 'FDUCT', 'FDUCT00000002', '특정 Header 값 제한', NULL, NULL, NULL, 2, '2021-04-19 11:25:28', NULL, 1, 'N'),
        (43, 'FDUCT', 'FDUCT00000003', '특정 암호 필요', NULL, NULL, NULL, 3, '2021-04-19 11:25:28', NULL, 1, 'N'),
        (81, 'FDUCT', 'FDUCT00000004', '파일 정보 확인 후 다운로드 (URL 직접 다운로드 제한)', NULL, NULL, NULL, 4, '2021-06-19 08:04:39', NULL, 1, 'N'),
        (39, 'FDUST', 'FDUST00000001', '정상', NULL, NULL, NULL, 1, '2021-04-19 10:48:57', NULL, 1, 'N'),
        (40, 'FDUST', 'FDUST00000002', '비공개', NULL, NULL, NULL, 2, '2021-04-19 10:48:57', NULL, 1, 'N'),
        (33, 'FIMSS', 'FIMSS00000001', '정상', NULL, NULL, NULL, 1, '2021-04-12 15:50:52', NULL, 1, 'N'),
        (34, 'FIMSS', 'FIMSS00000002', '사용안함', NULL, NULL, NULL, 2, '2021-04-12 15:51:02', NULL, 1, 'N'),
        (31, 'FIMST', 'FIMST00000001', '스크린샷', NULL, NULL, NULL, 1, '2021-04-12 15:30:00', NULL, 1, 'N'),
        (32, 'FIMST', 'FIMST00000002', '대표 이미지', NULL, NULL, NULL, 2, '2021-04-12 15:30:07', NULL, 1, 'N'),
        (29, 'FISTS', 'FISTS00000001', '정상', NULL, NULL, NULL, 1, '2021-04-12 12:59:24', NULL, 1, 'N'),
        (30, 'FISTS', 'FISTS00000002', '비공개', NULL, NULL, NULL, 2, '2021-04-12 12:59:39', NULL, 1, 'N'),
        (35, 'FVSTS', 'FVSTS00000001', '정상', NULL, NULL, NULL, 1, '2021-04-12 22:18:37', NULL, 1, 'N'),
        (36, 'FVSTS', 'FVSTS00000002', '비공개', NULL, NULL, NULL, 2, '2021-04-12 22:18:37', NULL, 1, 'N'),
        (46, 'LOGTY', 'LOGTY00000001', '미지정', NULL, NULL, NULL, 1, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (47, 'LOGTY', 'LOGTY00000002', '로그인 시도', NULL, NULL, NULL, 2, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (48, 'LOGTY', 'LOGTY00000003', '로그인 성공', NULL, NULL, NULL, 3, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (49, 'LOGTY', 'LOGTY00000004', '회원 정보 수정 시도', NULL, NULL, NULL, 4, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (50, 'LOGTY', 'LOGTY00000005', '회원 정보 수정 성공', NULL, NULL, NULL, 5, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (51, 'LOGTY', 'LOGTY00000006', '아이디 중복 체크 시도', NULL, NULL, NULL, 6, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (52, 'LOGTY', 'LOGTY00000007', '아이디 중복 체크 성공', NULL, NULL, NULL, 7, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (53, 'LOGTY', 'LOGTY00000008', '회원가입 시도', NULL, NULL, NULL, 8, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (54, 'LOGTY', 'LOGTY00000009', '회원가입 성공', NULL, NULL, NULL, 9, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (55, 'LOGTY', 'LOGTY00000010', '회원 생성 시도', NULL, NULL, NULL, 10, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (56, 'LOGTY', 'LOGTY00000011', '회원 생성 성공', NULL, NULL, NULL, 11, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (57, 'LOGTY', 'LOGTY00000012', '회원 삭제 시도', NULL, NULL, NULL, 12, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (58, 'LOGTY', 'LOGTY00000013', '회원 삭제 성공', NULL, NULL, NULL, 13, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (59, 'LOGTY', 'LOGTY00000014', '그룹 권한 등록/수정 시도', NULL, NULL, NULL, 14, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (61, 'LOGTY', 'LOGTY00000015', '그룹 권한 삭제 시도', NULL, NULL, NULL, 15, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (62, 'LOGTY', 'LOGTY00000016', '그룹 권한 삭제 성공', NULL, NULL, NULL, 16, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (63, 'LOGTY', 'LOGTY00000017', '파일 버전 수정 시도', NULL, NULL, NULL, 17, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (64, 'LOGTY', 'LOGTY00000018', '파일 버전 수정 성공', NULL, NULL, NULL, 18, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (65, 'LOGTY', 'LOGTY00000019', '파일 버전 업로드 시도', NULL, NULL, NULL, 19, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (66, 'LOGTY', 'LOGTY00000020', '파일 버전 업로드 성공', NULL, NULL, NULL, 20, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (67, 'LOGTY', 'LOGTY00000021', '파일 다운로드 URL 등록 시도', NULL, NULL, NULL, 21, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (68, 'LOGTY', 'LOGTY00000022', '파일 다운로드 URL 등록 성공', NULL, NULL, NULL, 22, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (69, 'LOGTY', 'LOGTY00000023', '파일 다운로드 URL 수정 시도', NULL, NULL, NULL, 23, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (70, 'LOGTY', 'LOGTY00000024', '파일 다운로드 URL 수정 성공', NULL, NULL, NULL, 24, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (71, 'LOGTY', 'LOGTY00000025', '파일 등록 시도', NULL, NULL, NULL, 25, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (72, 'LOGTY', 'LOGTY00000026', '파일 등록 성공', NULL, NULL, NULL, 26, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (73, 'LOGTY', 'LOGTY00000027', '파일 수정 시도', NULL, NULL, NULL, 27, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (74, 'LOGTY', 'LOGTY00000028', '파일 수정 성공', NULL, NULL, NULL, 28, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (75, 'LOGTY', 'LOGTY00000029', '회사 등록 시도', NULL, NULL, NULL, 29, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (76, 'LOGTY', 'LOGTY00000030', '회사 등록 성공', NULL, NULL, NULL, 30, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (77, 'LOGTY', 'LOGTY00000031', '회사 삭제 시도', NULL, NULL, NULL, 31, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (78, 'LOGTY', 'LOGTY00000032', '회사 삭제 성공', NULL, NULL, NULL, 32, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (79, 'LOGTY', 'LOGTY00000033', '회사 수정 성공', NULL, NULL, NULL, 33, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (80, 'LOGTY', 'LOGTY00000034', '회사 수정 성공', NULL, NULL, NULL, 33, '2021-05-01 12:43:32', NULL, 1, 'N'),
        (82, 'LOGTY', 'LOGTY00000035', '파일 삭제 시도', NULL, NULL, NULL, 34, '2021-07-17 17:10:59', NULL, 1, 'N'),
        (83, 'LOGTY', 'LOGTY00000036', '파일 삭제 성공', NULL, NULL, NULL, 35, '2021-07-17 17:10:59', NULL, 1, 'N'),
        (84, 'LOGTY', 'LOGTY00000037', '파일 버전 삭제 시도', NULL, NULL, NULL, 36, '2021-07-17 17:10:59', NULL, 1, 'N'),
        (85, 'LOGTY', 'LOGTY00000038', '파일 버전 삭제 성공', NULL, NULL, NULL, 37, '2021-07-17 17:10:59', NULL, 1, 'N'),
        (86, 'LOGTY', 'LOGTY00000039', '파일 다운로드 URL 삭제 시도', NULL, NULL, NULL, 38, '2021-07-17 17:10:59', NULL, 1, 'N'),
        (87, 'LOGTY', 'LOGTY00000040', '파일 다운로드 URL 삭제 성공', NULL, NULL, NULL, 39, '2021-07-17 17:10:59', NULL, 1, 'N'),
        (22, 'MENUS', 'MENUS00000001', '정상', NULL, NULL, NULL, 1, '2021-04-04 17:07:01', NULL, 1, 'N'),
        (23, 'MENUS', 'MENUS00000002', '사용안함', NULL, NULL, NULL, 2, '2021-04-04 17:07:08', NULL, 1, 'N'),
        (20, 'MNCAT', 'MNCAT00000001', '정상', NULL, NULL, NULL, 1, '2021-03-30 19:42:52', NULL, 1, 'N'),
        (21, 'MNCAT', 'MNCAT00000002', '사용안함', NULL, NULL, NULL, 2, '2021-03-30 19:43:17', NULL, 1, 'N'),
        (24, 'PEGRS', 'PEGRS00000001', '정상', NULL, NULL, NULL, 1, '2021-04-07 14:06:09', NULL, 1, 'N'),
        (25, 'PEGRS', 'PEGRS00000002', '이용안함', NULL, NULL, NULL, 2, '2021-04-07 14:06:35', NULL, 1, 'N'),
        (37, 'USLEV', 'USLEV00000001', '최고 관리자', NULL, NULL, NULL, 1, '2021-04-13 17:17:59', NULL, 1, 'N'),
        (38, 'USLEV', 'USLEV00000002', '일반 사용자', NULL, NULL, NULL, 2, '2021-04-13 17:18:13', NULL, 1, 'N'),
        (1, 'USRST', 'USRST00000001', '정상', '정상 상태', NULL, NULL, 1, '2021-03-29 09:07:20', '2021-04-04 11:39:05', 1, 'N'),
        (2, 'USRST', 'USRST00000002', '승인대기중', '아직 로그인이 가능하지 않은 상태', NULL, NULL, 1, '2021-03-29 13:03:11', NULL, 1, 'N'),
        (3, 'USRST', 'USRST00000003', '이용정지', '이용이 정지된 상태', NULL, NULL, 1, '2021-03-29 13:06:48', '2021-03-30 11:28:56', 1, 'N'),
        (4, 'USRST', 'USRST00000004', '보류', '보류 상태', NULL, NULL, 1, '2021-03-29 13:09:03', '2021-04-04 11:39:05', 1, 'N'),
        (15, 'USRST', 'USRST00000005', '탈퇴', '탈퇴 처리 상태', '필요값', '필요값', 1, '2021-03-29 22:41:25', '2021-04-04 11:39:05', 1, 'N');
      `, { 
        type: QueryTypes.INSERT 
      }
    );



    // FmsPermissionGroups
    await sequelize.query(`
        INSERT INTO \`FmsPermissionGroups\` (\`seq\`, \`permissionGroupKey\`, \`permissionGroupName\`, \`permissionGroupDescription\`, \`sortNo\`, \`createdAt\`, \`createdIp\`, \`updatedAt\`, \`updatedIp\`, \`permissionGroupStatus\`, \`isDeletedRow\`) VALUES
        (1, 'T1617773784543MKLRZn', '최고 관리자 권한', '최고 관리자 권한 입니다.', 1, '2021-06-27 13:25:11', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'PEGRS00000001', 'N');
      `, { 
        type: QueryTypes.INSERT 
      }
    );



    // FmsMenuCategorys
    await sequelize.query(`
        INSERT INTO \`FmsMenuCategorys\` (\`seq\`, \`menuCategoryKey\`, \`menuCategoryName\`, \`menuCategoryDescription\`, \`sortNo\`, \`createdAt\`, \`createdIp\`, \`updatedAt\`, \`updatedIp\`, \`menuCategoryStatus\`, \`isDeletedRow\`) VALUES
        (2, 'mbDP1617174513479Idx', '회원관리', NULL, 200, '2021-03-31 16:08:33', '::ffff:172.17.0.1', '2021-04-04 11:43:48', '::ffff:172.17.0.1', 'MNCAT00000001', 'N'),
        (1, 'QlRJW1617152893906Tx', '대시보드', NULL, 100, '2021-03-31 10:08:13', '::ffff:172.17.0.1', '2021-04-04 11:43:48', '::ffff:172.17.0.1', 'MNCAT00000001', 'N'),
        (3, 'WUSL1617174672133nuR', '파일관리', NULL, 300, '2021-03-31 16:11:12', '::ffff:172.17.0.1', '2021-04-04 11:43:48', '::ffff:172.17.0.1', 'MNCAT00000001', 'N');
      `, { 
        type: QueryTypes.INSERT 
      }
    );



    // FmsMenus
    await sequelize.query(`
        INSERT INTO \`FmsMenus\` (\`seq\`, \`parentMenuKey\`, \`menuCategoryKey\`, \`menuKey\`, \`menuName\`, \`menuDescription\`, \`menuIconPath\`, \`menuLink\`, \`sortNo\`, \`createdAt\`, \`createdIp\`, \`updatedAt\`, \`updatedIp\`, \`menuStatus\`, \`isDeletedRow\`) VALUES
        (5, NULL, 'WUSL1617174672133nuR', 'Ig1617524166484wTSHK', '파일 관리', '파일 관리 메뉴', '<svg class="svg-icon" id="b5fd41b5-4857-41da-83a3-c37b0bb90138" data-name="레이어 1" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 81.99 100.17" style="width: 100%;"><path d="M88.64,11.34H85.71v72A8.68,8.68,0,0,1,77,92H23.77v2.67a5.54,5.54,0,0,0,5.53,5.53H88.63a5.54,5.54,0,0,0,5.54-5.53V16.87A5.53,5.53,0,0,0,88.64,11.34Z" transform="translate(-12.18)"/><path d="M47.37,88.83H77a5.54,5.54,0,0,0,5.54-5.53V5.53A5.54,5.54,0,0,0,77,0H37.5V1.83a5.68,5.68,0,0,1,0,.59V17.57a7.8,7.8,0,0,1-7.79,7.8H14.58l-.48,0H12.18v58a5.53,5.53,0,0,0,5.53,5.53H47.37ZM48.48,70H29.14a2.62,2.62,0,0,1,0-5.23H48.5a2.62,2.62,0,1,1,0,5.23ZM67.84,56.68H29.14a2.62,2.62,0,0,1,0-5.23h38.7a2.62,2.62,0,0,1,0,5.23ZM29.14,37.27h38.7a2.62,2.62,0,0,1,0,5.23H29.14a2.62,2.62,0,0,1,0-5.23Z" transform="translate(-12.18)"/><path d="M14.58,22.23h15.2a4.64,4.64,0,0,0,4.6-4.6V2.42A2.33,2.33,0,0,0,32,.08a2.27,2.27,0,0,0-1.63.69L12.93,18.25A2.33,2.33,0,0,0,14.58,22.23Z" transform="translate(-12.18)"/></svg>', 'file', 1, '2021-04-04 17:16:06', '::ffff:172.17.0.1', '2021-04-05 16:08:39', '::ffff:172.17.0.1', 'MENUS00000001', 'N'),
        (1, NULL, 'QlRJW1617152893906Tx', 'khPJl1617523858875yO', '대시보드', '대시보드 메뉴', '<svg class="svg-icon" version="1.1" id="Capa_1" xmlns="https://www.w3.org/2000/svg" xmlns:xlink="https://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 35.096 35.096" style="width:100%;enable-background:new 0 0 35.096 35.096;" xml:space="preserve"><g><g id="c55_speedometer"><path d="M28.955,10.215c-3.066-2.629-7.047-4.229-11.408-4.229C7.856,5.986,0,13.842,0,23.536c0,0.26,0.026,2.686,0.037,2.945v2.628h34.988v-2.437l0.033-0.191c0.011-0.26,0.038-2.686,0.038-2.945C35.097,14.934,28.955,10.215,28.955,10.215z M4.269,26.482c-0.014-0.16,0.006-2.49-0.005-2.65h3.6V22.67H4.517c0-0.014-0.253,0.002-0.253,0.002c0.142-3.014,1.29-6.02,3.458-8.391l0.09-0.098l0.162,0.141l2.395,2.397l0.751-0.754l-2.544-2.542c2.304-2.105,5.225-3.313,8.344-3.453h0.18c0,0,0.075-0.004,0.07,0.045v3.549h0.958V9.971c0.474,0.02,0.946,0.076,1.412,0.148c2.678,0.354,5.167,1.51,7.181,3.351l-2.539,2.54l0.705,0.71l2.439-2.44l0.134-0.107l0.116,0.152c2.108,2.305,3.314,5.225,3.457,8.344h-3.596v1.162l3.612-0.004c0,0,0.003,2.5-0.009,2.646L4.269,26.482z M22.27,18.094c0,0-5.708,1.752-6.801,2.842c-1.095,1.096-1.095,2.867,0.002,3.963c1.091,1.095,2.863,1.095,3.959,0C20.521,23.803,22.27,18.094,22.27,18.094z"/></g><g id="Capa_1_13_"></g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g></svg>', 'dashboard', 1, '2021-04-04 17:10:58', '::ffff:172.17.0.1', NULL, NULL, 'MENUS00000001', 'N'),
        (2, NULL, 'mbDP1617174513479Idx', 'kmRQ1617524080387RwV', '회사 관리', '회사 관리 메뉴', '<svg class="svg-icon" id="bold" enable-background="new 0 0 24 24" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg" style="width:100%;"><path d="m13.03 1.87-10.99-1.67c-.51-.08-1.03.06-1.42.39-.39.34-.62.83-.62 1.34v21.07c0 .55.45 1 1 1h3.25v-5.25c0-.97.78-1.75 1.75-1.75h2.5c.97 0 1.75.78 1.75 1.75v5.25h4.25v-20.4c0-.86-.62-1.59-1.47-1.73zm-7.53 12.88h-1.5c-.414 0-.75-.336-.75-.75s.336-.75.75-.75h1.5c.414 0 .75.336.75.75s-.336.75-.75.75zm0-3h-1.5c-.414 0-.75-.336-.75-.75s.336-.75.75-.75h1.5c.414 0 .75.336.75.75s-.336.75-.75.75zm0-3h-1.5c-.414 0-.75-.336-.75-.75s.336-.75.75-.75h1.5c.414 0 .75.336.75.75s-.336.75-.75.75zm0-3h-1.5c-.414 0-.75-.336-.75-.75s.336-.75.75-.75h1.5c.414 0 .75.336.75.75s-.336.75-.75.75zm5 9h-1.5c-.414 0-.75-.336-.75-.75s.336-.75.75-.75h1.5c.414 0 .75.336.75.75s-.336.75-.75.75zm0-3h-1.5c-.414 0-.75-.336-.75-.75s.336-.75.75-.75h1.5c.414 0 .75.336.75.75s-.336.75-.75.75zm0-3h-1.5c-.414 0-.75-.336-.75-.75s.336-.75.75-.75h1.5c.414 0 .75.336.75.75s-.336.75-.75.75zm0-3h-1.5c-.414 0-.75-.336-.75-.75s.336-.75.75-.75h1.5c.414 0 .75.336.75.75s-.336.75-.75.75z"/><path d="m22.62 10.842-7.12-1.491v14.649h6.75c.965 0 1.75-.785 1.75-1.75v-9.698c0-.826-.563-1.529-1.38-1.71zm-2.37 10.158h-1.5c-.414 0-.75-.336-.75-.75s.336-.75.75-.75h1.5c.414 0 .75.336.75.75s-.336.75-.75.75zm0-3h-1.5c-.414 0-.75-.336-.75-.75s.336-.75.75-.75h1.5c.414 0 .75.336.75.75s-.336.75-.75.75zm0-3h-1.5c-.414 0-.75-.336-.75-.75s.336-.75.75-.75h1.5c.414 0 .75.336.75.75s-.336.75-.75.75z"/></svg>', 'company', 1, '2021-04-04 17:14:40', '::ffff:172.17.0.1', '2021-04-05 14:51:36', '::ffff:172.17.0.1', 'MENUS00000001', 'N'),
        (6, NULL, 'WUSL1617174672133nuR', 'njHLKh1617524193166T', '파일 다운로드 현황', '파일 다운로드 현황 메뉴', '<svg class="svg-icon" id="Capa_1" enable-background="new 0 0 512 512" viewBox="0 0 512 512" xmlns="http://www.w3.org/2000/svg" style="width: 100%;"><g><path d="m496 166v-120c0-24.853-20.147-46-45-46s-45 21.147-45 46v135h75c8.284 0 15-6.716 15-15z"/><path d="m46 512h225.383c-9.518-12.574-15.383-28.052-15.383-45v-15h-225c-8.284 0-15 6.714-15 15v15c0 16.567 13.431 30 30 30z"/><path d="m76 422h195c8.284 0 15 6.714 15 15v30c0 24.853 20.147 45 45 45s45-20.147 45-45v-421c0-16.948 5.865-33.426 15.383-46-6.806 0-266.333 0-255.383 0-33.137 0-60 27.862-60 61zm180-361h60c8.291 0 15 6.709 15 15s-6.709 15-15 15h-60c-8.291 0-15-6.709-15-15s6.709-15 15-15zm0 90h60c8.291 0 15 6.709 15 15s-6.709 15-15 15h-60c-8.291 0-15-6.709-15-15s6.709-15 15-15zm0 90h60c8.291 0 15 6.709 15 15s-6.709 15-15 15h-60c-8.291 0-15-6.709-15-15s6.709-15 15-15zm0 90h60c8.291 0 15 6.709 15 15s-6.709 15-15 15h-60c-8.291 0-15-6.709-15-15s6.709-15 15-15zm-129.111-265.605c5.859-5.859 15.352-5.859 21.211 0l11.895 11.895 34.395-34.395c5.859-5.859 15.352-5.859 21.211 0s5.859 15.352 0 21.211l-45 45c-5.858 5.858-15.353 5.858-21.211 0l-22.5-22.5c-5.861-5.86-5.861-15.352-.001-21.211zm0 90c5.859-5.859 15.352-5.859 21.211 0l11.895 11.895 34.395-34.395c5.859-5.859 15.352-5.859 21.211 0s5.859 15.352 0 21.211l-45 45c-5.858 5.858-15.353 5.858-21.211 0l-22.5-22.5c-5.861-5.86-5.861-15.352-.001-21.211zm0 90c5.859-5.859 15.352-5.859 21.211 0l11.895 11.895 34.395-34.395c5.859-5.859 15.352-5.859 21.211 0s5.859 15.352 0 21.211l-45 45c-5.858 5.858-15.353 5.858-21.211 0l-22.5-22.5c-5.861-5.86-5.861-15.352-.001-21.211zm0 90c5.859-5.859 15.352-5.859 21.211 0l11.895 11.895 34.395-34.395c5.859-5.859 15.352-5.859 21.211 0s5.859 15.352 0 21.211l-45 45c-5.858 5.858-15.353 5.858-21.211 0l-22.5-22.5c-5.861-5.86-5.861-15.352-.001-21.211z"/></g></svg>', 'fileDownloadState', 2, '2021-04-04 17:16:33', '::ffff:172.17.0.1', NULL, NULL, 'MENUS00000001', 'N'),
        (3, NULL, 'mbDP1617174513479Idx', 'wjajq1617524117533xg', '회원 관리', '회원 관리 메뉴', '<svg class="svg-icon" id="ea938b32-21d3-4390-8d8a-b4ffda0e6e0b" data-name="레이어 1" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 100.46 60.02" style="width: 100%;"><path d="M49.69,49.79h.16C63,49.64,61.13,32,61.13,32c-.54-11.77-10.39-11.67-11.36-11.62S39,20.27,38.42,32C38.42,32.06,36.5,49.66,49.69,49.79Z" transform="translate(0.46 -20.41)"/><path d="M80.54,55.79h.13c10.59-.1,9.07-14.27,9.07-14.27-.44-9.46-8.35-9.38-9.14-9.36s-8.7-.1-9.13,9.36C71.47,41.54,69.93,55.69,80.54,55.79Z" transform="translate(0.46 -20.41)"/><path d="M100,70.15c-.08-3-.68-5.16-3.79-7.12-4.13-2.59-8.76-4.83-8.76-4.83L83.75,69.84l-2.14-6.11c3.77-5.26-.27-5.53-1-5.53h0c-.72,0-4.75.27-1,5.53l-2.14,6.09L73.78,58.18s-1.32.64-3.17,1.62a12.62,12.62,0,0,0-1.44-1c-5.14-3.23-10.88-6-10.88-6L53.72,67.21l-2.67-7.59c4.69-6.54-.33-6.87-1.24-6.89h0c-.9,0-5.92.33-1.23,6.89l-2.68,7.59L41.3,52.75s-5.74,2.8-10.88,6a15.9,15.9,0,0,0-1.46,1c-1.88-1-3.21-1.64-3.21-1.64L22.07,69.82l-2.14-6.09c3.76-5.26-.27-5.53-1-5.53h0c-.72,0-4.75.27-1,5.53l-2.14,6.09L12.09,58.18S7.46,60.42,3.33,63C.2,65-.37,67.09-.46,70.13v10.3H100Z" transform="translate(0.46 -20.41)"/><path d="M18.8,55.79h.12C29.53,55.69,28,41.52,28,41.52c-.43-9.46-8.35-9.38-9.13-9.36s-8.7-.1-9.14,9.36C9.72,41.54,8.2,55.69,18.8,55.79Z" transform="translate(0.46 -20.41)"/></svg>', 'user', 2, '2021-04-04 17:15:17', '::ffff:172.17.0.1', NULL, NULL, 'MENUS00000001', 'N'),
        (4, NULL, 'mbDP1617174513479Idx', 'ZCjC1617524137491OCy', '권한 그룹 관리', '권한 관리 메뉴', '<svg class="svg-icon" id="abc44ce3-a951-427f-8ea3-ec4978b3d47c" data-name="레이어 1" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 99.98 100.24" style="width: 100%;"><path d="M66.77,56.87A2.08,2.08,0,0,0,67,54.65l-.1-.23a10.24,10.24,0,0,0,2-6.42,3.34,3.34,0,0,1,.51-2.15,2.09,2.09,0,0,0,1.43-1.25c.24-.57,2.24-5.69,2.24-9.13a2.16,2.16,0,0,0-.06-.51,5.45,5.45,0,0,0-2-3V20.85C71,14.12,69,11.36,66.8,9.76,66.39,6.52,62.92,0,50.14,0,37.2,0,29.26,12.13,29.26,20.85V31.92a5.42,5.42,0,0,0-2,3,2.22,2.22,0,0,0-.06.51c0,3.43,2,8.56,2.24,9.13a1.79,1.79,0,0,0,1.27,1.2c.23.11.66.72.66,2.2,0,4,3,8.38,6.18,11.31-.44,2.73-2.48,10-6.84,11.77L12.15,77.26A14.52,14.52,0,0,0,2.59,87.58l-2.51,10A2.06,2.06,0,0,0,.46,99.4a2.09,2.09,0,0,0,1.65.81h0l54-.06A2.11,2.11,0,0,0,58.23,98V73a6.26,6.26,0,0,1,3.38-5.52,2.1,2.1,0,0,0,1.1-1.53A18.73,18.73,0,0,1,66.77,56.87Z" transform="translate(-0.02 0.03)"/><path d="M97.91,70.88H95.82V68.79a14.62,14.62,0,1,0-29.23,0v2.09H64.5A2.1,2.1,0,0,0,62.41,73V98a2.1,2.1,0,0,0,2.09,2.09H97.91A2.1,2.1,0,0,0,100,98V73A2.1,2.1,0,0,0,97.91,70.88ZM83.29,87v2.73a2.09,2.09,0,1,1-4.17,0V87A4.11,4.11,0,0,1,77,83.42a4.18,4.18,0,1,1,8.35,0A4.11,4.11,0,0,1,83.29,87Zm8.36-16.07H70.76V68.79a10.45,10.45,0,0,1,20.89,0v2.09Z" transform="translate(-0.02 0.03)"/></svg>', 'permissionGroup', 3, '2021-04-04 17:15:37', '::ffff:172.17.0.1', '2021-04-05 16:08:39', '::ffff:172.17.0.1', 'MENUS00000001', 'N');
      `, { 
        type: QueryTypes.INSERT 
      }
    );



    // FmsCompanys
    await sequelize.query(`
        INSERT INTO \`FmsCompanys\` (\`seq\`, \`companyKey\`, \`companyName\`, \`companyCEOName\`, \`companyCEOTel\`, \`companyTel\`, \`companyBusinessNumber\`, \`companyAddress\`, \`memo\`, \`createdAt\`, \`createdIp\`, \`updatedAt\`, \`updatedIp\`, \`companyStatus\`, \`isDeletedRow\`) VALUES
        (1, 'ovau1623568601311tXN', '선택안함', NULL, NULL, NULL, NULL, NULL, NULL, '2021-06-27 13:25:11', '::ffff:172.17.0.1', NULL, NULL, 'CMPST00000001', 'N');
      `, { 
        type: QueryTypes.INSERT 
      }
    );



    // FmsPermissions
    await sequelize.query(`
        INSERT INTO \`FmsPermissions\` (\`seq\`, \`menuKey\`, \`permissionKey\`, \`permissionName\`, \`permissionDescription\`, \`sortNo\`, \`createdAt\`, \`createdIp\`, \`updatedAt\`, \`updatedIp\`, \`isDeletedRow\`) VALUES
        (106, 'ZCjC1617524137491OCy', 'a1617688685796Oslkvi', '권한 그룹 목록-상세정보 접근권한', '권한 그룹 상세정보 접근 권한 여부', 1600, '2021-04-06 14:58:05', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (139, 'Ig1617524166484wTSHK', 'AbFp1617690053679MfC', '파일 목록-최신버전 업로드 날짜 칼럼 표시', '파일 목록중에 최신버전 업로드 날짜 칼럼 표시 여부', 2100, '2021-04-06 15:20:53', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (154, 'Ig1617524166484wTSHK', 'aefcC1617690712451ls', '파일 목록-상세정보-파일기본정보-파일 대표 이미지 표시', '파일 상세정보-파일기본정보에서 파일 대표 이미지 표시 여부', 3600, '2021-04-06 15:31:52', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (276, 'Ig1617524166484wTSHK', 'AG1619329923777LqIPy', '파일 목록 검색-최신 수정일 날짜 검색 가능', '최신 수정일 날짜로 검색할 수 있는 권한 여부', 850, '2021-04-25 14:52:03', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (287, 'Ig1617524166484wTSHK', 'AgJmIv1619349258683c', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-검색-파일 버전 검색 가능', '상세정보-발급된 파일 다운로드 URL 목록에서 파일 버전으로 검색할 수 있는 권한 여부', 6850, '2021-04-25 20:14:18', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (226, 'njHLKh1617524193166T', 'aIYW1617692258203RJf', '파일 다운로드 현황-다운로드 수 칼럼 표시', '파일 다운로드 현황중에 다운로드 수 칼럼 표시 여부', 1300, '2021-04-06 15:57:38', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (277, 'Ig1617524166484wTSHK', 'AJYRBGo1619330030498', '파일 목록 검색-최신 수정 IP 검색 가능', '파일 최신 수정시 IP로 검색할 수 있는 권한 여부', 1370, '2021-04-25 14:53:50', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (159, 'Ig1617524166484wTSHK', 'AMj1617690791072IKhi', '파일 목록-상세정보-파일버전정보-검색-버전명 검색 가능', '상세정보-파일버전정보에서 버전명으로 검색할 수 있는 권한 여부', 4100, '2021-04-06 15:33:11', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (97, 'ZCjC1617524137491OCy', 'AmvXq1617688538675PX', '권한 그룹 목록 검색-그룹 생성일 검색 가능', '그룹 생성일으로 검색할 수 있는 권한 여부', 700, '2021-04-06 14:55:38', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (181, 'Ig1617524166484wTSHK', 'ANqm1617691180937Vix', '파일 목록-상세정보-파일버전정보-상세정보-상태 수정 가능', '파일의 상세정보중 파일버전정보의 상세정보중 상태 수정 가능 여부', 6300, '2021-04-06 15:39:40', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (34, 'kmRQ1617524080387RwV', 'ari1617685257015eQbK', '회사 목록-상세정보-대표자 연락처 표시', '회사 상세정보 화면에서 대표자 연락처 표시 여부', 2800, '2021-04-06 14:00:57', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (11, 'kmRQ1617524080387RwV', 'at1617683568543MQpfL', '회사 목록 검색-사업자번호 검색 가능', '사업자번호로 검색할 수 있는 권한 여부', 500, '2021-04-06 13:32:48', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (80, 'wjajq1617524117533xg', 'AVQ1617688011683veXo', '회원 목록-메모 칼럼 표시', '회원 목록중에 메모 칼럼 표시 여부', 5610, '2021-04-06 14:46:51', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (4, 'khPJl1617523858875yO', 'aWlu1617682826097pZe', '총 다운로드 된 용량 표시', '대시보드 메뉴 진입 후, 총 다운로드 된 용량 데이터 표시 여부', 400, '2021-04-06 13:20:26', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (145, 'Ig1617524166484wTSHK', 'B1617690143101zIeSOm', '파일 목록-상세정보 접근권한', '파일 상세정보 접근 권한 여부', 2700, '2021-04-06 15:22:23', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (202, 'Ig1617524166484wTSHK', 'bezBsTe1617691493886', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-상태 표시', '파일의 상세정보중 발급된 파일 다운로드 URL 목록의 상세정보중 상태 표시 여부', 8400, '2021-04-06 15:44:53', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (31, 'kmRQ1617524080387RwV', 'bffuH1617685179867jM', '회사 목록-상세정보-사업자번호 표시', '회사 상세정보 화면에서 사업자번호 표시 여부', 2500, '2021-04-06 13:59:39', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (22, 'kmRQ1617524080387RwV', 'BfX1617685011279bGbM', '회사 목록-사업장주소 칼럼 표시', '회사 목록중에 사업장주소 칼럼 표시 여부', 1600, '2021-04-06 13:56:51', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (156, 'Ig1617524166484wTSHK', 'BfX1617690742857nUXg', '파일 목록-상세정보-파일버전정보 항목 전체표시', '파일의 상세정보중 파일버전정보의 모든 항목을 볼 수 있는 권한 여부', 3800, '2021-04-06 15:32:22', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (124, 'Ig1617524166484wTSHK', 'bHELBPm1617689088683', '파일 목록 검색-파일 메모 검색 가능', '파일 메모으로 검색할 수 있는 권한 여부', 600, '2021-04-06 15:04:48', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (222, 'njHLKh1617524193166T', 'BLhIHQl1617692205962', '파일 다운로드 현황-회사명 칼럼 표시', '파일 다운로드 현황중에 회사명 칼럼 표시 여부', 900, '2021-04-06 15:56:45', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (138, 'Ig1617524166484wTSHK', 'BnjjNb1617690039693C', '파일 목록-최초 업로드 날짜 칼럼 표시', '파일 목록중에 최초 업로드 날짜 칼럼 표시 여부', 2000, '2021-04-06 15:20:39', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (177, 'Ig1617524166484wTSHK', 'BsB1617691124123HVpg', '파일 목록-상세정보-파일버전정보-상세정보-버전명 수정 가능', '파일의 상세정보중 파일버전정보의 상세정보중 버전명 수정 가능 여부', 5900, '2021-04-06 15:38:44', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (25, 'kmRQ1617524080387RwV', 'BV1617685057809IWBVM', '회사 목록-회사 전화번호 칼럼 표시', '회사 목록중에 회사 전화번호 칼럼 표시 여부', 1900, '2021-04-06 13:57:37', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (164, 'Ig1617524166484wTSHK', 'c1617690872222vwsBwH', '파일 목록-상세정보-파일버전정보-검색-메모 검색 가능', '상세정보-파일버전정보에서 메모로 검색할 수 있는 권한 여부', 4600, '2021-04-06 15:34:32', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (122, 'Ig1617524166484wTSHK', 'cGVs1617689058125dEv', '파일 목록 검색-파일 라벨명 검색 가능', '파일 라벨명으로 검색할 수 있는 권한 여부', 400, '2021-04-06 15:04:18', '::ffff:172.17.0.1', '2021-04-07 13:40:34', '::ffff:172.17.0.1', 'N'),
        (249, 'Ig1617524166484wTSHK', 'cjozg1619158988578Dy', '파일 목록-상세정보-파일기본정보-파일메모 수정', '파일 기본정보중에 파일메모를 수정할 수 있는 권한 여부', 3703, '2021-04-23 15:23:08', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (63, 'wjajq1617524117533xg', 'CKVwoUj1617686385077', '회원 목록-가입일 칼럼 표시', '회원 목록중에 가입일 칼럼 표시 여부', 5700, '2021-04-06 14:19:45', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (83, 'wjajq1617524117533xg', 'cLEJF1617688140500lx', '회원 목록-상세정보-ID 수정 권한', '회원 상세정보중에 ID를 수정할 수 있는 권한 여부', 7100, '2021-04-06 14:49:00', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (199, 'Ig1617524166484wTSHK', 'cLEUrrW1617691447795', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-다운로드 제한 횟수 표시', '파일의 상세정보중 발급된 파일 다운로드 URL 목록의 상세정보중 다운로드 제한 횟수 표시 여부', 8100, '2021-04-06 15:44:07', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (149, 'Ig1617524166484wTSHK', 'CMxWUV1617690606711D', '파일 목록-상세정보-파일기본정보-파일 메모 표시', '파일 상세정보-파일기본정보에서 파일 메모 표시 여부', 3100, '2021-04-06 15:30:06', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (69, 'wjajq1617524117533xg', 'cTP1617686537729CtUL', '회원 목록-상세정보-회사 표시', '회원 상세정보 화면에서 회사 표시 여부', 6300, '2021-04-06 14:22:17', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (201, 'Ig1617524166484wTSHK', 'CVWk1617691479896GIj', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-URL 생성일 표시', '파일의 상세정보중 발급된 파일 다운로드 URL 목록의 상세정보중 URL 생성일 표시 여부', 8300, '2021-04-06 15:44:39', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (91, 'ZCjC1617524137491OCy', 'CZp1617688337684iIEj', '권한 그룹 관리 메뉴 표시', '관리자 진입시, 좌측 메뉴영역에 권한 그룹 관리 메뉴 표시 여부', 100, '2021-04-06 14:52:17', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (173, 'Ig1617524166484wTSHK', 'CZQmk1617691008392OB', '파일 목록-상세정보-파일버전정보-목록-최근 수정 날짜 표시', '파일의 상세정보중 파일버전정보의 목록에서 최근 수정 날짜 표시 여부', 5500, '2021-04-06 15:36:48', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (212, 'Ig1617524166484wTSHK', 'd1617691641464Ptmvjx', '발급된 파일 다운로드 URL 목록 삭제 권한', '발급된 파일 다운로드 URL 목록를 삭제할 수 있는 권한 여부', 9400, '2021-04-06 15:47:21', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (224, 'njHLKh1617524193166T', 'd1617692233012pBOUCK', '파일 다운로드 현황-파일 버전 칼럼 표시', '파일 다운로드 현황중에 파일 버전 칼럼 표시 여부', 1100, '2021-04-06 15:57:13', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (210, 'Ig1617524166484wTSHK', 'DfCM1617691613278YYD', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-상세정보-상태 수정 가능', '파일의 상세정보중 발급된 파일 다운로드 URL 목록의 상세정보중 상태 수정 가능 여부', 9200, '2021-04-06 15:46:53', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (198, 'Ig1617524166484wTSHK', 'dI1617691432796fQpqX', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-다운로드 제한 기간 표시', '파일의 상세정보중 발급된 파일 다운로드 URL 목록의 상세정보중 다운로드 제한 기간 표시 여부', 8000, '2021-04-06 15:43:52', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (265, 'wjajq1617524117533xg', 'DjC1619317945380XwHe', '회원 목록 검색-부모 회원명 검색 가능', '부모 회원명으로 검색할 수 있는 권한 여부', 4460, '2021-04-25 11:32:25', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (219, 'njHLKh1617524193166T', 'dm1617692163075KPdEO', '파일 다운로드 현황 검색-조회 기간(월 단위) 검색 가능', '조회 기간(월 단위)로 검색할 수 있는 권한 여부', 600, '2021-04-06 15:56:03', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (21, 'kmRQ1617524080387RwV', 'dNrN1617684996447qOA', '회사 목록-사업자번호 칼럼 표시', '회사 목록중에 사업자번호 칼럼 표시 여부', 1500, '2021-04-06 13:56:36', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (129, 'Ig1617524166484wTSHK', 'DrB1617689900021tJru', '파일 목록 검색-최신버전 업로더 ID 검색 가능', '최신버전 업로더 ID로 검색할 수 있는 권한 여부', 1100, '2021-04-06 15:18:20', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (218, 'njHLKh1617524193166T', 'DTQTW1617692148089HN', '파일 다운로드 현황 검색-회사명 검색 가능', '회사명으로 검색할 수 있는 권한 여부', 500, '2021-04-06 15:55:48', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (261, 'kmRQ1617524080387RwV', 'DUrVJAA1619312521414', '회사 목록 검색-회사 등록시 IP 검색 가능', '회사를 등록했을 당시 IP로 검색할 수 있는 권한 여부', 1020, '2021-04-25 10:02:01', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (118, 'ZCjC1617524137491OCy', 'dxO1617688869086NNkT', '권한 그룹 삭제 권한', '권한 그룹을 삭제 할 수 있는 권한 여부', 2800, '2021-04-06 15:01:09', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (180, 'Ig1617524166484wTSHK', 'E1617691168179MGcCVF', '파일 목록-상세정보-파일버전정보-상세정보-버전 설명글 수정 가능', '파일의 상세정보중 파일버전정보의 상세정보중 버전 설명글 수정 가능 여부', 6200, '2021-04-06 15:39:28', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (235, 'njHLKh1617524193166T', 'e1617692383447Gjzzxi', '파일 다운로드 현황-상세정보-총 다운로드 수 칼럼 표시', '파일 다운로드 현황의 상세정보중 총 다운로드 수 칼럼 표시 여부', 2200, '2021-04-06 15:59:43', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (64, 'wjajq1617524117533xg', 'eBs1617686402027CkkN', '회원 목록-가입시 IP 주소 칼럼 표시', '회원 목록중에 가입시 IP 주소 칼럼 표시 여부', 5800, '2021-04-06 14:20:02', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (208, 'Ig1617524166484wTSHK', 'ehV1617691582518czOk', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-상세정보-다운로드 제한 횟수 수정 가능', '파일의 상세정보중 발급된 파일 다운로드 URL 목록의 상세정보중 다운로드 제한 횟수 수정 가능 여부', 9000, '2021-04-06 15:46:22', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (88, 'wjajq1617524117533xg', 'ej1617688228080etHji', '회원 목록-상세정보-권한그룹 수정 권한', '회원 상세정보중에 권한그룹을 수정할 수 있는 권한 여부', 7600, '2021-04-06 14:50:28', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (130, 'Ig1617524166484wTSHK', 'EKvU1617689917992Jfr', '파일 목록 검색-등록된 다운로드 URL 갯수 검색 가능', '등록된 다운로드 URL 갯수로 검색할 수 있는 권한 여부', 1200, '2021-04-06 15:18:37', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (251, 'Ig1617524166484wTSHK', 'ENRTwOP1619159031243', '파일 목록-상세정보-파일기본정보-외부에 파일 버전의 변경 이력 노출 여부 수정', '파일 기본정보중에 외부에 파일 버전의 변경 이력 노출 여부를 수정할 수 있는 권한 여부', 3705, '2021-04-23 15:23:51', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (79, 'wjajq1617524117533xg', 'eP1617687968986kdbbj', '회원 목록 검색-메모 검색 가능', '메모로 검색할 수 있는 권한 여부', 4810, '2021-04-06 14:46:08', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (209, 'Ig1617524166484wTSHK', 'eqaOCnz1617691599380', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-상세정보-현재 다운로드 수 초기화 가능', '파일의 상세정보중 발급된 파일 다운로드 URL 목록의 상세정보중 현재 다운로드 수 초기화 가능 여부', 9100, '2021-04-06 15:46:39', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (29, 'kmRQ1617524080387RwV', 'EtrLWDJ1617685141878', '회사 목록-상세정보-전체 표시', '회사의 모든 상세정보 항목을 볼 수 있는 권한 여부', 2300, '2021-04-06 13:59:01', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (54, 'wjajq1617524117533xg', 'EuJg1617686102052Yxd', '회원 목록 검색-휴대폰번호 검색 가능', '휴대폰번호로 검색할 수 있는 권한 여부', 4800, '2021-04-06 14:15:02', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (176, 'Ig1617524166484wTSHK', 'euWF1617691083886NiK', '파일 목록-상세정보-파일버전정보-목록-상태 표시', '파일의 상세정보중 파일버전정보의 목록에서 상태 표시 여부', 5800, '2021-04-06 15:38:03', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (114, 'ZCjC1617524137491OCy', 'eXYOni1617688817371c', '권한 그룹 목록-상세정보-권한 그룹명 수정 권한', '권한 그룹 상세정보중에 권한 그룹명을 수정할 수 있는 권한 여부', 2400, '2021-04-06 15:00:17', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (196, 'Ig1617524166484wTSHK', 'f1617691404392ERzflF', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-타겟 버전명 표시', '파일의 상세정보중 발급된 파일 다운로드 URL 목록의 상세정보중 타겟 버전명 표시 여부', 7800, '2021-04-06 15:43:24', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (243, 'wjajq1617524117533xg', 'F1619012225347uuKMhw', '회원 생성 권한', '회원을 생성할 수 있는 권한 여부', 4150, '2021-04-21 22:37:05', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (260, 'ZCjC1617524137491OCy', 'F1619180812531eiRqVu', '권한 그룹 목록-상세정보-순서 수정 권한', '권한 그룹 상세정보중에 순서를 수정할 수 있는 권한 여부', 2650, '2021-04-23 21:26:52', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (233, 'njHLKh1617524193166T', 'FAjHVhu1617692354429', '파일 다운로드 현황-상세정보-버전 파일명 칼럼 표시', '파일 다운로드 현황의 상세정보중 버전 파일명 칼럼 표시 여부', 2000, '2021-04-06 15:59:14', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (104, 'ZCjC1617524137491OCy', 'fBE1617688648208MMwd', '권한 그룹 복제 권한', '그룹을 복제 할 수 있는 권한 여부', 1400, '2021-04-06 14:57:28', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (65, 'wjajq1617524117533xg', 'fddW1617686414741VCr', '회원 목록-상태 칼럼 표시', '회원 목록중에 상태 칼럼 표시 여부', 5900, '2021-04-06 14:20:14', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (150, 'Ig1617524166484wTSHK', 'fj1617690622230Lffft', '파일 목록-상세정보-파일기본정보-파일 설명글 표시', '파일 상세정보-파일기본정보에서 파일 설명글 표시 여부', 3200, '2021-04-06 15:30:22', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (47, 'kmRQ1617524080387RwV', 'FJIyt1617685724474xG', '회사 삭제 권한', '회사를 삭제 할 수 있는 권한 여부', 4100, '2021-04-06 14:08:44', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (18, 'kmRQ1617524080387RwV', 'flfE1617684930419rMf', '회사 목록 표시', '회사 목록을 확인할 수 있는 권한 여부', 1200, '2021-04-06 13:55:30', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (45, 'kmRQ1617524080387RwV', 'FsLLW1617685677061iv', '회사 목록-상세정보-메모 수정 권한', '회사 상세정보중에 메모를 수정할 수 있는 권한 여부', 3900, '2021-04-06 14:07:57', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (185, 'Ig1617524166484wTSHK', 'FV1617691241638WOtiK', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-검색-전체 검색 가능', '상세정보-발급된 파일 다운로드 URL 목록에서 모든 검색 조건을 이용할 수 있는 권한 여부', 6700, '2021-04-06 15:40:41', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (16, 'kmRQ1617524080387RwV', 'fWHJmEv1617684892794', '회사 목록 검색-등록일 기간 검색 가능', '회사 등록일 기간으로 검색할 수 있는 권한 여부', 1000, '2021-04-06 13:54:52', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (272, 'wjajq1617524117533xg', 'FXPCTN1619320182255r', '회원 목록-권한그룹명 칼럼 표시', '회원 목록중에 권한그룹명 칼럼 표시 여부', 5250, '2021-04-25 12:09:42', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (30, 'kmRQ1617524080387RwV', 'G1617685160282ZmcCrM', '회사 목록-상세정보-회사명 표시', '회사 상세정보 화면에서 회사명 표시 여부', 2400, '2021-04-06 13:59:20', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (214, 'njHLKh1617524193166T', 'gaXltl1617692064737B', '파일 다운로드 현황 메뉴 표시', '관리자 진입시, 좌측 메뉴영역에 파일 다운로드 현황 메뉴 표시 여부', 100, '2021-04-06 15:54:24', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (76, 'kmRQ1617524080387RwV', 'GOH1617687091505GMAz', '회사 목록 검색-메모 검색 가능', '회사 메모로 검색할 수 있는 권한 여부', 1050, '2021-04-06 14:31:31', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (253, 'Ig1617524166484wTSHK', 'GpGYwJt1619159095273', '파일 목록-상세정보-파일기본정보-파일 관련 스크린샷 수정', '파일 기본정보중에 파일 관련 스크린샷를 수정할 수 있는 권한 여부', 3707, '2021-04-23 15:24:55', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (59, 'wjajq1617524117533xg', 'gq1617686317373XHpoz', '회원 목록-ID 칼럼 표시', '회원 목록중에 ID 칼럼 표시 여부', 5300, '2021-04-06 14:18:37', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (275, 'Ig1617524166484wTSHK', 'gQ1619329353880lFZTV', '파일 목록 검색-최초 업로더 이름 검색 가능', '파일 최초 업로더의 이름을 검색할 수 있는 권한 여부', 1010, '2021-04-25 14:42:33', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (90, 'wjajq1617524117533xg', 'gQdEs1617688259139el', '회원 삭제 권한', '회원을 삭제 할 수 있는 권한 여부', 7800, '2021-04-06 14:50:59', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (262, 'kmRQ1617524080387RwV', 'gSutwYw1619312843781', '회사 목록 검색-최근수정일 검색 가능', '회사 최근 수정일 기간으로 검색할 수 있는 권한 여부', 1010, '2021-04-25 10:07:23', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (225, 'njHLKh1617524193166T', 'GsZD1617692246060Zhy', '파일 다운로드 현황-버전 파일명 칼럼 표시', '파일 다운로드 현황중에 버전 파일명 칼럼 표시 여부', 1200, '2021-04-06 15:57:26', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (207, 'Ig1617524166484wTSHK', 'GuP1617691566626dvRA', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-상세정보-다운로드 제한 기간 수정 가능', '파일의 상세정보중 발급된 파일 다운로드 URL 목록의 상세정보중 다운로드 제한 기간 수정 가능 여부', 8900, '2021-04-06 15:46:06', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (152, 'Ig1617524166484wTSHK', 'hAdZzX1617690656103W', '파일 목록-상세정보-파일기본정보-외부에 파일 설명글 노출 여부 표시', '파일 상세정보-파일기본정보에서 외부에 파일 설명글 노출 여부 표시 여부', 3400, '2021-04-06 15:30:56', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (8, 'kmRQ1617524080387RwV', 'hiim1617683467594YRY', '회사 목록 검색 영역 표시', '회사 관리 메뉴 진입시, 상단에 검색 기능 표시 여부', 200, '2021-04-06 13:31:07', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (171, 'Ig1617524166484wTSHK', 'hk1617690976759OMcvp', '파일 목록-상세정보-파일버전정보-목록-업로드 날짜 표시', '파일의 상세정보중 파일버전정보의 목록에서 업로드 날짜 표시 여부', 5300, '2021-04-06 15:36:16', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (87, 'wjajq1617524117533xg', 'hpXEml1617688212167t', '회원 목록-상세정보-메모 수정 권한', '회원 상세정보중에 메모를 수정할 수 있는 권한 여부', 7500, '2021-04-06 14:50:12', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (92, 'ZCjC1617524137491OCy', 'HSrbpC1617688399581M', '권한 그룹 목록 검색 영역 표시', '권한 관리 메뉴 진입시, 상단에 검색 기능 표시 여부', 200, '2021-04-06 14:53:19', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (257, 'Ig1617524166484wTSHK', 'htAo1619178257967HIQ', '파일 목록-상세정보-파일버전정보-상세정보-버전의 파일 수정 가능', '파일의 상세정보중 파일버전정보의 상세정보중 버전의 파일을 수정 가능 여부', 5950, '2021-04-23 20:44:17', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (284, 'Ig1617524166484wTSHK', 'hWidbcN1619346254899', '파일 목록-상세정보-파일버전정보-등록시 IP 검색 가능', '상세정보-파일버전정보에서 등록시 IP로 검색할 수 있는 권한 여부', 4320, '2021-04-25 19:24:14', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (146, 'Ig1617524166484wTSHK', 'hYuWBv1617690156495B', '파일 목록-상세정보-전체표시 (삭제 예정)', '파일의 모든 상세정보 항목을 볼 수 있는 권한 여부', 2800, '2021-04-06 15:22:36', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (12, 'kmRQ1617524080387RwV', 'i1617683608391leidZG', '회사 목록 검색-사업장주소 검색 가능', '사업장주소로 검색할 수 있는 권한 여부', 600, '2021-04-06 13:33:28', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (242, 'wjajq1617524117533xg', 'IEjNkA1619012061260L', '모든 회원 컨트롤 가능', '자신의 하위 계정만이 아닌 모든 계정에 대한 접근을 허용하는 권한', 4100, '2021-04-21 22:34:21', '::ffff:172.17.0.1', NULL, NULL, 'Y'),
        (254, 'Ig1617524166484wTSHK', 'iFnb1619159115861ZNK', '파일 목록-상세정보-파일기본정보-파일 대표 이미지 수정', '파일 기본정보중에 파일 대표 이미지를 수정할 수 있는 권한 여부', 3708, '2021-04-23 15:25:15', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (162, 'Ig1617524166484wTSHK', 'IK1617690837240SCNQm', '파일 목록-상세정보-파일버전정보-검색-상태 검색 가능', '상세정보-파일버전정보에서 상태로 검색할 수 있는 권한 여부', 4400, '2021-04-06 15:33:57', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (58, 'wjajq1617524117533xg', 'iPUUDQ1617686168385p', '회원 목록-No 칼럼 표시', '회원 목록중에 No 칼럼 표시 여부', 5200, '2021-04-06 14:16:08', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (163, 'Ig1617524166484wTSHK', 'iSlJMH1617690853579K', '파일 목록-상세정보-파일버전정보-검색-버전 설명글 검색 가능', '상세정보-파일버전정보에서 버전 설명글로 검색할 수 있는 권한 여부', 4500, '2021-04-06 15:34:13', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (112, 'ZCjC1617524137491OCy', 'ismBZfa1617688788569', '권한 그룹 목록-상세정보-허용된 권한 표시', '권한 그룹 상세정보 화면에서 허용된 권한 표시 여부', 2200, '2021-04-06 14:59:48', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (120, 'Ig1617524166484wTSHK', 'isphYm1617689015822t', '파일 목록 검색 영역 표시', '파일 관리 메뉴 진입시, 상단에 검색 기능 표시 여부', 200, '2021-04-06 15:03:35', '::ffff:172.17.0.1', '2021-04-07 13:40:34', '::ffff:172.17.0.1', 'N'),
        (60, 'wjajq1617524117533xg', 'itn1617686335680DnoA', '회원 목록-회사명 칼럼 표시', '회원 목록중에 회사명 칼럼 표시 여부', 5400, '2021-04-06 14:18:55', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (274, 'Ig1617524166484wTSHK', 'ItzQ1619329144821EAy', '파일 목록 검색-최초 업로드 IP 검색 가능', '파일 최초 업로드시 IP로 검색할 수 있는 권한 여부', 1350, '2021-04-25 14:39:04', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (99, 'ZCjC1617524137491OCy', 'IuJ1617688567172AqFn', '권한 그룹 목록-No 칼럼 표시', '권한 그룹 목록중에 No 칼럼 표시 여부', 900, '2021-04-06 14:56:07', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (283, 'Ig1617524166484wTSHK', 'ivD1619346146187qBeA', '파일 목록-상세정보-파일버전정보-파일 종류 검색 가능', '상세정보-파일버전정보에서 파일 종류로 검색할 수 있는 권한 여부', 4240, '2021-04-25 19:22:26', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (41, 'kmRQ1617524080387RwV', 'J1617685612715KKtEoM', '회사 목록-상세정보-사업장주소 수정 권한', '회사 상세정보중에 사업장주소를 수정할 수 있는 권한 여부', 3500, '2021-04-06 14:06:52', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (100, 'ZCjC1617524137491OCy', 'jahWg1617688582449bI', '권한 그룹 목록-권한 그룹명 칼럼 표시', '권한 그룹 목록중에 권한 그룹명 칼럼 표시 여부', 1000, '2021-04-06 14:56:22', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (1, 'khPJl1617523858875yO', 'JB1617682637993GaPCK', '대시보드 메뉴 표시', '관리자 진입시, 좌측 메뉴영역에 대시보드 메뉴 표시 여부', 100, '2021-04-06 13:17:17', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (168, 'Ig1617524166484wTSHK', 'JB1617690933433tLluC', '파일 목록-상세정보-파일버전정보-목록-버전명 표시', '파일의 상세정보중 파일버전정보의 목록에서 버전명 표시 여부', 5000, '2021-04-06 15:35:33', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (133, 'Ig1617524166484wTSHK', 'jdKBH1617689963499uB', '파일 목록-No 칼럼 표시', '파일 목록중에 No 칼럼 표시 여부', 1500, '2021-04-06 15:19:23', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (206, 'Ig1617524166484wTSHK', 'jEi1617691551741tSOG', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-상세정보-타겟버전 수정 가능', '파일의 상세정보중 발급된 파일 다운로드 URL 목록의 상세정보중 타겟버전 수정 가능 여부', 8800, '2021-04-06 15:45:51', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (13, 'kmRQ1617524080387RwV', 'JGd1617683646183nWBz', '회사 목록 검색-대표자명 검색 가능', '대표자명으로 검색할 수 있는 권한 여부', 700, '2021-04-06 13:34:06', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (288, 'Ig1617524166484wTSHK', 'JgPbu1619349344177QQ', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-검색-URL 접근 시도 갯수 검색 가능', '상세정보-발급된 파일 다운로드 URL 목록에서 URL 접근 시도 갯수로 검색할 수 있는 권한 여부', 6870, '2021-04-25 20:15:44', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (74, 'wjajq1617524117533xg', 'JpHo1617686614042tGn', '회원 목록-상세정보-권한 그룹 표시', '회원 상세정보 화면에서 권한 그룹 표시 여부', 6800, '2021-04-06 14:23:34', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (14, 'kmRQ1617524080387RwV', 'jw1617683662584Mxqxo', '회사 목록 검색-대표자 연락처 검색 가능', '대표자 연락처로 검색할 수 있는 권한 여부', 800, '2021-04-06 13:34:22', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (71, 'wjajq1617524117533xg', 'K1617686570367IbIEqY', '회원 목록-상세정보-휴대폰 번호 표시', '회원 상세정보 화면에서 휴대폰 번호 표시 여부', 6500, '2021-04-06 14:22:50', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (98, 'ZCjC1617524137491OCy', 'k1617688553902XjzFCy', '권한 그룹 목록 표시', '권한 그룹 목록을 확인할 수 있는 권한 여부', 800, '2021-04-06 14:55:53', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (183, 'Ig1617524166484wTSHK', 'KA1617691210754FxPXn', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록 표시', '파일의 상세정보중 발급된 파일 다운로드 URL 목록을 볼 수 있는 권한 여부', 6500, '2021-04-06 15:40:10', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (189, 'Ig1617524166484wTSHK', 'KbbF1617691303153rpx', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-검색-URL 생성일 검색 가능', '상세정보-발급된 파일 다운로드 URL 목록에서 URL 생성일로 검색할 수 있는 권한 여부', 7100, '2021-04-06 15:41:43', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (269, 'wjajq1617524117533xg', 'kCdm1619318907675TCu', '회원 목록 검색-회원 상태 검색 가능', '회원 상태로 검색할 수 있는 권한 여부', 5070, '2021-04-25 11:48:27', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (78, 'kmRQ1617524080387RwV', 'kCijoiw1617687245845', '회사 목록-상세정보-메모 표시', '회사 상세정보 화면에서 메모 표시 여부', 3010, '2021-04-06 14:34:05', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (23, 'kmRQ1617524080387RwV', 'kCs1617685025399aUmD', '회사 목록-대표자명 칼럼 표시', '회사 목록중에 대표자명 칼럼 표시 여부', 1700, '2021-04-06 13:57:05', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (248, 'Ig1617524166484wTSHK', 'kgHt1619158968829afj', '파일 목록-상세정보-파일기본정보-파일라벨명 수정', '파일 기본정보중에 파일라벨명을 수정할 수 있는 권한 여부', 3702, '2021-04-23 15:22:48', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (157, 'Ig1617524166484wTSHK', 'kkbes1617690757342iF', '파일 목록-상세정보-파일버전정보-검색 영역 표시', '파일 상세정보-파일버전정보에서 상단에 검색 기능 표시 여부', 3900, '2021-04-06 15:32:37', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (20, 'kmRQ1617524080387RwV', 'KL1617684973373YzQOa', '회사 목록-회사명 칼럼 표시', '회사 목록중에 회사명 칼럼 표시 여부', 1400, '2021-04-06 13:56:13', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (48, 'wjajq1617524117533xg', 'ku1617685799109yKitW', '회원 관리 메뉴 표시', '관리자 진입시, 좌측 메뉴영역에 회원 관리 메뉴 표시 여부', 4200, '2021-04-06 14:09:59', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (38, 'kmRQ1617524080387RwV', 'kuRI1617685328685PCL', '회사 목록-상세정보-전체 수정 권한', '회사 상세정보의 모든 항목을 수정할 수 있는 권한 여부', 3200, '2021-04-06 14:02:08', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (247, 'Ig1617524166484wTSHK', 'Kx1619158838238pCDXS', '파일 목록-상세정보-파일기본정보-전체수정', '파일 기본정보를 모두 수정할 수 있는 권한 여부', 3701, '2021-04-23 15:20:38', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (255, 'Ig1617524166484wTSHK', 'KygH1619159135190rkp', '파일 목록-상세정보-파일기본정보-파일상태 수정', '파일 기본정보중에 파일상태를 수정할 수 있는 권한 여부', 3709, '2021-04-23 15:25:35', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (89, 'wjajq1617524117533xg', 'L1617688242674YwkQAy', '회원 목록-상세정보-상태 수정 권한', '회원 상세정보중에 상태를 수정할 수 있는 권한 여부', 7700, '2021-04-06 14:50:42', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (136, 'Ig1617524166484wTSHK', 'LEjRdC1617690010717t', '파일 목록-파일 설명 칼럼 표시', '파일 목록중에 파일 설명 칼럼 표시 여부', 1800, '2021-04-06 15:20:10', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (155, 'Ig1617524166484wTSHK', 'ljd1617690728230OcUc', '파일 목록-상세정보-파일기본정보-파일 상태 표시', '파일 상세정보-파일기본정보에서 파일 상태 표시 여부', 3700, '2021-04-06 15:32:08', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (204, 'Ig1617524166484wTSHK', 'lpIglo1617691523078e', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-다운로드 (접근)제한 표시', '파일의 상세정보중 발급된 파일 다운로드 URL 목록의 상세정보중 다운로드 (접근)제한 표시 여부', 8600, '2021-04-06 15:45:23', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (291, 'Ig1617524166484wTSHK', 'LuKd1619833701072JIk', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-상세정보 접근 가능', '파일의 상세정보중 발급된 파일 다운로드 URL 목록의 상세정보에 접근 가능 여부', 8695, '2021-05-01 10:48:21', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (57, 'wjajq1617524117533xg', 'lundi1617686154398kN', '회원 목록 표시', '회원 목록을 확인할 수 있는 권한 여부', 5100, '2021-04-06 14:15:54', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (110, 'ZCjC1617524137491OCy', 'Lzt1617688759421oAZD', '권한 그룹 목록-상세정보-생성일 표시', '권한 그룹 상세정보 화면에서 생성일 표시 여부', 2000, '2021-04-06 14:59:19', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (86, 'wjajq1617524117533xg', 'm1617688197706pJPsHd', '회원 목록-상세정보-휴대폰 번호 수정 권한', '회원 상세정보중에 휴대폰 번호를 수정할 수 있는 권한 여부', 7400, '2021-04-06 14:49:57', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (103, 'ZCjC1617524137491OCy', 'M1617688625942lyFAFR', '권한 그룹 목록-상태 칼럼 표시', '권한 그룹 목록중에 상태 칼럼 표시 여부', 1300, '2021-04-06 14:57:05', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (140, 'Ig1617524166484wTSHK', 'M1617690067526aqQSFx', '파일 목록-최초 업로더 ID 칼럼 표시', '파일 목록중에 최초 업로더의 ID 칼럼 표시 여부', 2200, '2021-04-06 15:21:07', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (220, 'njHLKh1617524193166T', 'm1617692177732ZCXxbX', '파일 다운로드 현황 표시', '파일 다운로드 현황을 확인할 수 있는 권한 여부', 700, '2021-04-06 15:56:17', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (134, 'Ig1617524166484wTSHK', 'mbFzwxc1617689977402', '파일 목록-파일 라벨명 칼럼 표시', '파일 목록중에 파일 라벨명 칼럼 표시 여부', 1600, '2021-04-06 15:19:37', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (190, 'Ig1617524166484wTSHK', 'mdoI1617691317329jJl', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-검색-다운로드 제한 검색 가능', '상세정보-발급된 파일 다운로드 URL 목록에서 다운로드 제한으로 검색할 수 있는 권한 여부', 7200, '2021-04-06 15:41:57', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (35, 'kmRQ1617524080387RwV', 'Mi1617685275873ocgKZ', '회사 목록-상세정보-회사 전화번호 표시', '회사 상세정보 화면에서 회사 전화번호 표시 여부', 2900, '2021-04-06 14:01:15', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (268, 'wjajq1617524117533xg', 'mJCF1619318709313ysH', '회원 목록 검색-회원 등급 검색 가능', '회원 등급으로 검색할 수 있는 권한 여부', 5050, '2021-04-25 11:45:09', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (26, 'kmRQ1617524080387RwV', 'mnNdpze1617685077300', '회사 목록-등록일 칼럼 표시', '회사 목록중에 등록일 칼럼 표시 여부', 2000, '2021-04-06 13:57:57', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (113, 'ZCjC1617524137491OCy', 'moum1617688803133KDK', '권한 그룹 목록-상세정보-전체 수정 권한', '권한 그룹 상세정보의 모든 항목을 수정할 수 있는 권한 여부', 2300, '2021-04-06 15:00:03', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (175, 'Ig1617524166484wTSHK', 'MP1617691067909jxcWc', '파일 목록-상세정보-파일버전정보-목록-버전 설명글 표시', '파일의 상세정보중 파일버전정보의 목록에서 버전 설명글 표시 여부', 5700, '2021-04-06 15:37:47', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (271, 'wjajq1617524117533xg', 'MVQ1619319509205FVUg', '회원 목록-부모 ID 칼럼 표시', '회원 목록중에 부모 ID 칼럼 표시 여부', 5350, '2021-04-25 11:58:29', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (278, 'Ig1617524166484wTSHK', 'MYYHojt1619330115015', '파일 목록 검색-최근 수정자 ID 검색 가능', '최근 수정자 ID로 검색할 수 있는 권한 여부', 1020, '2021-04-25 14:55:15', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (32, 'kmRQ1617524080387RwV', 'N1617685200839yHRvxd', '회사 목록-상세정보-사업장주소 표시', '회사 상세정보 화면에서 사업장주소 표시 여부', 2600, '2021-04-06 14:00:00', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (43, 'kmRQ1617524080387RwV', 'n1617685645747YeYsgZ', '회사 목록-상세정보-대표자 연락처 수정 권한', '회사 상세정보중에 대표자 연락처를 수정할 수 있는 권한 여부', 3700, '2021-04-06 14:07:25', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (68, 'wjajq1617524117533xg', 'n1617686523267PPdKRC', '회원 목록-상세정보-ID 표시', '회원 상세정보 화면에서 ID 표시 여부', 6200, '2021-04-06 14:22:03', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (115, 'ZCjC1617524137491OCy', 'nAvqxz1617688830871w', '권한 그룹 목록-상세정보-권한 그룹 설명 수정 권한', '권한 그룹 상세정보중에 권한 그룹 설명을 수정할 수 있는 권한 여부', 2500, '2021-04-06 15:00:30', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (191, 'Ig1617524166484wTSHK', 'Nd1617691331094UeXXb', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-검색-상태 검색 가능', '상세정보-발급된 파일 다운로드 URL 목록에서 상태로 검색할 수 있는 권한 여부', 7300, '2021-04-06 15:42:11', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (234, 'njHLKh1617524193166T', 'nDuoTJy1617692368386', '파일 다운로드 현황-상세정보-다운로드 수 칼럼 표시', '파일 다운로드 현황의 상세정보중 다운로드 수 칼럼 표시 여부', 2100, '2021-04-06 15:59:28', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (9, 'kmRQ1617524080387RwV', 'nFIGS1617683501961lw', '회사 목록 검색-전체 검색 가능', '모든 검색 조건을 이용할 수 있는 권한 여부', 300, '2021-04-06 13:31:41', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (285, 'Ig1617524166484wTSHK', 'nliXBpe1619346980735', '파일 목록-상세정보-파일버전정보-목록-원본 파일명 표시', '파일의 상세정보중 파일버전정보의 목록에서 원본 파일명 표시 여부', 5050, '2021-04-25 19:36:20', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (37, 'kmRQ1617524080387RwV', 'nMsOr1617685307526qs', '회사 목록-상세정보-상태 표시', '회사 상세정보 화면에서 상태 표시 여부', 3100, '2021-04-06 14:01:47', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (101, 'ZCjC1617524137491OCy', 'Nr1617688597087MzSAo', '권한 그룹 목록-권한 그룹 설명 칼럼 표시', '권한 그룹 목록중에 권한 그룹 설명 칼럼 표시 여부', 1100, '2021-04-06 14:56:37', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (93, 'ZCjC1617524137491OCy', 'nRCodMq1617688455358', '권한 그룹 목록 검색-전체 검색 가능', '모든 검색 조건을 이용할 수 있는 권한 여부', 300, '2021-04-06 14:54:15', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (227, 'njHLKh1617524193166T', 'ntVBvu1617692271762L', '파일 다운로드 현황-총 다운로드 수 칼럼 표시', '파일 다운로드 현황중에 총 다운로드 수 칼럼 표시 여부', 1400, '2021-04-06 15:57:51', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (128, 'Ig1617524166484wTSHK', 'oe1617689881993ybZnR', '파일 목록 검색-최초 업로더 ID 검색 가능', '최초 업로더 ID로 검색할 수 있는 권한 여부', 1000, '2021-04-06 15:18:01', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (40, 'kmRQ1617524080387RwV', 'Ohb1617685362949Xttj', '회사 목록-상세정보-사업자번호 수정 권한', '회사 상세정보중에 사업자번호를 수정할 수 있는 권한 여부', 3400, '2021-04-06 14:02:42', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (223, 'njHLKh1617524193166T', 'OipI1617692219409LYE', '파일 다운로드 현황-파일 라벨명 칼럼 표시', '파일 다운로드 현황중에 파일 라벨명 칼럼 표시 여부', 1000, '2021-04-06 15:56:59', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (195, 'Ig1617524166484wTSHK', 'Oo1617691389632JKoWM', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-타겟 계정 ID 표시', '파일의 상세정보중 발급된 파일 다운로드 URL 목록의 상세정보중 타겟 계정 ID 표시 여부', 7700, '2021-04-06 15:43:09', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (109, 'ZCjC1617524137491OCy', 'oob1617688744580EWEM', '권한 그룹 목록-상세정보-권한 그룹 설명 표시', '권한 그룹 상세정보 화면에서 권한 그룹 설명 표시 여부', 1900, '2021-04-06 14:59:04', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (51, 'wjajq1617524117533xg', 'oPkQ1617686057472UEH', '회원 목록 검색-ID 검색 가능', 'ID로 검색할 수 있는 권한 여부', 4500, '2021-04-06 14:14:17', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (182, 'Ig1617524166484wTSHK', 'ouqsLUq1617691194741', '파일버전정보 삭제 권한', '파일버전정보를 삭제할 수 있는 권한 여부', 6400, '2021-04-06 15:39:54', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (125, 'Ig1617524166484wTSHK', 'oYCV1617689103507gcQ', '파일 목록 검색-파일 설명 검색 가능', '파일 설명으로 검색할 수 있는 권한 여부', 700, '2021-04-06 15:05:03', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (53, 'wjajq1617524117533xg', 'paNF1617686087218kvL', '회원 목록 검색-회원이름 검색 가능', '회원이름으로 검색할 수 있는 권한 여부', 4700, '2021-04-06 14:14:47', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (282, 'Ig1617524166484wTSHK', 'pCBQp1619346087141aI', '파일 목록-상세정보-파일버전정보-파일 용량 검색 가능', '상세정보-파일버전정보에서 파일 용량으로 검색할 수 있는 권한 여부', 4220, '2021-04-25 19:21:27', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (232, 'njHLKh1617524193166T', 'PccLMC1617692339558E', '파일 다운로드 현황-상세정보-파일 버전 칼럼 표시', '파일 다운로드 현황의 상세정보중 파일 버전 칼럼 표시 여부', 1900, '2021-04-06 15:58:59', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (200, 'Ig1617524166484wTSHK', 'PD1617691464911EKhTL', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-현재 다운로드 수 표시', '파일의 상세정보중 발급된 파일 다운로드 URL 목록의 상세정보중 현재 다운로드 수 표시 여부', 8200, '2021-04-06 15:44:24', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (264, 'wjajq1617524117533xg', 'pgNfcjy1619317925868', '회원 목록 검색-부모 회원 ID 검색 가능', '부모 회원 ID로 검색할 수 있는 권한 여부', 4450, '2021-04-25 11:32:05', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (42, 'kmRQ1617524080387RwV', 'pi1617685629576AENpM', '회사 목록-상세정보-대표자명 수정 권한', '회사 상세정보중에 대표자명을 수정할 수 있는 권한 여부', 3600, '2021-04-06 14:07:09', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (44, 'kmRQ1617524080387RwV', 'picDYTK1617685662336', '회사 목록-상세정보-회사 전화번호 수정 권한', '회사 상세정보중에 회사 전화번호를 수정할 수 있는 권한 여부', 3800, '2021-04-06 14:07:42', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (186, 'Ig1617524166484wTSHK', 'PkWkVjK1617691256386', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-검색-파일 다운로드 URL 검색 가능', '상세정보-발급된 파일 다운로드 URL 목록에서 파일 다운로드 URL으로 검색할 수 있는 권한 여부', 6800, '2021-04-06 15:40:56', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (95, 'ZCjC1617524137491OCy', 'Q1617688491869kwnWcG', '권한 그룹 목록 검색-권한 설명 검색 가능', '권한 설명으로 검색할 수 있는 권한 여부', 500, '2021-04-06 14:54:51', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (108, 'ZCjC1617524137491OCy', 'Q1617688727798FVVxOF', '권한 그룹 목록-상세정보-권한 그룹명 표시', '권한 그룹 상세정보 화면에서 권한 그룹명 표시 여부', 1800, '2021-04-06 14:58:47', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (187, 'Ig1617524166484wTSHK', 'q1617691273028DpJblt', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-검색-다운로드 제한 횟수 검색 가능', '상세정보-발급된 파일 다운로드 URL 목록에서 다운로드 제한 횟수로 검색할 수 있는 권한 여부', 6900, '2021-04-06 15:41:13', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (263, 'kmRQ1617524080387RwV', 'QC1619312971337AqYpN', '회사 목록 검색-회사 수정시 IP 검색 가능', '회사를 최근 수정했을 당시 IP로 검색할 수 있는 권한 여부', 1030, '2021-04-25 10:09:31', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (50, 'wjajq1617524117533xg', 'qDLUgK1617686039888I', '회원 목록 검색-전체 검색 가능', '모든 검색 조건을 이용할 수 있는 권한 여부', 4400, '2021-04-06 14:13:59', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (203, 'Ig1617524166484wTSHK', 'qGjUEP1617691508838f', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-메일 삽입용 HTML 표시', '파일의 상세정보중 발급된 파일 다운로드 URL 목록의 상세정보중 메일 삽입용 HTML 표시 여부', 8500, '2021-04-06 15:45:08', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (279, 'Ig1617524166484wTSHK', 'qH1619330132562vCXBm', '파일 목록 검색-최근 수정자의 이름 검색 가능', '최근 수정자의 이름으로 검색할 수 있는 권한 여부', 1030, '2021-04-25 14:55:32', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (121, 'Ig1617524166484wTSHK', 'qITqpA1617689044321f', '파일 목록 검색-전체 검색 가능', '모든 검색 조건을 이용할 수 있는 권한 여부', 300, '2021-04-06 15:04:04', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (33, 'kmRQ1617524080387RwV', 'qlkD1617685215270Sfy', '회사 목록-상세정보-대표자명 표시', '회사 상세정보 화면에서 대표자명 표시 여부', 2700, '2021-04-06 14:00:15', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (267, 'wjajq1617524117533xg', 'qlo1619318587737xclU', '회원 목록 검색-권한 그룹명 검색 가능', '권한 그룹명으로 검색할 수 있는 권한 여부', 4420, '2021-04-25 11:43:07', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (84, 'wjajq1617524117533xg', 'qMz1617688160685WVie', '회원 목록-상세정보-회사 수정 권한', '회원 상세정보중에 회사를 수정할 수 있는 권한 여부', 7200, '2021-04-06 14:49:20', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (119, 'Ig1617524166484wTSHK', 'qVZe1617688959308fKJ', '파일 목록 메뉴 표시', '관리자 진입시, 좌측 메뉴영역에 파일 관리 메뉴 표시 여부', 100, '2021-04-06 15:02:39', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (197, 'Ig1617524166484wTSHK', 'QyRNVuf1617691418624', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-URL 접근 횟수 표시', '파일의 상세정보중 발급된 파일 다운로드 URL 목록의 상세정보중 URL 접근 횟수 표시 여부', 7900, '2021-04-06 15:43:38', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (160, 'Ig1617524166484wTSHK', 'qzkk1617690807211vrJ', '파일 목록-상세정보-파일버전정보-검색-다운로드될 파일명 검색 가능', '상세정보-파일버전정보에서 다운로드될 파일명으로 검색할 수 있는 권한 여부', 4200, '2021-04-06 15:33:27', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (56, 'wjajq1617524117533xg', 'RDdKRIu1617686130583', '회원 목록 검색-가입 IP 검색 가능', '회원 가입 IP로 검색할 수 있는 권한 여부', 5000, '2021-04-06 14:15:30', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (111, 'ZCjC1617524137491OCy', 'RE1617688773994KnYXd', '권한 그룹 목록-상세정보-상태 표시', '권한 그룹 상세정보 화면에서 상태 표시 여부', 2100, '2021-04-06 14:59:33', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (281, 'Ig1617524166484wTSHK', 'rfDQnbW1619345963519', '파일 목록-상세정보-파일버전정보-검색-원본 파일명 검색 가능', '상세정보-파일버전정보에서 원본 파일명으로 검색할 수 있는 권한 여부', 4170, '2021-04-25 19:19:23', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (270, 'wjajq1617524117533xg', 'RGAnz1619319005583xP', '회원 목록 검색-최근 수정일 기간 검색 가능', '회원 최근 수정일 기간으로 검색할 수 있는 권한 여부', 4950, '2021-04-25 11:50:05', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (179, 'Ig1617524166484wTSHK', 'RZCF1617691153958FRX', '파일 목록-상세정보-파일버전정보-상세정보-메모 수정 가능', '파일의 상세정보중 파일버전정보의 상세정보중 메모 수정 가능 여부', 6100, '2021-04-06 15:39:13', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (19, 'kmRQ1617524080387RwV', 'S1617684955017JFIumn', '회사 목록-No 칼럼 표시', '회사 목록중에 No 칼럼 표시 여부', 1300, '2021-04-06 13:55:55', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (286, 'Ig1617524166484wTSHK', 'SeRnu1619347424736oW', '파일 목록-상세정보-파일버전정보-목록-버전코드 표시', '파일의 상세정보중 파일버전정보의 목록에서 버전코드 표시 여부', 5020, '2021-04-25 19:43:44', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (250, 'Ig1617524166484wTSHK', 'Setv1619159012587hpx', '파일 목록-상세정보-파일기본정보-파일설명 수정', '파일 기본정보중에 파일설명을 수정할 수 있는 권한 여부', 3704, '2021-04-23 15:23:32', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (172, 'Ig1617524166484wTSHK', 'SH1617690990667ryQkC', '파일 목록-상세정보-파일버전정보-목록-최근 수정자 ID 표시', '파일의 상세정보중 파일버전정보의 목록에서 최근 수정자 ID 표시 여부', 5400, '2021-04-06 15:36:30', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (61, 'wjajq1617524117533xg', 'shlE1617686355662Tpk', '회원 목록-회원명 칼럼 표시', '회원 목록중에 회원명 칼럼 표시 여부', 5500, '2021-04-06 14:19:15', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (244, 'wjajq1617524117533xg', 'siGZT1619141385876kF', '회원 목록-상세정보-등급 수정 권한', '회원 상세정보중에 등급을 수정할수 있는 여부', 7150, '2021-04-23 10:29:45', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (258, 'Ig1617524166484wTSHK', 'SioYPe1619178659344f', '파일 목록-상세정보-파일버전정보-상세정보-전체 수정 가능', '파일의 상세정보중 파일버전정보의 상세정보를 모두 수정할 수 있는지 여부', 5850, '2021-04-23 20:50:59', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (213, 'Ig1617524166484wTSHK', 'sK1617691790694qGZyx', '파일 목록-상세정보-파일기본정보 전체표시', '파일의 상세정보중 파일기본정보의 모든 항목을 볼 수 있는 권한 여부', 2890, '2021-04-06 15:49:50', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (77, 'kmRQ1617524080387RwV', 'ssO1617687189173zGlK', '회사 목록-메모 칼럼 표시', '회사 목록중에 메모 칼럼 표시 여부', 2010, '2021-04-06 14:33:09', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (292, 'Ig1617524166484wTSHK', 'sSqwa1626509636330ck', '파일 목록 - 파일 삭제 권한', '파일을 삭제할 수 있는 권한 여부', 2550, '2021-07-17 17:13:56', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (158, 'Ig1617524166484wTSHK', 'SuiUUr1617690772167d', '파일 목록-상세정보-파일버전정보-검색-전체 검색 가능', '상세정보-파일버전정보에서 모든 검색 조건을 이용할 수 있는 권한 여부', 4000, '2021-04-06 15:32:52', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (107, 'ZCjC1617524137491OCy', 'SvFu1617688700467PvF', '권한 그룹 목록-상세정보-전체 표시', '권한 그룹의 모든 상세정보 항목을 볼 수 있는 권한 여부', 1700, '2021-04-06 14:58:20', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (96, 'ZCjC1617524137491OCy', 'sweDXI1617688516134u', '권한 그룹 목록 검색-그룹에 등록된 권한명 검색 가능', '그룹에 등록된 권한명으로 검색할 수 있는 권한 여부', 600, '2021-04-06 14:55:16', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (49, 'wjajq1617524117533xg', 'SYlFsd1617685933675q', '회원 목록 검색 영역 표시', '회원 관리 메뉴 진입시, 상단에 검색 기능 표시 여부', 4300, '2021-04-06 14:12:13', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (55, 'wjajq1617524117533xg', 't1617686115937OSsoBL', '회원 목록 검색-가입일 기간 검색 가능', '회원 가입일 기간으로 검색할 수 있는 권한 여부', 4900, '2021-04-06 14:15:15', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (147, 'Ig1617524166484wTSHK', 'tBN1617690575007jNty', '파일 목록-상세정보-파일기본정보-파일 접근키 표시', '파일 상세정보-파일기본정보에서 파일 접근키 표시 여부', 2900, '2021-04-06 15:29:35', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (127, 'Ig1617524166484wTSHK', 'TiBv1617689137789per', '파일 목록 검색-최신 버전 업로드 날짜 검색 가능', '최신 버전 업로드 날짜로 검색할 수 있는 권한 여부', 900, '2021-04-06 15:05:37', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (2, 'khPJl1617523858875yO', 'TkF1617682723752uKlJ', '총 파일 다운로드된 횟수 표시', '대시보드 메뉴 진입 후, 총 파일 다운로드된 횟수 데이터 표시 여부', 200, '2021-04-06 13:18:43', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (72, 'wjajq1617524117533xg', 'TKzOjpi1617686585400', '회원 목록-상세정보-가입일 표시', '회원 상세정보 화면에서 가입일 표시 여부', 6600, '2021-04-06 14:23:05', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (52, 'wjajq1617524117533xg', 'ttQCZki1617686071782', '회원 목록 검색-회사명 검색 가능', '회사명으로 검색할 수 있는 권한 여부', 4600, '2021-04-06 14:14:31', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (102, 'ZCjC1617524137491OCy', 'Tz1617688611713wZfKg', '권한 그룹 목록-생성일 칼럼 표시', '권한 그룹 목록중에 생성일 칼럼 표시 여부', 1200, '2021-04-06 14:56:51', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (7, 'kmRQ1617524080387RwV', 'U1617683411475etYgFO', '회사 관리 메뉴 표시', '관리자 진입시, 좌측 메뉴영역에 회사 관리 메뉴 표시 여부', 100, '2021-04-06 13:30:11', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (166, 'Ig1617524166484wTSHK', 'u1617690905605MYBYVC', '새로운 파일버전정보 등록 권한', '파일의 새로운 파일버전정보를 등록할 수 있는 권한 여부', 4800, '2021-04-06 15:35:05', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (229, 'njHLKh1617524193166T', 'U1617692298881NZwJdj', '파일 다운로드 현황-상세정보-전체표시', '파일 다운로드 현황의 상세정보중 모든 항목을 볼 수 있는 권한 여부', 1600, '2021-04-06 15:58:18', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (266, 'wjajq1617524117533xg', 'U1619318276267fJrivz', '회원 목록 검색-회사 대표자명 검색 가능', '회사 대표자명으로 검색할 수 있는 권한 여부', 4650, '2021-04-25 11:37:56', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (170, 'Ig1617524166484wTSHK', 'uo1617690962543egYFj', '파일 목록-상세정보-파일버전정보-목록-업로더 ID 표시', '파일의 상세정보중 파일버전정보의 목록에서 업로더 ID 표시 여부', 5200, '2021-04-06 15:36:02', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (178, 'Ig1617524166484wTSHK', 'UrSprt1617691140153j', '파일 목록-상세정보-파일버전정보-상세정보-파일명 수정 가능', '파일의 상세정보중 파일버전정보의 상세정보중 파일명 수정 가능 여부', 6000, '2021-04-06 15:39:00', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (24, 'kmRQ1617524080387RwV', 'Ut1617685039971wJiPQ', '회사 목록-대표자 연락처 칼럼 표시', '회사 목록중에 대표자 연락처 칼럼 표시 여부', 1800, '2021-04-06 13:57:19', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (165, 'Ig1617524166484wTSHK', 'UxHDHF1617690885521n', '파일 목록-상세정보-파일버전정보-상세정보 접근 가능', '상세정보-파일버전정보의 상세정보에 접근할 수 있는 권한 여부', 4700, '2021-04-06 15:34:45', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (246, 'kmRQ1617524080387RwV', 'UY1619153982779QIVRq', '회사 생성 권한', '회사를 생성 할 수 있는 권한 여부', 150, '2021-04-23 13:59:42', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (27, 'kmRQ1617524080387RwV', 'uZdxER1617685091349q', '회사 목록-상태 칼럼 표시', '회사 목록중에 상태 칼럼 표시 여부', 2100, '2021-04-06 13:58:11', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (135, 'Ig1617524166484wTSHK', 'VgH1617689990860NtIb', '파일 목록-파일 메모 칼럼 표시', '파일 목록중에 파일 메모 칼럼 표시 여부', 1700, '2021-04-06 15:19:50', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (3, 'khPJl1617523858875yO', 'VHI1617682787237PDYt', '총 업로드된 파일 갯수 표시', '대시보드 메뉴 진입 후, 총 업로드된 파일 갯수 데이터 표시 여부', 300, '2021-04-06 13:19:47', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (15, 'kmRQ1617524080387RwV', 'VJ1617683688584sCaqN', '회사 목록 검색-회사 전화번호 검색 가능', '회사 전화번호로 검색할 수 있는 권한 여부', 900, '2021-04-06 13:34:48', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (289, 'Ig1617524166484wTSHK', 'VJLb1619349481831LuX', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-검색-다운로드 된 수 검색 가능', '상세정보-발급된 파일 다운로드 URL 목록에서 다운로드 된 수로 검색할 수 있는 권한 여부', 7050, '2021-04-25 20:18:01', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (67, 'wjajq1617524117533xg', 'VJljX1617686507261iy', '회원 목록-상세정보-전체 표시', '회원의 모든 상세정보 항목을 볼 수 있는 권한 여부', 6100, '2021-04-06 14:21:47', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (28, 'kmRQ1617524080387RwV', 'vk1617685109763LDPNY', '회사 목록-상세정보 접근권한', '회사 상세정보 접근 권한 여부', 2200, '2021-04-06 13:58:29', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (256, 'Ig1617524166484wTSHK', 'VlEX1619174971861yVJ', '파일 목록-상세정보-파일다운로드URL-전체수정', '파일의 상세정보중 파일다운로드URL 정보를 모두 수정할 수 있는 권한 여부', 8690, '2021-04-23 19:49:31', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (211, 'Ig1617524166484wTSHK', 'Vm1617691627356GZtNd', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-상세정보-다운로드(접근) 제한 수정 가능', '파일의 상세정보중 발급된 파일 다운로드 URL 목록의 상세정보중 다운로드(접근) 제한 수정 가능 여부', 9300, '2021-04-06 15:47:07', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (116, 'ZCjC1617524137491OCy', 'VoCkGI1617688843559f', '권한 그룹 목록-상세정보-상태 수정 권한', '권한 그룹 상세정보중에 상태를 수정할 수 있는 권한 여부', 2600, '2021-04-06 15:00:43', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (205, 'Ig1617524166484wTSHK', 'vqINGKr1617691537278', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-상세정보-타겟계정 수정 가능', '파일의 상세정보중 발급된 파일 다운로드 URL 목록의 상세정보중 타겟계정 수정 가능 여부', 8700, '2021-04-06 15:45:37', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (231, 'njHLKh1617524193166T', 'vTC1617692325120hpKy', '파일 다운로드 현황-상세정보-파일 라벨명 칼럼 표시', '파일 다운로드 현황의 상세정보중 파일 라벨명 칼럼 표시 여부', 1800, '2021-04-06 15:58:45', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (169, 'Ig1617524166484wTSHK', 'vUQXMVa1617690946162', '파일 목록-상세정보-파일버전정보-목록-다운로드 될 파일명 표시', '파일의 상세정보중 파일버전정보의 목록에서 다운로드 될 파일명 표시 여부', 5100, '2021-04-06 15:35:46', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (192, 'Ig1617524166484wTSHK', 'VvFc1617691345521eAM', '새로운 발급된 파일 다운로드 URL 목록 생성 권한', '새로운 발급된 파일 다운로드 URL 목록을 생성할 수 있는 권한 여부', 7400, '2021-04-06 15:42:25', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (46, 'kmRQ1617524080387RwV', 'wbi1617685695068SGzA', '회사 목록-상세정보-상태 수정 권한', '회사 상세정보중에 상태를 수정할 수 있는 권한 여부', 4000, '2021-04-06 14:08:15', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (143, 'Ig1617524166484wTSHK', 'wCdVLb1617690115292m', '파일 목록-상태 칼럼 표시', '파일 목록중에 상태 칼럼 표시 여부', 2500, '2021-04-06 15:21:55', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (142, 'Ig1617524166484wTSHK', 'wEZC1617690101921eeh', '파일 목록-등록된 다운로드 URL 갯수 칼럼 표시', '파일 목록중에 등록된 다운로드 URL 갯수 칼럼 표시 여부', 2400, '2021-04-06 15:21:41', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (123, 'Ig1617524166484wTSHK', 'wKpRpc1617689073426p', '파일 목록 검색-파일명 검색 가능', '파일명으로 검색할 수 있는 권한 여부', 500, '2021-04-06 15:04:33', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (194, 'Ig1617524166484wTSHK', 'wN1617691374902fVQZj', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-파일 다운로드 URL 표시', '파일의 상세정보중 발급된 파일 다운로드 URL 목록의 상세정보중 파일 다운로드 URL 표시 여부', 7600, '2021-04-06 15:42:54', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (216, 'njHLKh1617524193166T', 'wrBN1617692120470ysR', '파일 다운로드 현황 검색-전체 검색 가능', '모든 검색 조건을 이용할 수 있는 권한 여부', 300, '2021-04-06 15:55:20', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (17, 'kmRQ1617524080387RwV', 'wReS1617684910526lEK', '회사 목록 검색-상태 검색 가능', '회사 상태로 검색할 수 있는 권한 여부', 1100, '2021-04-06 13:55:10', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (144, 'Ig1617524166484wTSHK', 'wSSQFD1617690129416s', '새 파일 등록 권한', '새로운 파일을 등록할 수 있는 권한 여부', 2600, '2021-04-06 15:22:09', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (131, 'Ig1617524166484wTSHK', 'Wud1617689932201GWoW', '파일 목록 검색-상태 검색 가능', '상태로 검색할 수 있는 권한 여부', 1300, '2021-04-06 15:18:52', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (141, 'Ig1617524166484wTSHK', 'WW1617690088280AWXXu', '파일 목록-최신버전 업로더 ID 칼럼 표시', '파일 목록중에 최신버전 업로더 칼럼 표시 여부', 2300, '2021-04-06 15:21:28', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (10, 'kmRQ1617524080387RwV', 'wychQA1617683535981H', '회사 목록 검색-회사명 검색 가능', '회사명으로 검색할 수 있는 권한 여부', 400, '2021-04-06 13:32:15', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (290, 'Ig1617524166484wTSHK', 'x1619829793213YmZdtK', '파일 목록-상세정보-파일버전정보-상세정보-접근가능', '파일의 상세정보중 파일버전정보의 상세정보에 접근할 수 있는 권한 여부', 5830, '2021-05-01 09:43:13', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (188, 'Ig1617524166484wTSHK', 'xD1617691288301xOsvB', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-검색-다운로드 제한 기간 검색 가능', '상세정보-발급된 파일 다운로드 URL 목록에서 다운로드 제한 기간으로 검색할 수 있는 권한 여부', 7000, '2021-04-06 15:41:28', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (94, 'ZCjC1617524137491OCy', 'XI1617688471009RRpOo', '권한 그룹 목록 검색-권한 그룹명 검색 가능', '권한 그룹명으로 검색할 수 있는 권한 여부', 400, '2021-04-06 14:54:31', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (126, 'Ig1617524166484wTSHK', 'XkW1617689123553Zvzr', '파일 목록 검색-최초 업로드 날짜 검색 가능', '최초 업로드 날짜로 검색할 수 있는 권한 여부', 800, '2021-04-06 15:05:23', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (36, 'kmRQ1617524080387RwV', 'XlFZ1617685290356QZT', '회사 목록-상세정보-등록일 표시', '회사 상세정보 화면에서 등록일 표시 여부', 3000, '2021-04-06 14:01:30', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (245, 'wjajq1617524117533xg', 'XNcrRT1619142279885F', '회원 목록-상세정보-비밀번호 수정 권한', '회원 상세정보중에 비밀번호를 수정할수 있는 여부', 7120, '2021-04-23 10:44:39', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (259, 'Ig1617524166484wTSHK', 'XPebmV1619179187706G', '파일 목록-상세정보-파일버전정보 목록 조회', '파일의 상세정보중 파일버전정보 목록을 조회할 수 있는 권한', 3750, '2021-04-23 20:59:47', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (132, 'Ig1617524166484wTSHK', 'XQSP1617689945699vvv', '파일 목록 표시', '파일 목록을 확인할 수 있는 권한 여부', 1400, '2021-04-06 15:19:05', '::ffff:172.17.0.1', '2021-04-07 10:52:39', '::ffff:172.17.0.1', 'N'),
        (161, 'Ig1617524166484wTSHK', 'XrnEgI1617690822540n', '파일 목록-상세정보-파일버전정보-검색-업로드 날짜 검색 가능', '상세정보-파일버전정보에서 업로드 날짜로 검색할 수 있는 권한 여부', 4300, '2021-04-06 15:33:42', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (75, 'wjajq1617524117533xg', 'xuWPm1617686635430eI', '회원 목록-상세정보-상태 표시', '회원 상세정보 화면에서 상태 표시 여부', 6900, '2021-04-06 14:23:55', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (174, 'Ig1617524166484wTSHK', 'Xvl1617691054676BLbo', '파일 목록-상세정보-파일버전정보-목록-메모 표시', '파일의 상세정보중 파일버전정보의 목록에서 메모 표시 여부', 5600, '2021-04-06 15:37:34', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (151, 'Ig1617524166484wTSHK', 'xW1617690640823UIksf', '파일 목록-상세정보-파일기본정보-외부에 파일 버전의 변경 이력 노출 여부 표시', '파일 상세정보-파일기본정보에서 외부에 파일 버전의 변경 이력 노출 여부 표시 여부', 3300, '2021-04-06 15:30:40', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (221, 'njHLKh1617524193166T', 'XWfLnyk1617692193442', '파일 다운로드 현황-회원 ID 칼럼 표시', '파일 다운로드 현황중에 회원 ID 칼럼 표시 여부', 800, '2021-04-06 15:56:33', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (252, 'Ig1617524166484wTSHK', 'Xx1619159049782JpLKV', '파일 목록-상세정보-파일기본정보-외부에 파일 설명글 노출 여부 수정', '파일 기본정보중에 외부에 파일 설명글 노출 여부를 수정할 수 있는 권한 여부', 3706, '2021-04-23 15:24:09', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (230, 'njHLKh1617524193166T', 'XZfiA1617692311435UD', '파일 다운로드 현황-상세정보-날짜 칼럼 표시', '파일 다운로드 현황의 상세정보중 날짜 칼럼 표시 여부', 1700, '2021-04-06 15:58:31', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (6, 'khPJl1617523858875yO', 'Y1617682922450jLJDvQ', '파일 다운로드 횟수 현황 표시', '대시보드 메뉴 진입 후, 파일 다운로드 횟수 현황 데이터 표시 여부', 600, '2021-04-06 13:22:02', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (73, 'wjajq1617524117533xg', 'y1617686600599RqoSsU', '회원 목록-상세정보-가입시 IP 주소 표시', '회원 상세정보 화면에서 가입시 IP 주소 표시 여부', 6700, '2021-04-06 14:23:20', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (117, 'ZCjC1617524137491OCy', 'YBmA1617688856994Ktx', '권한 그룹 목록-상세정보-허용된 권한 수정 권한', '권한 그룹 상세정보중에 허용된 권한을 수정할 수 있는 권한 여부', 2700, '2021-04-06 15:00:56', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (153, 'Ig1617524166484wTSHK', 'YFdfL1617690692640pH', '파일 목록-상세정보-파일기본정보-파일 관련 스크린샷 표시', '파일 상세정보-파일기본정보에서 파일 관련 스크린샷 표시 여부', 3500, '2021-04-06 15:31:32', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (148, 'Ig1617524166484wTSHK', 'YJKyLU1617690591021h', '파일 목록-상세정보-파일기본정보-파일 라벨명 표시', '파일 상세정보-파일기본정보에서 파일 라벨명 표시 여부', 3000, '2021-04-06 15:29:51', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (105, 'ZCjC1617524137491OCy', 'yQWpkir1617688667026', '새 권한 그룹 등록 권한', '새로운 권한 그룹을 등록할 수 있는 권한 여부', 1500, '2021-04-06 14:57:47', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (62, 'wjajq1617524117533xg', 'yrHqMW1617686370456X', '회원 목록-휴대폰 번호 칼럼 표시', '회원 목록중에 휴대폰 번호 칼럼 표시 여부', 5600, '2021-04-06 14:19:30', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (228, 'njHLKh1617524193166T', 'yVYGjn1617692285630m', '파일 다운로드 현황-상세정보 접근권한', '파일 다운로드 현황 상세정보 접근 권한 여부', 1500, '2021-04-06 15:58:05', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (70, 'wjajq1617524117533xg', 'z1617686553681DpVFFD', '회원 목록-상세정보-이름 표시', '회원 상세정보 화면에서 이름 표시 여부', 6400, '2021-04-06 14:22:33', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (81, 'wjajq1617524117533xg', 'z1617688064130EDPbWc', '회원 목록-상세정보-메모 표시', '회원 상세정보 화면에서 메모 표시 여부', 6510, '2021-04-06 14:47:44', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (137, 'Ig1617524166484wTSHK', 'zaYaP1617690026127Te', '파일 목록-최신버전 파일명 칼럼 표시', '파일 목록중에 최신버전 파일명 칼럼 표시 여부', 1900, '2021-04-06 15:20:26', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (184, 'Ig1617524166484wTSHK', 'zEHbsq1617691224808H', '파일 목록-상세정보-발급된 파일 다운로드 URL 목록-검색 영역 표시', '파일 상세정보-발급된 파일 다운로드 URL 목록에서 상단에 검색 기능 표시 여부', 6600, '2021-04-06 15:40:24', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (5, 'khPJl1617523858875yO', 'ZnSKbN1617682902715D', '총 파일 다운로드 시도 횟수 표시', '대시보드 메뉴 진입 후, 총 파일 다운로드 시도 횟수 데이터 표시 여부', 500, '2021-04-06 13:21:42', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (215, 'njHLKh1617524193166T', 'ZP1617692105079arRSf', '파일 다운로드 현황 검색 영역 표시', '파일 다운로드 현황 메뉴 진입시, 상단에 검색 기능 표시 여부', 200, '2021-04-06 15:55:05', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (85, 'wjajq1617524117533xg', 'zqYNi1617688178303Jj', '회원 목록-상세정보-이름 수정 권한', '회원 상세정보중에 이름을 수정할 수 있는 권한 여부', 7300, '2021-04-06 14:49:38', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (66, 'wjajq1617524117533xg', 'ZVbPFm1617686493277o', '회원 목록-상세정보 접근권한', '회원 상세정보 접근 권한 여부', 6000, '2021-04-06 14:21:33', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (280, 'Ig1617524166484wTSHK', 'Zvpy1619345897043isH', '파일 목록-상세정보-파일버전정보-검색-버전코드 검색 가능', '상세정보-파일버전정보에서 버전코드로 검색할 수 있는 권한 여부', 4150, '2021-04-25 19:18:17', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (217, 'njHLKh1617524193166T', 'ZWIX1617692133689zNx', '파일 다운로드 현황 검색-회원 ID 검색 가능', '회원 ID로 검색할 수 있는 권한 여부', 400, '2021-04-06 15:55:33', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (82, 'wjajq1617524117533xg', 'ZXdQT1617688117620Kp', '회원 목록-상세정보-전체 수정 권한', '회원 상세정보의 모든 항목을 수정할 수 있는 권한 여부', 7000, '2021-04-06 14:48:37', '::ffff:172.17.0.1', NULL, NULL, 'N'),
        (39, 'kmRQ1617524080387RwV', 'zXw1617685347777EzGZ', '회사 목록-상세정보-회사명 수정 권한', '회사 상세정보중에 회사명을 수정할 수 있는 권한 여부', 3300, '2021-04-06 14:02:27', '::ffff:172.17.0.1', NULL, NULL, 'N');
      `, { 
        type: QueryTypes.INSERT 
      }
    );



    // FmsUsers
    await sequelize.query(`
        INSERT INTO \`FmsUsers\` (\`seq\`, \`parentUserKey\`, \`userKey\`, \`companyKey\`, \`permissionGroupKey\`, \`userLevel\`, \`userId\`, \`userPassword\`, \`userName\`, \`userPhone\`, \`userMemo\`, \`createdAt\`, \`createdIp\`, \`updatedAt\`, \`updatedIp\`, \`userStatus\`, \`isDeletedRow\`) VALUES
        (1, NULL, 'C1618033738099vtEiUg', 'ovau1623568601311tXN', 'T1617773784543MKLRZn', 'USLEV00000001', 'test123', '99f88c13a6d18695db09c2ce0774f4ae088eb4ae6a730f57fa8289ec81d4ed0cea3c853b990932aa611d3dddf0770d0cdd713c453b47c3879f8af5249201a623', '홍길동', '010-1234-1234', 'zzzz', '2021-06-27 13:25:11', '::ffff:172.17.0.1', NULL, '::ffff:172.17.0.1', 'USRST00000001', 'N');
      `, { 
        type: QueryTypes.INSERT 
      }
    );



    // FmsPermissionGroupUploads
    await sequelize.query(`
        INSERT INTO \`FmsPermissionGroupUploads\` (\`seq\`, \`permissionGroupUploadKey\`, \`permissionGroupKey\`, \`permissionKey\`, \`createdAt\`, \`createdIp\`, \`updatedAt\`, \`updatedIp\`, \`isActive\`, \`isDeletedRow\`) VALUES
        (1, 'ACFvr1619254450510sk', 'T1617773784543MKLRZn', 'TkF1617682723752uKlJ', '2021-04-24 17:54:10', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (2, 'AFX1619347867655dvUZ', 'T1617773784543MKLRZn', 'JB1617690933433tLluC', '2021-04-25 19:51:07', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (232, 'AhqNTK1624768123241S', 'T1617773784543MKLRZn', 'ZP1617692105079arRSf', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (214, 'AIgQQmC1624768123160', 'T1617773784543MKLRZn', 'VlEX1619174971861yVJ', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (279, 'Akg1624768123337NTje', 'T1617773784543MKLRZn', 'IuJ1617688567172AqFn', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (3, 'amI1624163184538xSzJ', 'T1617773784543MKLRZn', 'CZQmk1617691008392OB', '2021-06-20 13:26:24', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (4, 'amPwktq1621995645925', 'T1617773784543MKLRZn', 'N1617685200839yHRvxd', '2021-05-26 11:20:45', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (5, 'AOsGWa1619252680270P', 'T1617773784543MKLRZn', 'YBmA1617688856994Ktx', '2021-04-24 17:24:40', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (248, 'avgurK1624768123262Z', 'T1617773784543MKLRZn', 'PccLMC1617692339558E', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (6, 'awQNSPO1621995692472', 'T1617773784543MKLRZn', 'nMsOr1617685307526qs', '2021-05-26 11:21:32', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (197, 'b1624768123096YASnEF', 'T1617773784543MKLRZn', 'iSlJMH1617690853579K', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (201, 'b1624768123121MGIrAq', 'T1617773784543MKLRZn', 'BsB1617691124123HVpg', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (7, 'baaE1624004230169fvP', 'T1617773784543MKLRZn', 'VgH1617689990860NtIb', '2021-06-18 17:17:10', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (8, 'bemUlc1619835434477E', 'T1617773784543MKLRZn', 'LuKd1619833701072JIk', '2021-05-01 11:17:14', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (170, 'BeRP1624768122986Vce', 'T1617773784543MKLRZn', 'wKpRpc1617689073426p', '2021-06-27 13:28:42', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (203, 'Bh1624768123131tOsAZ', 'T1617773784543MKLRZn', 'zEHbsq1617691224808H', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (9, 'bHTy1619854113813yNr', 'T1617773784543MKLRZn', 'u1617690905605MYBYVC', '2021-05-01 16:28:33', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (251, 'BHUZVmW1624768123265', 'T1617773784543MKLRZn', 'e1617692383447Gjzzxi', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (253, 'bIOh1624768123270Kok', 'T1617773784543MKLRZn', 'qDLUgK1617686039888I', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (10, 'BLatqG1624628775357y', 'T1617773784543MKLRZn', 'DfCM1617691613278YYD', '2021-06-25 22:46:15', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (167, 'BnEwiVu1624768122978', 'T1617773784543MKLRZn', 'isphYm1617689015822t', '2021-06-27 13:28:42', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (11, 'BQJKse1624251262732Q', 'T1617773784543MKLRZn', 'qGjUEP1617691508838f', '2021-06-21 13:54:22', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (12, 'BuCicd1624251255034K', 'T1617773784543MKLRZn', 'bezBsTe1617691493886', '2021-06-21 13:54:15', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (13, 'c1623476723150wcvleS', 'T1617773784543MKLRZn', 'pi1617685629576AENpM', '2021-06-12 14:45:23', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (14, 'C1623498028615LATdal', 'T1617773784543MKLRZn', 'yrHqMW1617686370456X', '2021-06-12 20:40:28', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (15, 'c1623563757905lMsuhv', 'T1617773784543MKLRZn', 'z1617686553681DpVFFD', '2021-06-13 14:55:57', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (176, 'C1624768123001zlFPMc', 'T1617773784543MKLRZn', 'oe1617689881993ybZnR', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (238, 'CcPIT1624768123249gp', 'T1617773784543MKLRZn', 'BLhIHQl1617692205962', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (16, 'ch1621398631965OrgSC', 'T1617773784543MKLRZn', 'qVZe1617688959308fKJ', '2021-05-19 13:30:31', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (17, 'ckwDNEJ1623563817443', 'T1617773784543MKLRZn', 'xuWPm1617686635430eI', '2021-06-13 14:56:57', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (18, 'CsPQz1621995667890Hk', 'T1617773784543MKLRZn', 'Mi1617685275873ocgKZ', '2021-05-26 11:21:07', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (221, 'cszhn1624768123192NP', 'T1617773784543MKLRZn', 'jw1617683662584Mxqxo', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (198, 'cttY1624768123098qza', 'T1617773784543MKLRZn', 'c1617690872222vwsBwH', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (19, 'cyrvjH1623498009537y', 'T1617773784543MKLRZn', 'FXPCTN1619320182255r', '2021-06-12 20:40:09', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (20, 'd1623717755607MtcqYk', 'T1617773784543MKLRZn', 'M1617688625942lyFAFR', '2021-06-15 09:42:35', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (205, 'd1624768123133zyusQl', 'T1617773784543MKLRZn', 'PkWkVjK1617691256386', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (183, 'DAv1624768123017TNdN', 'T1617773784543MKLRZn', 'ItzQ1619329144821EAy', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (21, 'deON1619857649921fPD', 'T1617773784543MKLRZn', 'zXw1617685347777EzGZ', '2021-05-01 17:27:29', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (22, 'DHKx1623999608538uPX', 'T1617773784543MKLRZn', 'm1617692177732ZCXxbX', '2021-06-18 16:00:08', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (272, 'DLrJIj1624768123327E', 'T1617773784543MKLRZn', 'gQdEs1617688259139el', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (23, 'dm1624004264823lIMte', 'T1617773784543MKLRZn', 'wCdVLb1617690115292m', '2021-06-18 17:17:44', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (24, 'dOXGjQD1623999592937', 'T1617773784543MKLRZn', 'VoCkGI1617688843559f', '2021-06-18 15:59:52', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (191, 'Dp1624768123087xSVVH', 'T1617773784543MKLRZn', 'qzkk1617690807211vrJ', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (25, 'DPMFywl1619832642984', 'T1617773784543MKLRZn', 'x1619829793213YmZdtK', '2021-05-01 10:30:42', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (26, 'dQKL1624074166999yVj', 'T1617773784543MKLRZn', 'aefcC1617690712451ls', '2021-06-19 12:42:46', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (225, 'Dqm1624768123196WFWZ', 'T1617773784543MKLRZn', 'DUrVJAA1619312521414', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (252, 'DqVimCc1624768123268', 'T1617773784543MKLRZn', 'SYlFsd1617685933675q', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (236, 'dxMcH1624768123245oN', 'T1617773784543MKLRZn', 'dm1617692163075KPdEO', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (27, 'e1623498024940rcLuca', 'T1617773784543MKLRZn', 'shlE1617686355662Tpk', '2021-06-12 20:40:24', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (263, 'eBNel1624768123281XI', 'T1617773784543MKLRZn', 't1617686115937OSsoBL', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (282, 'eG1624768123352XACzL', 'T1617773784543MKLRZn', 'ismBZfa1617688788569', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (28, 'eGMjtG1619342010679K', 'T1617773784543MKLRZn', 'B1617690143101zIeSOm', '2021-04-25 18:13:30', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (29, 'EGZz1621995653994GUR', 'T1617773784543MKLRZn', 'qlkD1617685215270Sfy', '2021-05-26 11:20:53', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (30, 'eiXLYW1624155875154i', 'T1617773784543MKLRZn', 'Setv1619159012587hpx', '2021-06-20 11:24:35', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (31, 'EJWyq1623563733502JY', 'T1617773784543MKLRZn', 'cTP1617686537729CtUL', '2021-06-13 14:55:33', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (32, 'EkHIHYE1621398598713', 'T1617773784543MKLRZn', 'CZp1617688337684iIEj', '2021-05-19 13:29:58', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (33, 'enX1618019573891dVJa', 'T1617773784543MKLRZn', 'hYuWBv1617690156495B', '2021-04-10 10:52:53', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (34, 'EVaB1621995660770YYf', 'T1617773784543MKLRZn', 'ari1617685257015eQbK', '2021-05-26 11:21:00', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (35, 'Eyg1624628775347esvr', 'T1617773784543MKLRZn', 'vqINGKr1617691537278', '2021-06-25 22:46:15', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (36, 'f1621762333640vsalrw', 'T1617773784543MKLRZn', 'uZdxER1617685091349q', '2021-05-23 18:32:13', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (187, 'f1624768123080QiwttO', 'T1617773784543MKLRZn', 'kkbes1617690757342iF', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (195, 'f1624768123092uDYpeR', 'T1617773784543MKLRZn', 'hWidbcN1619346254899', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (37, 'fbfcoRN1619326545527', 'T1617773784543MKLRZn', 'k1617688553902XjzFCy', '2021-04-25 13:55:45', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (38, 'fd1623498041609CSNqa', 'T1617773784543MKLRZn', 'eBs1617686402027CkkN', '2021-06-12 20:40:41', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (39, 'FgBjVXE1623999592932', 'T1617773784543MKLRZn', 'eXYOni1617688817371c', '2021-06-18 15:59:52', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (40, 'fJB1624155875160oEfQ', 'T1617773784543MKLRZn', 'iFnb1619159115861ZNK', '2021-06-20 11:24:35', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (190, 'Fkd1624768123085udYR', 'T1617773784543MKLRZn', 'rfDQnbW1619345963519', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (41, 'Fl1624155875157OhpHT', 'T1617773784543MKLRZn', 'Xx1619159049782JpLKV', '2021-06-20 11:24:35', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (42, 'fprmJr1619332971662U', 'T1617773784543MKLRZn', 'zaYaP1617690026127Te', '2021-04-25 15:42:51', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (43, 'FQT1624163165539qxQc', 'T1617773784543MKLRZn', 'vUQXMVa1617690946162', '2021-06-20 13:26:05', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (231, 'g1624768123234pjkaes', 'T1617773784543MKLRZn', 'n1617685645747YeYsgZ', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (265, 'g1624768123283NawRzT', 'T1617773784543MKLRZn', 'RDdKRIu1617686130583', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (44, 'gabbxx1623563791162u', 'T1617773784543MKLRZn', 'y1617686600599RqoSsU', '2021-06-13 14:56:31', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (281, 'GDxp1624768123347zPQ', 'T1617773784543MKLRZn', 'SvFu1617688700467PvF', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (199, 'gGHKVKG1624768123100', 'T1617773784543MKLRZn', 'UxHDHF1617690885521n', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (45, 'gHNNmcG1624247300899', 'T1617773784543MKLRZn', 'htAo1619178257967HIQ', '2021-06-21 12:48:20', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (46, 'GI1624698766486ttcEB', 'T1617773784543MKLRZn', 'zqYNi1617688178303Jj', '2021-06-26 18:12:46', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (47, 'GiL1618019464276tEhb', 'T1617773784543MKLRZn', 'wSSQFD1617690129416s', '2021-04-10 10:51:04', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (48, 'glgi1624247300903FXr', 'T1617773784543MKLRZn', 'UrSprt1617691140153j', '2021-06-21 12:48:20', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (180, 'gnhKYoY1624768123011', 'T1617773784543MKLRZn', 'DrB1617689900021tJru', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (49, 'gTwvk1624251231439yT', 'T1617773784543MKLRZn', 'QyRNVuf1617691418624', '2021-06-21 13:53:51', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (179, 'gvFPMhg1624768123009', 'T1617773784543MKLRZn', 'qH1619330132562vCXBm', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (50, 'h1624074147213VwNMmL', 'T1617773784543MKLRZn', 'fj1617690622230Lffft', '2021-06-19 12:42:27', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (270, 'h1624768123319kPLPXW', 'T1617773784543MKLRZn', 'siGZT1619141385876kF', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (51, 'HAbUn1619855234224dQ', 'T1617773784543MKLRZn', 'GuP1617691566626dvRA', '2021-05-01 16:47:14', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (216, 'HaC1624768123183YSbn', 'T1617773784543MKLRZn', 'hiim1617683467594YRY', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (52, 'HfExtOV1624251241977', 'T1617773784543MKLRZn', 'cLEUrrW1617691447795', '2021-06-21 13:54:01', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (208, 'hHqVk1624768123137Dg', 'T1617773784543MKLRZn', 'q1617691273028DpJblt', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (210, 'HVevzAy1624768123140', 'T1617773784543MKLRZn', 'VJLb1619349481831LuX', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (267, 'HZRo1624768123304aPv', 'T1617773784543MKLRZn', 'VJljX1617686507261iy', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (53, 'i1619333431176fSpqzl', 'T1617773784543MKLRZn', 'wEZC1617690101921eeh', '2021-04-25 15:50:31', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (54, 'I1621919777042iCSMoo', 'T1617773784543MKLRZn', 'kCs1617685025399aUmD', '2021-05-25 14:16:17', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (227, 'Iab1624768123199QasA', 'T1617773784543MKLRZn', 'wReS1617684910526lEK', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (213, 'iaJGA1624768123144tU', 'T1617773784543MKLRZn', 'Nd1617691331094UeXXb', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (55, 'ialV1619315689607eCH', 'T1617773784543MKLRZn', 'KL1617684973373YzQOa', '2021-04-25 10:54:49', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (217, 'ibS1624768123184hxIv', 'T1617773784543MKLRZn', 'nFIGS1617683501961lw', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (215, 'icATtDF1624768123172', 'T1617773784543MKLRZn', 'd1617691641464Ptmvjx', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (271, 'iJQUgcI1624768123326', 'T1617773784543MKLRZn', 'L1617688242674YwkQAy', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (254, 'IKeOe1624768123271mT', 'T1617773784543MKLRZn', 'qlo1619318587737xclU', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (181, 'Im1624768123013bzdcp', 'T1617773784543MKLRZn', 'EKvU1617689917992Jfr', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (56, 'IrY1624251250583nEWI', 'T1617773784543MKLRZn', 'CVWk1617691479896GIj', '2021-06-21 13:54:10', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (237, 'isRL1624768123248tEb', 'T1617773784543MKLRZn', 'XWfLnyk1617692193442', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (57, 'j1624004223253BVnjqm', 'T1617773784543MKLRZn', 'mbFzwxc1617689977402', '2021-06-18 17:17:03', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (847, 'J1626510411274aLANCW', 'T1617773784543MKLRZn', 'sSqwa1626509636330ck', '2021-07-17 17:26:51', '::ffff:172.17.0.1', NULL, NULL, 'Y', 'N'),
        (58, 'JBG1624165503825MGNy', 'T1617773784543MKLRZn', 'SuiUUr1617690772167d', '2021-06-20 14:05:03', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (59, 'JELRHHR1624251235663', 'T1617773784543MKLRZn', 'dI1617691432796fQpqX', '2021-06-21 13:53:55', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (60, 'JfL1623675952804bchd', 'T1617773784543MKLRZn', 'XNcrRT1619142279885F', '2021-06-14 22:05:52', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (262, 'jGz1624768123280ZWun', 'T1617773784543MKLRZn', 'eP1617687968986kdbbj', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (61, 'Jjt1623498552867PbLB', 'T1617773784543MKLRZn', 'kCdm1619318907675TCu', '2021-06-12 20:49:12', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (62, 'JQhGg1624251222650fl', 'T1617773784543MKLRZn', 'Oo1617691389632JKoWM', '2021-06-21 13:53:42', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (63, 'JuMux1624155875156gm', 'T1617773784543MKLRZn', 'ENRTwOP1619159031243', '2021-06-20 11:24:35', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (64, 'JuWmGq1619351006442F', 'T1617773784543MKLRZn', 'lpIglo1617691523078e', '2021-04-25 20:43:26', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (65, 'KcyUvX1619262148222z', 'T1617773784543MKLRZn', 'aWlu1617682826097pZe', '2021-04-24 20:02:28', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (242, 'KjSo1624768123255ylH', 'T1617773784543MKLRZn', 'aIYW1617692258203RJf', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (222, 'Kl1624768123193hkqlh', 'T1617773784543MKLRZn', 'VJ1617683688584sCaqN', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (239, 'kP1624768123250JnVsC', 'T1617773784543MKLRZn', 'OipI1617692219409LYE', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (66, 'kqOC1619265002975vOo', 'T1617773784543MKLRZn', 'ZnSKbN1617682902715D', '2021-04-24 20:50:02', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (278, 'kUr1624768123335WBJo', 'T1617773784543MKLRZn', 'AmvXq1617688538675PX', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (67, 'kxJYIsH1619856667475', 'T1617773784543MKLRZn', 'GpGYwJt1619159095273', '2021-05-01 17:11:07', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (240, 'kzMIpB1624768123252Q', 'T1617773784543MKLRZn', 'd1617692233012pBOUCK', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (68, 'l1623563782401SloByz', 'T1617773784543MKLRZn', 'TKzOjpi1617686585400', '2021-06-13 14:56:22', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (69, 'leoJEt1621398582287p', 'T1617773784543MKLRZn', 'U1617683411475etYgFO', '2021-05-19 13:29:42', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (70, 'lHL1619259519119Lzqy', 'T1617773784543MKLRZn', 'VHI1617682787237PDYt', '2021-04-24 19:18:39', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (71, 'LLfd1623488367166WHK', 'T1617773784543MKLRZn', 'wbi1617685695068SGzA', '2021-06-12 17:59:27', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (72, 'lmEKf1619856956031rx', 'T1617773784543MKLRZn', 'UY1619153982779QIVRq', '2021-05-01 17:15:56', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (171, 'LQ1624768122990OrWtx', 'T1617773784543MKLRZn', 'bHELBPm1617689088683', '2021-06-27 13:28:42', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (73, 'lt1618020108495VdDFs', 'T1617773784543MKLRZn', 'BnjjNb1617690039693C', '2021-04-10 11:01:48', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (234, 'LTYrDO1624768123243F', 'T1617773784543MKLRZn', 'ZWIX1617692133689zNx', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (256, 'LUacgq1624768123273L', 'T1617773784543MKLRZn', 'DjC1619317945380XwHe', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (74, 'lxdNdTd1624004251136', 'T1617773784543MKLRZn', 'M1617690067526aqQSFx', '2021-06-18 17:17:31', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (75, 'm1624163179828LREMiM', 'T1617773784543MKLRZn', 'SH1617690990667ryQkC', '2021-06-20 13:26:19', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (185, 'M1624768123061yvWjVX', 'T1617773784543MKLRZn', 'Kx1619158838238pCDXS', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (76, 'MDpJDh1623476945354t', 'T1617773784543MKLRZn', 'FsLLW1617685677061iv', '2021-06-12 14:49:05', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (77, 'MFhrcD1623730192717w', 'T1617773784543MKLRZn', 'Q1617688727798FVVxOF', '2021-06-15 13:09:52', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (78, 'MIF1623563509325gLgD', 'T1617773784543MKLRZn', 'ZVbPFm1617686493277o', '2021-06-13 14:51:49', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (192, 'MII1624768123088TdSn', 'T1617773784543MKLRZn', 'pCBQp1619346087141aI', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (79, 'mK1623498047290RGGbA', 'T1617773784543MKLRZn', 'fddW1617686414741VCr', '2021-06-12 20:40:47', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (80, 'MKOm1624247344572uLY', 'T1617773784543MKLRZn', 'RZCF1617691153958FRX', '2021-06-21 12:49:04', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (81, 'MqdWde1621919787670e', 'T1617773784543MKLRZn', 'BV1617685057809IWBVM', '2021-05-25 14:16:27', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (82, 'MU1624004215849mkhQV', 'T1617773784543MKLRZn', 'jdKBH1617689963499uB', '2021-06-18 17:16:55', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (83, 'mVs1624628775351ULmV', 'T1617773784543MKLRZn', 'jEi1617691551741tSOG', '2021-06-25 22:46:15', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (224, 'mX1624768123195mJXIN', 'T1617773784543MKLRZn', 'gSutwYw1619312843781', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (173, 'mXhyB1624768122995PM', 'T1617773784543MKLRZn', 'XkW1617689123553Zvzr', '2021-06-27 13:28:42', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (189, 'MXXp1624768123084dIG', 'T1617773784543MKLRZn', 'Zvpy1619345897043isH', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (220, 'N1624768123190QfkEtG', 'T1617773784543MKLRZn', 'JGd1617683646183nWBz', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (275, 'nffg1624768123332EJD', 'T1617773784543MKLRZn', 'XI1617688471009RRpOo', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (200, 'nFT1624768123120mztY', 'T1617773784543MKLRZn', 'SioYPe1619178659344f', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (249, 'nI1624768123263eAdFy', 'T1617773784543MKLRZn', 'FAjHVhu1617692354429', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (84, 'nm1619324055811AEXPw', 'T1617773784543MKLRZn', 'gq1617686317373XHpoz', '2021-04-25 13:14:15', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (223, 'NQf1624768123194kZyy', 'T1617773784543MKLRZn', 'fWHJmEv1617684892794', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (261, 'Nuxiw1624768123279ii', 'T1617773784543MKLRZn', 'EuJg1617686102052Yxd', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (193, 'NYMm1624768123089Skj', 'T1617773784543MKLRZn', 'ivD1619346146187qBeA', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (276, 'o1624768123333KlLSyj', 'T1617773784543MKLRZn', 'Q1617688491869kwnWcG', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (85, 'OAT1623498032247Oupk', 'T1617773784543MKLRZn', 'AVQ1617688011683veXo', '2021-06-12 20:40:32', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (86, 'OIWp1621995677439OkI', 'T1617773784543MKLRZn', 'XlFZ1617685290356QZT', '2021-05-26 11:21:17', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (186, 'OJeMsuu1624768123078', 'T1617773784543MKLRZn', 'BfX1617690742857nUXg', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (87, 'Ok1624073918740vUxlV', 'T1617773784543MKLRZn', 'sK1617691790694qGZyx', '2021-06-19 12:38:38', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (257, 'OMibHIu1624768123274', 'T1617773784543MKLRZn', 'oPkQ1617686057472UEH', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (88, 'op1621995637466lSRFN', 'T1617773784543MKLRZn', 'bffuH1617685179867jM', '2021-05-26 11:20:37', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (204, 'OpvXD1624768123132Pa', 'T1617773784543MKLRZn', 'FV1617691241638WOtiK', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (89, 'PCH1619857665562TRBE', 'T1617773784543MKLRZn', 'picDYTK1617685662336', '2021-05-01 17:27:45', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (90, 'pCwn1624074150817tNE', 'T1617773784543MKLRZn', 'xW1617690640823UIksf', '2021-06-19 12:42:30', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (255, 'PeNcrp1624768123272T', 'T1617773784543MKLRZn', 'pgNfcjy1619317925868', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (91, 'pHYM1619252618027vxl', 'T1617773784543MKLRZn', 'yQWpkir1617688667026', '2021-04-24 17:23:38', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (92, 'PuVh1623676649242VMS', 'T1617773784543MKLRZn', 'IEjNkA1619012061260L', '2021-06-14 22:17:29', '::ffff:172.17.0.1', '2021-06-26 18:12:46', '::ffff:172.17.0.1', 'Y', 'N'),
        (266, 'PuXxwz1624768123284a', 'T1617773784543MKLRZn', 'mJCF1619318709313ysH', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (93, 'PwkQY1624155875153zw', 'T1617773784543MKLRZn', 'cjozg1619158988578Dy', '2021-06-20 11:24:35', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (94, 'Q1619347746935Vhchmm', 'T1617773784543MKLRZn', 'XPebmV1619179187706G', '2021-04-25 19:49:06', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (95, 'q1623563766457uUaAmd', 'T1617773784543MKLRZn', 'K1617686570367IbIEqY', '2021-06-13 14:56:06', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (96, 'q1623999592936dotdJD', 'T1617773784543MKLRZn', 'nAvqxz1617688830871w', '2021-06-18 15:59:52', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (97, 'QBR1624074143258vrdr', 'T1617773784543MKLRZn', 'CMxWUV1617690606711D', '2021-06-19 12:42:23', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (98, 'qBy1623730223472Bhlp', 'T1617773784543MKLRZn', 'RE1617688773994KnYXd', '2021-06-15 13:10:23', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (99, 'QOPUFW1621910136967Z', 'T1617773784543MKLRZn', 'vk1617685109763LDPNY', '2021-05-25 11:35:36', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (273, 'QRBLOLX1624768123329', 'T1617773784543MKLRZn', 'HSrbpC1617688399581M', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (100, 'qrIPTX1624163193459i', 'T1617773784543MKLRZn', 'MP1617691067909jxcWc', '2021-06-20 13:26:33', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (277, 'QwHGlc1624768123334S', 'T1617773784543MKLRZn', 'sweDXI1617688516134u', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (101, 'qwiXOu1619854837473c', 'T1617773784543MKLRZn', 'VvFc1617691345521eAM', '2021-05-01 16:40:37', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (219, 'qYy1624768123189LuyB', 'T1617773784543MKLRZn', 'i1617683608391leidZG', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (102, 'r1623673725114UOXYUD', 'T1617773784543MKLRZn', 'hpXEml1617688212167t', '2021-06-14 21:28:45', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (103, 'RDGBZYK1619350761200', 'T1617773784543MKLRZn', 'wN1617691374902fVQZj', '2021-04-25 20:39:21', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (104, 'REzXrC1624251245934h', 'T1617773784543MKLRZn', 'PD1617691464911EKhTL', '2021-06-21 13:54:05', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (105, 'rgX1624163171471JjIe', 'T1617773784543MKLRZn', 'uo1617690962543egYFj', '2021-06-20 13:26:11', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (106, 'roTgwVn1624698766482', 'T1617773784543MKLRZn', 'qMz1617688160685WVie', '2021-06-26 18:12:46', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (107, 'rU1619857241100WzRUS', 'T1617773784543MKLRZn', 'FJIyt1617685724474xG', '2021-05-01 17:20:41', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (108, 'RvxtNp1623477368776z', 'T1617773784543MKLRZn', 'GOH1617687091505GMAz', '2021-06-12 14:56:08', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (109, 'Rw1621995592885kVTLm', 'T1617773784543MKLRZn', 'EtrLWDJ1617685141878', '2021-05-26 11:19:52', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (110, 'rXaNz1624004255033YU', 'T1617773784543MKLRZn', 'WW1617690088280AWXXu', '2021-06-18 17:17:35', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (218, 'S1624768123188yoXHNY', 'T1617773784543MKLRZn', 'at1617683568543MQpfL', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (229, 'ScvbY1624768123230pC', 'T1617773784543MKLRZn', 'Ohb1617685362949Xttj', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (188, 'SdTeTu1624768123083y', 'T1617773784543MKLRZn', 'AMj1617690791072IKhi', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (111, 'seiEIj1621919365895z', 'T1617773784543MKLRZn', 'BfX1617685011279bGbM', '2021-05-25 14:09:25', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (178, 'SfVkN1624768123005Ou', 'T1617773784543MKLRZn', 'MYYHojt1619330115015', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (274, 'sJd1624768123331bAcO', 'T1617773784543MKLRZn', 'nRCodMq1617688455358', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (177, 'snNIT1624768123003ld', 'T1617773784543MKLRZn', 'gQ1619329353880lFZTV', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (112, 'sS1623730203717jfxCY', 'T1617773784543MKLRZn', 'oob1617688744580EWEM', '2021-06-15 13:10:03', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (269, 'sTN1624768123317lyyr', 'T1617773784543MKLRZn', 'cLEJF1617688140500lx', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (113, 'sUqpa1624163175524Wp', 'T1617773784543MKLRZn', 'hk1617690976759OMcvp', '2021-06-20 13:26:15', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (114, 'suQzS1619844022656Dt', 'T1617773784543MKLRZn', 'ej1617688228080etHji', '2021-05-01 13:40:22', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (184, 'swC1624768123019Gxtc', 'T1617773784543MKLRZn', 'AJYRBGo1619330030498', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (168, 'swtmoF1624768122981N', 'T1617773784543MKLRZn', 'qITqpA1617689044321f', '2021-06-27 13:28:42', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (115, 'SzeiMa1623999592938X', 'T1617773784543MKLRZn', 'F1619180812531eiRqVu', '2021-06-18 15:59:52', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (116, 't1623498035955TnavRT', 'T1617773784543MKLRZn', 'CKVwoUj1617686385077', '2021-06-12 20:40:35', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (117, 't1623730212944xOSKTF', 'T1617773784543MKLRZn', 'Lzt1617688759421oAZD', '2021-06-15 13:10:12', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (118, 'T1624247344575GsJGgL', 'T1617773784543MKLRZn', 'E1617691168179MGcCVF', '2021-06-21 12:49:04', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (196, 't1624768123094XiwwxX', 'T1617773784543MKLRZn', 'IK1617690837240SCNQm', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (241, 't1624768123253VqFhNM', 'T1617773784543MKLRZn', 'GsZD1617692246060Zhy', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (235, 'tdFEkr1624768123244L', 'T1617773784543MKLRZn', 'DTQTW1617692148089HN', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (119, 'TeSMgG1619015371039t', 'T1617773784543MKLRZn', 'lundi1617686154398kN', '2021-04-21 23:29:31', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (260, 'tKlKGcf1624768123278', 'T1617773784543MKLRZn', 'paNF1617686087218kvL', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (120, 'To1623498017541mCceT', 'T1617773784543MKLRZn', 'MVQ1619319509205FVUg', '2021-06-12 20:40:17', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (121, 'tQYYeg1624163188872c', 'T1617773784543MKLRZn', 'Xvl1617691054676BLbo', '2021-06-20 13:26:28', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (122, 'TRDWPe1619014449069B', 'T1617773784543MKLRZn', 'F1619012225347uuKMhw', '2021-04-21 23:14:09', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (123, 'TsgbZt1624251226893z', 'T1617773784543MKLRZn', 'f1617691404392ERzflF', '2021-06-21 13:53:46', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (124, 'TtT1619315617073RoZR', 'T1617773784543MKLRZn', 'S1617684955017JFIumn', '2021-04-25 10:53:37', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (125, 'tYv1621919360141szbv', 'T1617773784543MKLRZn', 'dNrN1617684996447qOA', '2021-05-25 14:09:20', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (126, 'U1624074134717rPGwMV', 'T1617773784543MKLRZn', 'tBN1617690575007jNty', '2021-06-19 12:42:14', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (127, 'U1624155875149ySyRnN', 'T1617773784543MKLRZn', 'kgHt1619158968829afj', '2021-06-20 11:24:35', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (174, 'U1624768122997YpesHT', 'T1617773784543MKLRZn', 'AG1619329923777LqIPy', '2021-06-27 13:28:42', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (233, 'UcB1624768123242cJXO', 'T1617773784543MKLRZn', 'wrBN1617692120470ysR', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (128, 'uEI1624004234297cyBk', 'T1617773784543MKLRZn', 'LEjRdC1617690010717t', '2021-06-18 17:17:14', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (129, 'UfMop1624628775355Wd', 'T1617773784543MKLRZn', 'eqaOCnz1617691599380', '2021-06-25 22:46:15', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (246, 'UgIU1624768123260CvK', 'T1617773784543MKLRZn', 'XZfiA1617692311435UD', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (130, 'uLfreTH1621995627853', 'T1617773784543MKLRZn', 'G1617685160282ZmcCrM', '2021-05-26 11:20:27', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (131, 'ULodDnf1619342186923', 'T1617773784543MKLRZn', 'YJKyLU1617690591021h', '2021-04-25 18:16:26', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (245, 'uOoGejR1624768123258', 'T1617773784543MKLRZn', 'U1617692298881NZwJdj', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (132, 'UtXnp1619855247418ms', 'T1617773784543MKLRZn', 'Vm1617691627356GZtNd', '2021-05-01 16:47:27', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (226, 'UuOQAH1624768123197q', 'T1617773784543MKLRZn', 'QC1619312971337AqYpN', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (133, 'UvsNQF1619313295559T', 'T1617773784543MKLRZn', 'flfE1617684930419rMf', '2021-04-25 10:14:55', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (134, 'vA1623729918034HByLS', 'T1617773784543MKLRZn', 'a1617688685796Oslkvi', '2021-06-15 13:05:18', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (194, 'vaNh1624768123090Tcu', 'T1617773784543MKLRZn', 'XrnEgI1617690822540n', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (202, 'VCquQpd1624768123129', 'T1617773784543MKLRZn', 'ouqsLUq1617691194741', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (135, 'VdnTQwr1623717492589', 'T1617773784543MKLRZn', 'Tz1617688611713wZfKg', '2021-06-15 09:38:12', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (136, 'vDqgP1624155875161FM', 'T1617773784543MKLRZn', 'KygH1619159135190rkp', '2021-06-20 11:24:35', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (137, 'vis1623498000611HxgT', 'T1617773784543MKLRZn', 'iPUUDQ1617686168385p', '2021-06-12 20:40:00', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (138, 'VLTly1619852784023ir', 'T1617773784543MKLRZn', 'dxO1617688869086NNkT', '2021-05-01 16:06:24', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (212, 'VnRa1624768123142KGQ', 'T1617773784543MKLRZn', 'mdoI1617691317329jJl', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (139, 'Vo1624163160877uEsUy', 'T1617773784543MKLRZn', 'nliXBpe1619346980735', '2021-06-20 13:26:00', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (228, 'vofhEGN1624768123227', 'T1617773784543MKLRZn', 'kuRI1617685328685PCL', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (140, 'vV1621920577748YVdmf', 'T1617773784543MKLRZn', 'ssO1617687189173zGlK', '2021-05-25 14:29:37', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (141, 'VXo1618019464265HPtU', 'T1617773784543MKLRZn', 'XQSP1617689945699vvv', '2021-04-10 10:51:04', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (142, 'Vz1619342373264PHSLJ', 'T1617773784543MKLRZn', 'YFdfL1617690692640pH', '2021-04-25 18:19:33', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (143, 'VziKlve1624163151282', 'T1617773784543MKLRZn', 'SeRnu1619347424736oW', '2021-06-20 13:25:51', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (169, 'wb1624768122984lgtUg', 'T1617773784543MKLRZn', 'cGVs1617689058125dEv', '2021-06-27 13:28:42', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (144, 'WBEenSq1624074155508', 'T1617773784543MKLRZn', 'hAdZzX1617690656103W', '2021-06-19 12:42:35', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (268, 'Wc1624768123316LCFtP', 'T1617773784543MKLRZn', 'ZXdQT1617688117620Kp', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (206, 'WfvAHSx1624768123134', 'T1617773784543MKLRZn', 'AgJmIv1619349258683c', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (145, 'WoD1624247344576rGmi', 'T1617773784543MKLRZn', 'ANqm1617691180937Vix', '2021-06-21 12:49:04', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (146, 'Woi1621995684789AqHH', 'T1617773784543MKLRZn', 'kCijoiw1617687245845', '2021-05-26 11:21:24', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (209, 'wtlFjz1624768123138t', 'T1617773784543MKLRZn', 'xD1617691288301xOsvB', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (147, 'wUJgews1619350741407', 'T1617773784543MKLRZn', 'KA1617691210754FxPXn', '2021-04-25 20:39:01', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (175, 'Wxw1624768122999PEQi', 'T1617773784543MKLRZn', 'TiBv1617689137789per', '2021-06-27 13:28:42', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (148, 'WyTiU1623563528386Gr', 'T1617773784543MKLRZn', 'n1617686523267PPdKRC', '2021-06-13 14:52:08', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (149, 'X1623563799595bPRGDB', 'T1617773784543MKLRZn', 'JpHo1617686614042tGn', '2021-06-13 14:56:39', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (150, 'xBDkapM1624074171473', 'T1617773784543MKLRZn', 'ljd1617690728230OcUc', '2021-06-19 12:42:51', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (151, 'XE1624628775354TRiDD', 'T1617773784543MKLRZn', 'ehV1617691582518czOk', '2021-06-25 22:46:15', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (152, 'xKbsx1621398555691hu', 'T1617773784543MKLRZn', 'JB1617682637993GaPCK', '2021-05-19 13:29:15', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (259, 'xl1624768123277yTElu', 'T1617773784543MKLRZn', 'U1619318276267fJrivz', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (247, 'XoR1624768123261jKVj', 'T1617773784543MKLRZn', 'vTC1617692325120hpKy', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (153, 'XsEycD1619333275191F', 'T1617773784543MKLRZn', 'AbFp1617690053679MfC', '2021-04-25 15:47:55', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (154, 'xtWALw1623717478243Q', 'T1617773784543MKLRZn', 'Nr1617688597087MzSAo', '2021-06-15 09:37:58', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (155, 'XXG1623498021181GRHQ', 'T1617773784543MKLRZn', 'itn1617686335680DnoA', '2021-06-12 20:40:21', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (207, 'xXNIfY1624768123135v', 'T1617773784543MKLRZn', 'JgPbu1619349344177QQ', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (156, 'y1619264988066jZIbpz', 'T1617773784543MKLRZn', 'Y1617682922450jLJDvQ', '2021-04-24 20:49:48', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (182, 'y1624768123015PudGjp', 'T1617773784543MKLRZn', 'Wud1617689932201GWoW', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (157, 'yBL1619254313163FCQb', 'T1617773784543MKLRZn', 'moum1617688803133KDK', '2021-04-24 17:53:12', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (158, 'yE1620045309113xkgYr', 'T1617773784543MKLRZn', 'gaXltl1617692064737B', '2021-05-03 21:35:09', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (244, 'yHvHZi1624768123257l', 'T1617773784543MKLRZn', 'yVYGjn1617692285630m', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (172, 'YJm1624768122993pQrb', 'T1617773784543MKLRZn', 'oYCV1617689103507gcQ', '2021-06-27 13:28:42', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (159, 'yKmf1623563773857pBe', 'T1617773784543MKLRZn', 'z1617688064130EDPbWc', '2021-06-13 14:56:13', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (280, 'yqyLiuZ1624768123343', 'T1617773784543MKLRZn', 'fBE1617688648208MMwd', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (258, 'YThnW1624768123275Dy', 'T1617773784543MKLRZn', 'ttQCZki1617686071782', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (160, 'z1619315764418ZDLFVr', 'T1617773784543MKLRZn', 'wychQA1617683535981H', '2021-04-25 10:56:04', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (161, 'z1619326839752LUWDgf', 'T1617773784543MKLRZn', 'jahWg1617688582449bI', '2021-04-25 14:00:39', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (162, 'z1624163198658HclEFS', 'T1617773784543MKLRZn', 'euWF1617691083886NiK', '2021-06-20 13:26:38', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (250, 'z1624768123264qKbRiG', 'T1617773784543MKLRZn', 'nDuoTJy1617692368386', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (163, 'ZaKXsU1621398590494L', 'T1617773784543MKLRZn', 'ku1617685799109yKitW', '2021-05-19 13:29:50', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (164, 'zC1621919781045YBBlr', 'T1617773784543MKLRZn', 'Ut1617685039971wJiPQ', '2021-05-25 14:16:21', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (230, 'ZCNViwo1624768123231', 'T1617773784543MKLRZn', 'J1617685612715KKtEoM', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (211, 'ZEqfOc1624768123141g', 'T1617773784543MKLRZn', 'KbbF1617691303153rpx', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (264, 'ZPM1624768123282pNdd', 'T1617773784543MKLRZn', 'RGAnz1619319005583xP', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (165, 'zqWQnXB1624698766488', 'T1617773784543MKLRZn', 'm1617688197706pJPsHd', '2021-06-26 18:12:46', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (243, 'Zwsiq1624768123256yE', 'T1617773784543MKLRZn', 'ntVBvu1617692271762L', '2021-06-27 13:28:43', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N'),
        (166, 'ZZ1621919794242EgOpa', 'T1617773784543MKLRZn', 'mnNdpze1617685077300', '2021-05-25 14:16:34', '::ffff:172.17.0.1', '2021-07-17 17:26:51', '::ffff:172.17.0.1', 'Y', 'N');
      `, { 
        type: QueryTypes.INSERT 
      }
    );



    // FmsCompanyInfos
    await sequelize.query(`
        INSERT INTO \`FmsCompanyInfos\` (\`seq\`, \`companyInfoKey\`, \`companyKey\`, \`createrUserKey\`, \`createdAt\`, \`updatedAt\`) VALUES
        (1, 'tEZl1624718677168DhM', 'ovau1623568601311tXN', 'C1618033738099vtEiUg', '2021-06-27 13:26:56', NULL);
      `, { 
        type: QueryTypes.INSERT 
      }
    );



    // FmsPermissionGroupInfos
    await sequelize.query(`
        INSERT INTO \`FmsPermissionGroupInfos\` (\`seq\`, \`permissionGroupInfoKey\`, \`permissionGroupKey\`, \`createrUserKey\`, \`createdAt\`, \`updatedAt\`) VALUES
        (1, 'Nuv1624752918473GPPU', 'T1617773784543MKLRZn', 'C1618033738099vtEiUg', '2021-06-27 13:26:56', NULL);
      `, { 
        type: QueryTypes.INSERT 
      }
    );



    // table 생성
    await queryInterface.createTable(table_name, {
      seq: {
        type: Sequelize.BIGINT.UNSIGNED,
        primaryKey: true,
        allowNull: false,
        autoIncrement: true,
        comment: 'pk',
      },
    }, {
      comment: 'db init 체크를 위한 테이블(삭제하지 마세요.)',
    });


  }

  myLogger.info('db_init_check 크론 종료 ' + myDate().format('YYYY-MM-DD HH:mm:ss') + ' => ' + processId);
  is_cron_executing = false;

  return;
});

