
const myResultCode = {
  00000000: {
    msg: `미정의`,
  },


  20001010: {
    msg: `로그인 상태가 만료되었습니다.`,
  },
  20001011: {
    msg: `로그인 상태가 만료되었습니다.`,
  },
  20001012: {
    msg: `로그인 상태가 만료되었습니다.`,
  },
  20001013: {
    msg: `로그인 상태가 만료되었습니다.`,
  },
  20001014: {
    msg: `로그인 상태를 갱신하였습니다.`,
  },


  20001509: {
    msg: `코드그룹이 올바르지 않습니다.`,
  },
  20001510: {
    msg: `이미 존재하는 코드그룹으로 요청하셨습니다.`,
  },
  20001520: {
    msg: `코드그룹명이 올바르지 않습니다.`,
  },
  20001530: {
    msg: `코드그룹명은 공백일 수 없습니다.`,
  },
  20001540: {
    msg: `코드그룹명은 100자를 넘을 수 없습니다.`,
  },
  20001550: {
    msg: `코드 그룹 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20001590: {
    msg: `코드그룹은 공백일 수 없습니다.`,
  },
  20001600: {
    msg: `코드그룹은 5자이어야 합니다.`,
  },


  20002010: {
    msg: `코드그룹이 올바르지 않습니다.`,
  },
  20002020: {
    msg: `등록되지 않은 코드그룹으로 요청하셨습니다.`,
  },
  20002030: {
    msg: `코드가 올바르지 않습니다.`,
  },
  20002040: {
    msg: `코드는 공백일 수 없습니다.`,
  },
  20002050: {
    msg: `코드는 13자이어야 합니다.`,
  },
  20002055: {
    msg: `이미 등록된 코드 입니다.`,
  },
  20002060: {
    msg: `코드명이 올바르지 않습니다.`,
  },
  20002070: {
    msg: `코드명은 공백일 수 없습니다.`,
  },
  20002080: {
    msg: `코드명은 50자를 넘을 수 없습니다.`,
  },
  20002089: {
    msg: `코드 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20002090: {
    msg: `코드 설명은 공백이 될 수 없습니다.`,
  },
  20002100: {
    msg: `코드 설명은 100자를 넘을 수 없습니다.`,
  },
  20002109: {
    msg: `코드 필요값 1에 유효하지 않은 값이 존재합니다.`,
  },
  20002110: {
    msg: `코드 필요값 1은 공백일 수 없습니다.`,
  },
  20002120: {
    msg: `코드 필요값 1은 100자를 넘을 수 없습니다.`,
  },
  20002129: {
    msg: `코드 필요값 2에 유효하지 않은 값이 존재합니다.`,
  },
  20002130: {
    msg: `코드 필요값 2는 공백일 수 없습니다.`,
  },
  20002140: {
    msg: `코드 필요값 2는 100자를 넘을 수 없습니다.`,
  },


  20002510: {
    msg: `코드가 올바르지 않습니다.`,
  },
  20002520: {
    msg: `코드는 공백일 수 없습니다.`,
  },
  20002530: {
    msg: `코드 길이는 13자이어야 합니다.`,
  },
  20002540: {
    msg: `코드가 존재하지 않습니다.`,
  },
  20002550: {
    msg: `코드명이 올바르지 않습니다.`,
  },
  20002559: {
    msg: `코드명에 유효하지 않은 값이 존재합니다.`,
  },
  20002560: {
    msg: `코드명은 공백일 수 없습니다.`,
  },
  20002570: {
    msg: `코드명은 50자를 넘을 수 없습니다.`,
  },
  20002579: {
    msg: `코드설명에 유효하지 않은 값이 존재합니다.`,
  },
  20002580: {
    msg: `코드설명이 올바르지 않습니다.`,
  },
  20002590: {
    msg: `코드설명은 100자를 넘을 수 없습니다.`,
  },
  20002659: {
    msg: `코드 필요값1에 유효하지 않은 값이 존재합니다.`,
  },
  20002600: {
    msg: `코드 필요값1이 올바르지 않습니다.`,
  },
  20002610: {
    msg: `코드 필요값1은 100자를 넘을 수 없습니다.`,
  },
  20002619: {
    msg: `코드 필요값2에 유효하지 않은 값이 존재합니다.`,
  },
  20002620: {
    msg: `코드 필요값2가 올바르지 않습니다.`,
  },
  20002630: {
    msg: `코드 필요값2는 100자를 넘을 수 없습니다.`,
  },


  20003010: {
    msg: `코드는 공백일 수 없습니다.`,
  },
  20003020: {
    msg: `코드는 13자이어야 합니다.`,
  },
  20003030: {
    msg: `수정할 코드가 없습니다.`,
  },
  20003040: {
    msg: `코드 중에 올바르지 않은 코드가 존재합니다.`,
  },
  20003050: {
    msg: `코드 중에 공백인 코드가 존재합니다.`,
  },
  20003060: {
    msg: `코드 중에 13자가 아닌 코드가 존재합니다.`,
  },
  20003070: {
    msg: `코드가 올바르지 않습니다.`,
  },
  20003080: {
    msg: ``,
  },



  20003510: {
    msg: `코드는 공백일 수 없습니다.`,
  },
  20003520: {
    msg: `코드는 13자이어야 합니다.`,
  },
  20003530: {
    msg: `복구할 코드가 없습니다.`,
  },
  20003540: {
    msg: `코드 중에 올바르지 않은 코드가 존재합니다.`,
  },
  20003550: {
    msg: `코드 중에 공백인 코드가 존재합니다.`,
  },
  20003560: {
    msg: `코드 중에 13자가 아닌 코드가 존재합니다.`,
  },
  20003570: {
    msg: `코드가 올바르지 않습니다.`,
  },
  20003580: {
    msg: ``,
  },



  20004010: {
    msg: `코드 그룹은 공백일 수 없습니다.`,
  },
  20004020: {
    msg: `코드 그룹은 5자이어야 합니다.`,
  },
  20004030: {
    msg: `조회할 코드 그룹이 없습니다.`,
  },
  20004040: {
    msg: `코드 그룹중에 올바르지 않은 코드 그룹이 존재합니다.`,
  },
  20004050: {
    msg: `코드 그룹중에 공백인 코드 그룹이 존재합니다.`,
  },
  20004060: {
    msg: `코드 그룹중에 5자가 아닌 코드 그룹이 존재합니다.`,
  },
  20004070: {
    msg: `코드그룹이 올바르지 않습니다.`,
  },
  20004080: {
    msg: ``,
  },



  20004510: {
    msg: `코드 그룹이 올바르지 않습니다.`,
  },
  20004520: {
    msg: `코드 그룹은 공백일 수 없습니다.`,
  },
  20004530: {
    msg: `코드 그룹은 5자이어야 합니다.`,
  },
  20004540: {
    msg: `등록 되지 않은 코드 그룹으로 요청하셨습니다.`,
  },
  20004550: {
    msg: `코드 그룹명이 올바르지 않습니다.`,
  },
  20004559: {
    msg: `코드 그룹명에 유효하지 않은 값이 존재합니다.`,
  },
  20004560: {
    msg: `코드 그룹명은 공백일 수 없습니다.`,
  },
  20004570: {
    msg: `코드 그룹명은 100자를 넘을 수 없습니다.`,
  },
  20004580: {
    msg: `코드 그룹 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20004590: {
    msg: `코드 그룹 설명은 100자를 넘을 수 없습니다.`,
  },
  20004600: {
    msg: ``,
  },


  20005010: {
    msg: `코드 그룹명은 공백일 수 없습니다.`,
  },
  20005020: {
    msg: `코드 그룹명은 5자이어야 합니다.`,
  },
  20005030: {
    msg: `삭제할 코드 그룹이 없습니다.`,
  },
  20005040: {
    msg: `코그 그룹중에 올바르지 않은 코드 그룹이 존재합니다.`,
  },
  20005050: {
    msg: `코드 그룹중에 공백인 코드 그룹이 존재합니다.`,
  },
  20005060: {
    msg: `코드 그룹중에 5자가 아닌 코드 그룹이 존재합니다.`,
  },
  20005070: {
    msg: `코드 그룹이 올바르지 않습니다.`,
  },


  20005510: {
    msg: `코드 그룹명은 공백일 수 없습니다.`,
  },
  20005520: {
    msg: `코드 그룹명은 5자이어야 합니다.`,
  },
  20005530: {
    msg: `삭제할 코드 그룹이 없습니다.`,
  },
  20005540: {
    msg: `코그 그룹중에 올바르지 않은 코드 그룹이 존재합니다.`,
  },
  20005550: {
    msg: `코드 그룹중에 공백인 코드 그룹이 존재합니다.`,
  },
  20005560: {
    msg: `코드 그룹중에 5자가 아닌 코드 그룹이 존재합니다.`,
  },
  20005570: {
    msg: `코드 그룹이 올바르지 않습니다.`,
  },


  20006010: {
    msg: `메뉴 카테고리명이 올바르지 않습니다.`,
  },
  20006020: {
    msg: `메뉴 카테고리명은 공백일 수 없습니다.`,
  },
  20006030: {
    msg: `메뉴 카테고리명은 50자를 넘을 수 없습니다.`,
  },
  20006039: {
    msg: `메뉴 카테고리 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20006040: {
    msg: `메뉴 카테고리 설명은 공백일 수 없습니다.`,
  },
  20006050: {
    msg: `메뉴 카테고리 설명은 255자를 넘을 수 없습니다.`,
  },
  20006060: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20006070: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20006080: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20006090: {
    msg: ``,
  },


  20006510: {
    msg: `등록일 시작 날짜가 올바르지 않습니다.`,
  },
  20006520: {
    msg: `등록일 종료 날짜가 올바르지 않습니다.`,
  },


  20007010: {
    msg: `메뉴카테고리 고유 식별키가 올바르지 않습니다.`,
  },
  20007020: {
    msg: `메뉴카테고리 고유 식별키는 공백일 수 없습니다.`,
  },
  20007030: {
    msg: `존재하지 않는 메뉴카테고리의 수정을 요청하였습니다.`,
  },
  20007039: {
    msg: `메뉴 카테고리명에 유효하지 않은 값이 존재합니다.`,
  },
  20007040: {
    msg: `메뉴 카테고리명이 올바르지 않습니다.`,
  },
  20007050: {
    msg: `메뉴 카테고리명은 공백일 수 없습니다.`,
  },
  20007059: {
    msg: `메뉴 카테고리 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20007060: {
    msg: `메뉴 카테고리 설명이 올바르지 않습니다.`,
  },
  20007070: {
    msg: `메뉴 카테고리 설명은 공백일 수 없습니다.`,
  },
  20007080: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20007090: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20007100: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20007110: {
    msg: `메뉴 카테고리 상태가 올바르지 않습니다.`,
  },
  20007120: {
    msg: `메뉴 카테고리 상태는 공백일 수 없습니다.`,
  },
  20007130: {
    msg: `메뉴 카테고리 상태의 형식이 올바르지 않습니다.`,
  },
  20007140: {
    msg: `메뉴 카테고리 상태가 유효하지 않습니다.`,
  },


  20007510: {
    msg: `메뉴 카테고리 고유 식별키는 공백일 수 없습니다.`,
  },
  20007520: {
    msg: `메뉴 카테고리 고유 식별키는 20자이어야 합니다.`,
  },
  20007530: {
    msg: `삭제할 메뉴 카테고리가 없습니다.`,
  },
  20007540: {
    msg: `메뉴 카테고리 고유 식별키중에 올바르지 식별키가 존재합니다.`,
  },
  20007550: {
    msg: `메뉴 카테고리 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20007560: {
    msg: `메뉴 카테고리 고유 식별키중중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20007570: {
    msg: `메뉴 카테고리 고유 식별키가 올바르지 않습니다.`,
  },
  20007580: {
    msg: ``,
  },


  20008010: {
    msg: `메뉴 카테고리 고유 식별키는 공백일 수 없습니다.`,
  },
  20008020: {
    msg: `메뉴 카테고리 고유 식별키는 20자이어야 합니다.`,
  },
  20008030: {
    msg: `복구할 메뉴 카테고리가 없습니다.`,
  },
  20008040: {
    msg: `메뉴 카테고리 고유 식별키중에 올바르지 식별키가 존재합니다.`,
  },
  20008050: {
    msg: `메뉴 카테고리 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20008060: {
    msg: `메뉴 카테고리 고유 식별키중중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20008070: {
    msg: `메뉴 카테고리 고유 식별키가 올바르지 않습니다.`,
  },
  20008080: {
    msg: ``,
  },


  20008509: {
    msg: `부모 메뉴 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20008510: {
    msg: `부모 메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20008520: {
    msg: `부모 메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20008530: {
    msg: `부모 메뉴 고유 식별키로 조회된 메뉴가 없습니다.`,
  },
  20008540: {
    msg: `메뉴 카테고리 고유 식별키가 올바르지 않습니다.`,
  },
  20008550: {
    msg: `메뉴 카테고리 고유 식별키는 공백일 수 없습니다.`,
  },
  20008560: {
    msg: `메뉴 카테고리 고유 식별키는 20자 이어야 합니다.`,
  },
  20008570: {
    msg: `존재하지 않는 메뉴 카테고리입니다.`,
  },
  20008580: {
    msg: `메뉴명이 올바르지 않습니다.`,
  },
  20008590: {
    msg: `메뉴명은 공백이 될 수 없습니다.`,
  },
  20008600: {
    msg: `메뉴명은 50자를 넘을 수 없습니다.`,
  },
  20008609: {
    msg: `메뉴 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20008610: {
    msg: `메뉴 설명은 공백일 수 없습니다.`,
  },
  20008620: {
    msg: `메뉴 설명은 255자를 넘을 수 없습니다.`,
  },
  20008630: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20008640: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20008650: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20008660: {
    msg: ``,
  },
  

  20009010: {
    msg: `부모 메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20009020: {
    msg: `부모 메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20009030: {
    msg: `조회활 부모 메뉴 고유 식별키가 없습니다.`,
  },
  20009040: {
    msg: `부모 메뉴 고유 식별키중에서 올바르지 않은 식별키가 존재합니다.`,
  },
  20009050: {
    msg: `부모 메뉴 고유 식별키중에서 공백인 식별키가 존재합니다.`,
  },
  20009060: {
    msg: `부모 메뉴 고유 식별키중에서 20자가 아닌 식별키가 존재합니다.`,
  },
  20009070: {
    msg: `조회할 부모 메뉴명이 없습니다.`,
  },
  20009080: {
    msg: `부모 메뉴명중에 올바르지 않은 메뉴명이 존재합니다.`,
  },
  20009090: {
    msg: `메뉴 카테고리 고유 식별키는 공백일 수 없습니다.`,
  },
  20009100: {
    msg: `메뉴 카테고리 고유 식별키는 20자 이어야 합니다.`,
  },
  20009110: {
    msg: `조회할 메뉴 카테고리 고유 식별키가 없습니다.`,
  },
  20009120: {
    msg: `메뉴 카테고리 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20009130: {
    msg: `메뉴 카테고리 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20009140: {
    msg: `메뉴 카테고리 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20009150: {
    msg: `조회할 메뉴 카테고리명이 없습니다.`,
  },
  20009160: {
    msg: `메뉴 카테고리명중에 올바르지 않은 메뉴 카테고리명이 존재합니다.`,
  },
  20009170: {
    msg: `메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20009180: {
    msg: `메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20009190: {
    msg: `조회할 메뉴 고유 식별키가 없습니다.`,
  },
  20009200: {
    msg: `메뉴 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20009210: {
    msg: `메뉴 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20009220: {
    msg: `메뉴 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20009230: {
    msg: `조회할 메뉴명이 없습니다.`,
  },
  20009240: {
    msg: `메뉴명중에 올바르지 않은 메뉴명이 존재합니다.`,
  },
  20009250: {
    msg: `조회할 메뉴 설명이 없습니다.`,
  },
  20009260: {
    msg: `조회할 메뉴 설명중에 올바르지 않은 설명이 존재합니다.`,
  },
  20009270: {
    msg: `메뉴 등록일 시작일이 올바르지 않습니다.`,
  },
  20009280: {
    msg: `메뉴 등록일 종료일이 올바르지 않습니다.`,
  },
  20009290: {
    msg: `메뉴 수정일 시작일이 올바르지 않습니다.`,
  },
  20009300: {
    msg: `메뉴 수정일 종료일이 올바르지 않습니다.`,
  },
  20009310: {
    msg: `조회할 메뉴 상태가 없습니다.`,
  },
  20009320: {
    msg: `메뉴 상태중에 올바르지 않은 상태가 존재합니다.`,
  },
  20009330: {
    msg: ``,
  },


  20010010: {
    msg: `메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20010020: {
    msg: `메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20010030: {
    msg: `삭제할 메뉴 고유 식별키가 없습니다.`,
  },
  20010040: {
    msg: `메뉴 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20010050: {
    msg: `메뉴 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20010060: {
    msg: `메뉴 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20010070: {
    msg: `메뉴 식별키가 올바르지 않습니다.`,
  },
  20010080: {
    msg: ``,
  },


  20010510: {
    msg: `메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20010520: {
    msg: `메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20010530: {
    msg: `복구할 메뉴 고유 식별키가 없습니다.`,
  },
  20010540: {
    msg: `메뉴 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20010550: {
    msg: `메뉴 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20010560: {
    msg: `메뉴 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20010570: {
    msg: `메뉴 식별키가 올바르지 않습니다.`,
  },
  20010580: {
    msg: ``,
  },


  20011009: {
    msg: `부모 메뉴 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20011010: {
    msg: `부모 메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20011020: {
    msg: `부모 메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20011030: {
    msg: `부모 메뉴 고유 식별키는 등록되어 있지 않은 메뉴 입니다.`,
  },
  20011040: {
    msg: `메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20011050: {
    msg: `메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20011060: {
    msg: `수정할 메뉴 고유 식별키가 없습니다.`,
  },
  20011070: {
    msg: `메뉴 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20011080: {
    msg: `메뉴 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20011090: {
    msg: `메뉴 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20011100: {
    msg: `메뉴 고유 식별키가 올바르지 않습니다.`,
  },

  20011109: {
    msg: `메뉴 카테고리 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20011110: {
    msg: `메뉴 카테고리 고유 식별키는 공백일 수 없습니다.`,
  },
  20011120: {
    msg: `메뉴 카테고리 고유 식별키는 20자 이어야 합니다.`,
  },
  20011130: {
    msg: `메뉴 카테고리 고유 식별키는 등록되어 있지 않은 메뉴 카테고리 입니다.`,
  },
  20011139: {
    msg: `메뉴명에 유효하지 않은 값이 존재합니다.`,
  },
  20011140: {
    msg: `메뉴명은 공백일 수 없습니다.`,
  },
  20011150: {
    msg: `메뉴명은 50자를 넘을 수 없습니다.`,
  },
  20011159: {
    msg: `메뉴 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20011160: {
    msg: `메뉴 설명은 공백일 수 없습니다.`,
  },
  20011170: {
    msg: `메뉴 설명은 255자를 넘을 수 없습니다.`,
  },
  20011180: {
    msg: `메뉴 순서가 올바르지 않습니다.`,
  },
  20011190: {
    msg: `메뉴 순서가 올바르지 않습니다.`,
  },
  20011200: {
    msg: `메뉴 순서가 올바르지 않습니다.`,
  },
  20011209: {
    msg: `메뉴 상태에 유효하지 않은 값이 존재합니다.`,
  },
  20011210: {
    msg: `메뉴 상태는 공백일 수 없습니다.`,
  },
  20011220: {
    msg: `메뉴 상태는 13자 이어야 합니다.`,
  },
  20011230: {
    msg: `메뉴 상태가 유효한 코드가 아닙니다.`,
  },
  20011200: {
    msg: ``,
  },


  20011510: {
    msg: `메뉴 고유 식별키가 올바르지 않습니다.`,
  },
  20011520: {
    msg: `메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20011530: {
    msg: `메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20011540: {
    msg: `메뉴 고유 식별키로 등록된 메뉴가 존재하지 않습니다.`,
  },
  20011550: {
    msg: `권한명이 올바르지 않습니다.`,
  },
  20011560: {
    msg: `권한명은 공백일 수 없습니다.`,
  },
  20011570: {
    msg: `권한명은 255자를 넘을 수 없습니다.`,
  },
  20011579: {
    msg: `권한 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20011580: {
    msg: `권한 설명이 올바르지 않습니다.`,
  },
  20011590: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20011600: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20011610: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20011620: {
    msg: ``,
  },


  20012010: {
    msg: `메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20012020: {
    msg: `메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20012030: {
    msg: `조회할 메뉴 고유 식별키가 존재하지 않습니다.`,
  },
  20012040: {
    msg: `메뉴 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20012050: {
    msg: `메뉴 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20012060: {
    msg: `메뉴 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20012070: {
    msg: `조회할 메뉴명이 없습니다.`,
  },
  20012080: {
    msg: `조회할 메뉴명중에 올바르지 않은 메뉴명이 존재합니다.`,
  },
  20012090: {
    msg: `권한 고유 식별키는 공백일 수 없습니다.`,
  },
  20012100: {
    msg: `권한 고유 식별키는 20자 이어야 합니다.`,
  },
  20012110: {
    msg: `조회할 권한 고유 식별키가 없습니다.`,
  },
  20012120: {
    msg: `메뉴 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20012130: {
    msg: `메뉴 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20012140: {
    msg: `메뉴 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20012150: {
    msg: `조회할 권한명이 존재하지 않습니다.`,
  },
  20012160: {
    msg: `권한명중에 올바르지 않은 권한명이 존재합니다.`,
  },
  20012170: {
    msg: `조회할 권한 설명이 존재하지 않습니다.`,
  },
  20012180: {
    msg: `권한 설명중에 올바르지 않은 권한 설명이 존재합니다.`,
  },
  20012190: {
    msg: `등록일 기간 시작일이 올바르지 않습니다.`,
  },
  20012200: {
    msg: `등록일 기간 종료일이 올바르지 않습니다.`,
  },
  20012210: {
    msg: `조회할 등록시 IP가 존재하지 않습니다.`,
  },
  20012220: {
    msg: `등록시 IP중에 올바르지 않은 IP가 존재합니다.`,
  },
  20012230: {
    msg: `수정일 기간 시작일이 올바르지 않습니다.`,
  },
  20012240: {
    msg: `수정일 기간 종료일이 올바르지 않습니다.`,
  },
  20012250: {
    msg: `조회할 수정시 IP가 존재하지 않습니다.`,
  },
  20012260: {
    msg: `수정시 IP중에 올바르지 않은 IP가 존재합니다.`,
  },
  20012270: {
    msg: ``,
  },


  20012509: {
    msg: `메뉴 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20012510: {
    msg: `메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20012520: {
    msg: `메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20012530: {
    msg: `메뉴 고유 식별키가 유효한 값이 아닙니다.`,
  },
  20012540: {
    msg: `권한 고유 식별키가 올바르지 않습니다.`,
  },
  20012550: {
    msg: `권한 고유 식별키는 공백일 수 없습니다.`,
  },
  20012560: {
    msg: `권한 고유 식별키는 20자 이어야 합니다.`,
  },
  20012570: {
    msg: `권한 고유 식별키가 유효한 값이 아닙니다.`,
  },
  20012579: {
    msg: `권한명에 유효하지 않은 값이 존재합니다.`,
  },
  20012580: {
    msg: `권한명은 공백일 수 없습니다.`,
  },
  20012590: {
    msg: `권한명은 255자를 넘을 수 없습니다.`,
  },
  20012599: {
    msg: `권한 설명에 유효하지 않은 값이 존재합니다.`,  
  },
  20012600: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20012610: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20012620: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20012630: {
    msg: ``,
  },


  20013010: {
    msg: `권한 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20013020: {
    msg: `권한 고유 식별키는 공백일 수 없습니다.`,
  },
  20013030: {
    msg: `권한 고유 식별키는 20자 이어야 합니다.`,
  },
  20013040: {
    msg: `삭제 복구할 권한 고유 식별키가 존재하지 않습니다.`,
  },
  20013050: {
    msg: `권한 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20013060: {
    msg: `권한 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20013070: {
    msg: `권한 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20013080: {
    msg: ``,
  },


  20013510: {
    msg: `권한 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20013520: {
    msg: `권한 고유 식별키는 공백일 수 없습니다.`,
  },
  20013530: {
    msg: `권한 고유 식별키는 20자 이어야 합니다.`,
  },
  20013540: {
    msg: `삭제 복구할 권한 고유 식별키가 존재하지 않습니다.`,
  },
  20013550: {
    msg: `권한 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20013560: {
    msg: `권한 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20013570: {
    msg: `권한 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20013580: {
    msg: ``,
  },


  20014010: {
    msg: `권한 그룹명이 올바르지 않습니다.`,
  },
  20014020: {
    msg: `권한 그룹명은 공백일 수 없습니다.`,
  },
  20014030: {
    msg: `권한 그룹명은 100자를 넘을 수 없습니다.`,
  },
  20014040: {
    msg: `권한 그룹 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20014050: {
    msg: `권한 그룹 설명은 255자를 넘을 수 없습니다.`,
  },
  20014060: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20014070: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20014080: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20014090: {
    msg: ``,
  },


  20014510: {
    msg: `권한 그룹 고유 식별키가 올바르지 않습니다.`,
  },
  20014520: {
    msg: `권한 그룹 고유 식별키는 공백일 수 없습니다.`,
  },
  20014530: {
    msg: `권한 그룹 고유 식별키는 20자 이어야 합니다.`,
  },
  20014540: {
    msg: `권한 그룹명에 유효하지 않은 값이 존재합니다.`,
  },
  20014550: {
    msg: `권한 그룹명은 공백일 수 없습니다.`,
  },
  20014560: {
    msg: `권한 그룹명은 100자를 넘을 수 없습니다.`,
  },
  20014570: {
    msg: `권한 그룹 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20014580: {
    msg: `권한 그룹 설명은 255자를 넘을 수 없습니다.`,
  },
  20014590: {
    msg: `순서에 유효하지 않은 값이 존재합니다.`,
  },
  20014600: {
    msg: `권한 그룹 상태에 유효하지 않은 값이 존재합니다.`,
  },
  20014610: {
    msg: `권한 그룹 상태는 공백일 수 없습니다.`,
  },
  20014620: {
    msg: `권한 그룹 상태는 13자 이어야 합니다.`,
  },
  20014630: {
    msg: `권한 그룹 상태가 유효한 상태 코드가 아닙니다.`,
  },
  20014640: {
    msg: ``,
  },


  20015010: {
    msg: `권한 그룹 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20015020: {
    msg: `권한 그룹 고유 식별키는 공백일 수 없습니다.`,
  },
  20015030: {
    msg: `권한 그룹 고유 식별키는 20자 이어야 합니다.`,
  },
  20015040: {
    msg: `삭제할 권한 고유 그룹 식별키가 없습니다.`,
  },
  20015050: {
    msg: `권한 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20015060: {
    msg: `권한 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20015070: {
    msg: `권한 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20015080: {
    msg: ``,
  },


  20015510: {
    msg: `권한 그룹 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20015520: {
    msg: `권한 그룹 고유 식별키는 공백일 수 없습니다.`,
  },
  20015530: {
    msg: `권한 그룹 고유 식별키는 20자 이어야 합니다.`,
  },
  20015540: {
    msg: `복구할 권한 고유 그룹 식별키가 없습니다.`,
  },
  20015550: {
    msg: `권한 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20015560: {
    msg: `권한 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20015570: {
    msg: `권한 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20015580: {
    msg: ``,
  },


  20016010: {
    msg: `권한 그룹 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20016020: {
    msg: `권한 그룹 고유 식별키는 공백일 수 없습니다.`,
  },
  20016030: {
    msg: `권한 그룹 고유 식별키는 20자 이어야 합니다.`,
  },
  20016040: {
    msg: `권한 정보가 올바르지 않습니다.`,
  },
  20016050: {
    msg: `권한 정보가 없습니다.`,
  },
  20016060: {
    msg: `권한 그룹명이 올바르지 않습니다.`,
  },
  20016070: {
    msg: `권한 그룹명은 공백일 수 없습니다.`,
  },
  20016080: {
    msg: `권한 그룹명은 100자를 넘을 수 없습니다.`,
  },
  20016090: {
    msg: `권한 그룹 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20016100: {
    msg: `권한 그룹 설명은 255자를 넘을 수 없습니다.`,
  },
  20016110: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20016120: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20016130: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20016131: {
    msg: `권한 그룹 상태에 유효하지 않은 값이 존재합니다.`,
  },
  20016132: {
    msg: `권한 그룹 상태는 공백일 수 없습니다.`,
  },
  20016133: {
    msg: `권한 그룹 상태는 13자 이어야 합니다.`,
  },
  20016134: {
    msg: `권한 그룹 코드가 유효한 상태코드가 아닙니다.`,
  },
  20016140: {
    msg: `권한 그룹 정보 생성 및 업데이트에 실패하였습니다.`,
  },
  20016150: {
    msg: `등록되어 있지 않은 권한 그룹 고유 식별키 입니다.`,
  },
  20016160: {
    msg: ``,
  },


  20016510: {
    msg: `권한 그룹 고유 식별키가 올바르지 않습니다.`,
  },
  20016520: {
    msg: `권한 그룹 고유 식별키는 공백일 수 없습니다.`,
  },
  20016530: {
    msg: `권한 그룹 고유 식별키는 20자 이어야 합니다.`,
  },
  20016540: {
    msg: ``,
  },


  20017010: {
    msg: `회사 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20017020: {
    msg: `회사 고유 식별키는 공백일 수 없습니다.`,
  },
  20017030: {
    msg: `회사 고유 식별키는 20자 이어야 합니다.`,
  },
  20017040: {
    msg: `회사 고유 식별키가 유효한 식별키가 아닙니다.`,
  },
  20017050: {
    msg: `권한 그룹 고유 식별키가 올바르지 않습니다.`,
  },
  20017060: {
    msg: `권한 그룹 고유 식별키는 공백일 수 없습니다.`,
  },
  20017070: {
    msg: `권한 그룹 고유 식별키는 20자 이어야 합니다.`,
  },
  20017080: {
    msg: `권한 그룹 고유 식별키가 유효한 식별키가 아닙니다.`,
  },
  20017090: {
    msg: `회원 ID가 올바르지 않습니다.`,
  },
  20017100: {
    msg: `회원 ID는 공백일 수 없습니다.`,
  },
  20017110: {
    msg: `회원 ID는 숫자로만 구성될 수 없습니다.`,
  },
  20017120: {
    msg: `회원 ID는 영문 또는 숫자 조합만 허용됩니다.`,
  },
  20017130: {
    msg: `회원 ID는 50자를 넘을 수 없습니다.`,
  },
  20017140: {
    msg: `회원 비밀번호가 올바르지 않습니다.`,
  },
  20017150: {
    msg: `회원 비밀번호는 공백일 수 없습니다.`,
  },
  20017151: {
    msg: `회원 비밀번호는 최소 6자 이상이어야 합니다.`,
  },
  20017160: {
    msg: `회원명이 올바르지 않습니다.`,
  },
  20017170: {
    msg: `회원명은 공백일 수 없습니다.`,
  },
  20017180: {
    msg: `회원명은 50자를 넘을 수 없습니다.`,
  },
  20017190: {
    msg: `회원 휴대폰 번호에 유효하지 않은 값이 존재합니다.`,
  },
  20017200: {
    msg: `회원 휴대폰 번호는 공백일 수 없습니다.`,
  },
  20017210: {
    msg: `회원 휴대폰 번호는 15자를 넘을 수 없습니다.`,
  },
  20017220: {
    msg: `회원 메모에 유효하지 않은 값이 존재합니다.`,
  },
  20017230: {
    msg: `회원 상태가 올바르지 않습니다.`,
  },
  20017240: {
    msg: `회원 상태는 공백일 수 없습니다.`,
  },
  20017250: {
    msg: `회원 상태는 13자 이어야 합니다.`,
  },
  20017260: {
    msg: `회원 상태가 유효한 상태 코드가 아닙니다.`,
  },
  20017270: {
    msg: ``,
  },
  20017280: {
    msg: ``,
  },
  20017290: {
    msg: ``,
  },
  20017300: {
    msg: ``,
  },


  20018010: {
    msg: `회원 아이디를 입력해주세요.`,
  },
  20018020: {
    msg: `회원 아이디를 입력해주세요.`,
  },
  20018030: {
    msg: `회원 아이디는 50자를 넘을 수 없습니다.`,
  },
  20018040: {
    msg: `회원 비밀번호를 입력해주세요.`,
  },
  20018050: {
    msg: `회원 비밀번호를 입력해주세요.`,
  },
  20018060: {
    msg: `가입된 정보가 없습니다.`,
  },
  20018070: {
    msg: `회원 상태가 정상이 아닙니다. 관리자에 문의해주세요.`,
  },
  20018080: {
    msg: ``,
  },
  20018090: {
    msg: ``,
  },


  20018510: {
    msg: `수정 대상의 회원 정보가 올바르지 않습니다.`,
  },
  20018520: {
    msg: `수정 대상의 회원 정보가 없습니다.`,
  },
  20018530: {
    msg: `수정 대상의 회원 정보가 유효하지 않습니다.`,
  },
  20018540: {
    msg: `수정 대상의 회원 정보가 없습니다.`,
  },
  20018550: {
    msg: `수정 대상의 회원 정보중에 올바르지 않은 정보가 존재합니다.`,
  },
  20018560: {
    msg: `수정 대상의 회원 정보중에 정보가 없는 것이 존재합니다.`,
  },
  20018570: {
    msg: `수정 대상의 회원 정보중에 올바르지 않은 정보가 존재합니다.`,
  },
  20018580: {
    msg: `회사 정보가 유효하지 않습니다.`,
  },
  20018590: {
    msg: `회사 정보가 올바르지 않습니다.`,
  },
  20018600: {
    msg: `회사 정보가 올바르지 않습니다.`,
  },
  20018610: {
    msg: `회사 정보가 유효하지 않습니다.`,
  },
  20018620: {
    msg: `권한 그룹이 올바르지 않습니다.`,
  },
  20018630: {
    msg: `권한 그룹이 올바르지 않습니다.`,
  },
  20018640: {
    msg: `권한 그룹이 올바르지 않습니다.`,
  },
  20018650: {
    msg: `권한 그룹이 유효하지 않습니다.`,
  },
  20018660: {
    msg: `회원 비밀번호가 올바르지 않습니다.`,
  },
  20018670: {
    msg: `회원 비밀번호를 입력해주세요.`,
  },
  20018680: {
    msg: `회원 비밀번호는 6자 이상이어야 합니다.`,
  },
  20018690: {
    msg: `회원명이 올바르지 않습니다.`,
  },
  20018700: {
    msg: `회원명을 입력해주세요.`,
  },
  20018710: {
    msg: `회원명은 50자를 넘길 수 없습니다.`,
  },
  20018720: {
    msg: `회원 휴대폰 번호가 올바르지 않습니다.`,
  },
  20018730: {
    msg: `회원 휴대폰 번호를 입력해주세요.`,
  },
  20018740: {
    msg: `회원 휴대폰 번호는 15자를 넘길 수 없습니다.`,
  },
  20018750: {
    msg: `회원 메모가 올바르지 않습니다.`,
  },
  20018760: {
    msg: `회원 상태가 올바르지 않습니다.`,
  },
  20018770: {
    msg: `회원 상태를 선택해주세요.`,
  },
  20018780: {
    msg: `회원 상태가 올바르지 않습니다.`,
  },
  20018790: {
    msg: `회원 상태가 유효하지 않습니다.`,
  },
  20018800: {
    msg: ``,
  },


  20019510: {
    msg: `삭제 대상의 회원 정보가 올바르지 않습니다.`,
  },
  20019520: {
    msg: `삭제 대상의 회원 정보가 없습니다.`,
  },
  20019530: {
    msg: `삭제 대상의 회원 정보가 유효하지 않습니다.`,
  },
  20019540: {
    msg: `삭제 대상의 회원 정보가 없습니다.`,
  },
  20019550: {
    msg: `삭제 대상의 회원 정보중에 올바르지 않은 정보가 존재합니다.`,
  },
  20019560: {
    msg: `삭제 대상의 회원 정보중에 정보가 없는 것이 존재합니다.`,
  },
  20019570: {
    msg: `삭제 대상의 회원 정보중에 올바르지 않은 정보가 존재합니다.`,
  },
  20019580: {
    msg: ``,
  },


  20020010: {
    msg: `복구 대상의 회원 정보가 올바르지 않습니다.`,
  },
  20020020: {
    msg: `복구 대상의 회원 정보가 없습니다.`,
  },
  20020030: {
    msg: `복구 대상의 회원 정보가 유효하지 않습니다.`,
  },
  20020040: {
    msg: `복구 대상의 회원 정보가 없습니다.`,
  },
  20020050: {
    msg: `복구 대상의 회원 정보중에 올바르지 않은 정보가 존재합니다.`,
  },
  20020060: {
    msg: `복구 대상의 회원 정보중에 정보가 없는 것이 존재합니다.`,
  },
  20020070: {
    msg: `복구 대상의 회원 정보중에 올바르지 않은 정보가 존재합니다.`,
  },
  20020080: {
    msg: ``,
  },


  20020510: {
    msg: `회사명을 입력해주세요.`,
  },
  20020520: {
    msg: `회사명을 입력해주세요.`,
  },
  20020530: {
    msg: `회사명은 100자를 넘을 수 없습니다.`,
  },
  20020540: {
    msg: `회사 대표자명에 유효하지 않은 값이 존재합니다.`,
  },
  20020550: {
    msg: `회사 대표자명을 입력해주세요.`,
  },
  20020560: {
    msg: `회사 대표자명을 100자를 넘을 수 없습니다.`,
  },
  20020570: {
    msg: `회사 대표자의 연락처에 유효하지 않은 값이 존재합니다.`,
  },
  20020580: {
    msg: `회사 대표자의 연락처를 입력해주세요.`,
  },
  20020590: {
    msg: `회사 대표자의 연락처는 15자를 넘을 수 없습니다.`,
  },
  20020600: {
    msg: `회사대표번호에 유효하지 않은 값이 존재합니다.`,
  },
  20020610: {
    msg: `회사대표번호를 입력해주세요.`,
  },
  20020620: {
    msg: `회사대표번호는 15자를 넘을 수 없습니다.`,
  },
  20020630: {
    msg: `사업자번호에 유효하지 않은 값이 존재합니다.`,
  },
  20020640: {
    msg: `사업자번호를 입력해주세요.`,
  },
  20020650: {
    msg: `사업자번호는 15자를 넘을 수 없습니다.`,
  },
  20020660: {
    msg: `사업장주소에 유효하지 않은 값이 존재합니다.`,
  },
  20020670: {
    msg: `사업장주소를 입력해주세요.`,
  },
  20020680: {
    msg: `사업장주소는 150자를 넘을 수 없습니다.`,
  },
  20020690: {
    msg: `회사 메모에 유효하지 않은 값이 존재합니다.`,
  },
  20020700: {
    msg: `회사 메모를 입력해주세요.`,
  },
  20020710: {
    msg: `회사 상태를 선택해주세요.`,
  },
  20020720: {
    msg: `회사 상태를 선택해주세요.`,
  },
  20020730: {
    msg: `회사 상태 값이 올바르지 않습니다.`,
  },
  20020740: {
    msg: `회사 상태 값이 유효하지 않습니다.`,
  },
  20020750: {
    msg: ``,
  },


  20021010: {
    msg: `수정 대상의 회사 정보가 없습니다.`,
  },
  20021020: {
    msg: `수정 대상의 회사 정보가 없습니다.`,
  },
  20021030: {
    msg: `수정 대상의 회사 정보가 올바르지 않습니다.`,
  },
  20021040: {
    msg: `수정 대상의 회사 정보가 유효하지 않습니다.`,
  },
  20021050: {
    msg: `수정 대상의 회사들의 정보가 없습니다.`,
  },
  20021060: {
    msg: `수정 대상의 회사들의 정보중 올바르지 않은 회사 정보가 존재합니다.`,
  },
  20021070: {
    msg: `수정 대상의 회사들의 정보중 올바르지 않은 회사 정보가 존재합니다.`,
  },
  20021080: {
    msg: `수정 대상의 회사들의 정보중 올바르지 않은 회사 정보가 존재합니다.`,
  },
  20021090: {
    msg: `수정 대상의 회사들의 정보중 유효하지 않은 정보가 존재합니다.`,
  },
  20021100: {
    msg: `회사명에 유효하지 않은 값이 존재합니다.`,
  },
  20021110: {
    msg: `회사명을 입력해주세요.`,
  },
  20021120: {
    msg: `회사명은 100자를 넘을 수 없습니다.`,
  },
  20021130: {
    msg: `회사 대표자명에 유효하지 않은 값이 존재합니다.`,
  },
  20021140: {
    msg: `회사 대표자명을 입력해주세요.`,
  },
  20021150: {
    msg: `회사 대표자명은 100자를 넘을 수 없습니다.`,
  },
  20021160: {
    msg: `회사 대표자의 연락처에 유효하지 않은 값이 존재합니다.`,
  },
  20021170: {
    msg: `회사 대표자의 연락처를 입력해주세요.`,
  },
  20021180: {
    msg: `회사 대표자의 연락처는 15자를 넘을 수 없습니다.`,
  },
  20021190: {
    msg: `회사대표번호에 유효하지 않은 값이 존재합니다.`,
  },
  20021200: {
    msg: `회사대표번호를 입력해주세요.`,
  },
  20021210: {
    msg: `회사대표번호는 15자를 넘을 수 없습니다.`,
  },
  20021220: {
    msg: `사업자번호에 유효하지 않은 값이 존재합니다.`,
  },
  20021230: {
    msg: `사업자번호를 입력해주세요.`,
  },
  20021240: {
    msg: `사업자번호는 15자를 넘을 수 없습니다.`,
  },
  20021250: {
    msg: `사업장주소에 유효하지 않은 값이 존재합니다.`,
  },
  20021260: {
    msg: `사업장주소를 입력해주세요.`,
  },
  20021270: {
    msg: `사업장주소는 150자를 넘을 수 없습니다.`,
  },
  20021280: {
    msg: `메모에 유효하지 않은 값이 존재합니다.`,
  },
  20021290: {
    msg: `메모를 입력해주세요.`,
  },
  20021300: {
    msg: `회사 상태가 올바르지 않습니다.`,
  },
  20021310: {
    msg: `회사 상태를 선택해주세요.`,
  },
  20021320: {
    msg: `회사 상태가 유효하지 않습니다.`,
  },
  20021330: {
    msg: `회사 상태가 유효한 코드가 아닙니다.`,
  },
  20021340: {
    msg: ``,
  },


  20022010: {
    msg: `삭제 대상의 회사 정보가 없습니다.`,
  },
  20022020: {
    msg: `삭제 대상의 회사 정보가 없습니다.`,
  },
  20022030: {
    msg: `삭제 대상의 회사 정보가 올바르지 않습니다.`,
  },
  20022040: {
    msg: `삭제 대상의 회사 정보가 유효하지 않습니다.`,
  },
  20022050: {
    msg: `삭제하려는 회사는 이미 삭제된 상태입니다.`,
  },
  20022060: {
    msg: `삭제하려는 회사들의 정보가 없습니다.`,
  },
  20022070: {
    msg: `삭제하려는 회사들의 정보중에 올바르지 않은 정보가 존재합니다.`,
  },
  20022080: {
    msg: `삭제하려는 회사들의 정보중에 올바르지 않은 정보가 존재합니다.`,
  },
  20022090: {
    msg: `삭제하려는 회사들의 정보중에 올바르지 않은 정보가 존재합니다.`,
  },
  20022100: {
    msg: `삭제하려는 회사들의 정보중에 이미 삭제된 회사 정보가 존재합니다.`,
  },
  20022110: {
    msg: ``,
  },
};

module.exports = myResultCode;
