
const myResultCode = {
  00000000: {
    msg: `미정의`,
  },


  20001010: {
    msg: `로그인 상태가 만료되었습니다.`,
  },
  20001011: {
    msg: `로그인 상태가 만료되었습니다.`,
  },
  20001012: {
    msg: `로그인 상태가 만료되었습니다.`,
  },
  20001013: {
    msg: `로그인 상태가 만료되었습니다.`,
  },
  20001014: {
    msg: `로그인 상태를 갱신하였습니다.`,
  },


  20001509: {
    msg: `코드그룹이 올바르지 않습니다.`,
  },
  20001510: {
    msg: `이미 존재하는 코드그룹으로 요청하셨습니다.`,
  },
  20001520: {
    msg: `코드그룹명이 올바르지 않습니다.`,
  },
  20001530: {
    msg: `코드그룹명은 공백일 수 없습니다.`,
  },
  20001540: {
    msg: `코드그룹명은 100자를 넘을 수 없습니다.`,
  },
  20001550: {
    msg: `코드 그룹 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20001590: {
    msg: `코드그룹은 공백일 수 없습니다.`,
  },
  20001600: {
    msg: `코드그룹은 5자이어야 합니다.`,
  },


  20002010: {
    msg: `코드그룹이 올바르지 않습니다.`,
  },
  20002020: {
    msg: `등록되지 않은 코드그룹으로 요청하셨습니다.`,
  },
  20002030: {
    msg: `코드가 올바르지 않습니다.`,
  },
  20002040: {
    msg: `코드는 공백일 수 없습니다.`,
  },
  20002050: {
    msg: `코드는 13자이어야 합니다.`,
  },
  20002055: {
    msg: `이미 등록된 코드 입니다.`,
  },
  20002060: {
    msg: `코드명이 올바르지 않습니다.`,
  },
  20002070: {
    msg: `코드명은 공백일 수 없습니다.`,
  },
  20002080: {
    msg: `코드명은 50자를 넘을 수 없습니다.`,
  },
  20002089: {
    msg: `코드 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20002090: {
    msg: `코드 설명은 공백이 될 수 없습니다.`,
  },
  20002100: {
    msg: `코드 설명은 100자를 넘을 수 없습니다.`,
  },
  20002109: {
    msg: `코드 필요값 1에 유효하지 않은 값이 존재합니다.`,
  },
  20002110: {
    msg: `코드 필요값 1은 공백일 수 없습니다.`,
  },
  20002120: {
    msg: `코드 필요값 1은 100자를 넘을 수 없습니다.`,
  },
  20002129: {
    msg: `코드 필요값 2에 유효하지 않은 값이 존재합니다.`,
  },
  20002130: {
    msg: `코드 필요값 2는 공백일 수 없습니다.`,
  },
  20002140: {
    msg: `코드 필요값 2는 100자를 넘을 수 없습니다.`,
  },


  20002510: {
    msg: `코드가 올바르지 않습니다.`,
  },
  20002520: {
    msg: `코드는 공백일 수 없습니다.`,
  },
  20002530: {
    msg: `코드 길이는 13자이어야 합니다.`,
  },
  20002540: {
    msg: `코드가 존재하지 않습니다.`,
  },
  20002550: {
    msg: `코드명이 올바르지 않습니다.`,
  },
  20002559: {
    msg: `코드명에 유효하지 않은 값이 존재합니다.`,
  },
  20002560: {
    msg: `코드명은 공백일 수 없습니다.`,
  },
  20002570: {
    msg: `코드명은 50자를 넘을 수 없습니다.`,
  },
  20002579: {
    msg: `코드설명에 유효하지 않은 값이 존재합니다.`,
  },
  20002580: {
    msg: `코드설명이 올바르지 않습니다.`,
  },
  20002590: {
    msg: `코드설명은 100자를 넘을 수 없습니다.`,
  },
  20002659: {
    msg: `코드 필요값1에 유효하지 않은 값이 존재합니다.`,
  },
  20002600: {
    msg: `코드 필요값1이 올바르지 않습니다.`,
  },
  20002610: {
    msg: `코드 필요값1은 100자를 넘을 수 없습니다.`,
  },
  20002619: {
    msg: `코드 필요값2에 유효하지 않은 값이 존재합니다.`,
  },
  20002620: {
    msg: `코드 필요값2가 올바르지 않습니다.`,
  },
  20002630: {
    msg: `코드 필요값2는 100자를 넘을 수 없습니다.`,
  },


  20003010: {
    msg: `코드는 공백일 수 없습니다.`,
  },
  20003020: {
    msg: `코드는 13자이어야 합니다.`,
  },
  20003030: {
    msg: `수정할 코드가 없습니다.`,
  },
  20003040: {
    msg: `코드 중에 올바르지 않은 코드가 존재합니다.`,
  },
  20003050: {
    msg: `코드 중에 공백인 코드가 존재합니다.`,
  },
  20003060: {
    msg: `코드 중에 13자가 아닌 코드가 존재합니다.`,
  },
  20003070: {
    msg: `코드가 올바르지 않습니다.`,
  },
  20003080: {
    msg: ``,
  },



  20003510: {
    msg: `코드는 공백일 수 없습니다.`,
  },
  20003520: {
    msg: `코드는 13자이어야 합니다.`,
  },
  20003530: {
    msg: `복구할 코드가 없습니다.`,
  },
  20003540: {
    msg: `코드 중에 올바르지 않은 코드가 존재합니다.`,
  },
  20003550: {
    msg: `코드 중에 공백인 코드가 존재합니다.`,
  },
  20003560: {
    msg: `코드 중에 13자가 아닌 코드가 존재합니다.`,
  },
  20003570: {
    msg: `코드가 올바르지 않습니다.`,
  },
  20003580: {
    msg: ``,
  },



  20004010: {
    msg: `코드 그룹은 공백일 수 없습니다.`,
  },
  20004020: {
    msg: `코드 그룹은 5자이어야 합니다.`,
  },
  20004030: {
    msg: `조회할 코드 그룹이 없습니다.`,
  },
  20004040: {
    msg: `코드 그룹중에 올바르지 않은 코드 그룹이 존재합니다.`,
  },
  20004050: {
    msg: `코드 그룹중에 공백인 코드 그룹이 존재합니다.`,
  },
  20004060: {
    msg: `코드 그룹중에 5자가 아닌 코드 그룹이 존재합니다.`,
  },
  20004070: {
    msg: `코드그룹이 올바르지 않습니다.`,
  },
  20004080: {
    msg: ``,
  },



  20004510: {
    msg: `코드 그룹이 올바르지 않습니다.`,
  },
  20004520: {
    msg: `코드 그룹은 공백일 수 없습니다.`,
  },
  20004530: {
    msg: `코드 그룹은 5자이어야 합니다.`,
  },
  20004540: {
    msg: `등록 되지 않은 코드 그룹으로 요청하셨습니다.`,
  },
  20004550: {
    msg: `코드 그룹명이 올바르지 않습니다.`,
  },
  20004559: {
    msg: `코드 그룹명에 유효하지 않은 값이 존재합니다.`,
  },
  20004560: {
    msg: `코드 그룹명은 공백일 수 없습니다.`,
  },
  20004570: {
    msg: `코드 그룹명은 100자를 넘을 수 없습니다.`,
  },
  20004580: {
    msg: `코드 그룹 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20004590: {
    msg: `코드 그룹 설명은 100자를 넘을 수 없습니다.`,
  },
  20004600: {
    msg: ``,
  },


  20005010: {
    msg: `코드 그룹명은 공백일 수 없습니다.`,
  },
  20005020: {
    msg: `코드 그룹명은 5자이어야 합니다.`,
  },
  20005030: {
    msg: `삭제할 코드 그룹이 없습니다.`,
  },
  20005040: {
    msg: `코그 그룹중에 올바르지 않은 코드 그룹이 존재합니다.`,
  },
  20005050: {
    msg: `코드 그룹중에 공백인 코드 그룹이 존재합니다.`,
  },
  20005060: {
    msg: `코드 그룹중에 5자가 아닌 코드 그룹이 존재합니다.`,
  },
  20005070: {
    msg: `코드 그룹이 올바르지 않습니다.`,
  },


  20005510: {
    msg: `코드 그룹명은 공백일 수 없습니다.`,
  },
  20005520: {
    msg: `코드 그룹명은 5자이어야 합니다.`,
  },
  20005530: {
    msg: `삭제할 코드 그룹이 없습니다.`,
  },
  20005540: {
    msg: `코그 그룹중에 올바르지 않은 코드 그룹이 존재합니다.`,
  },
  20005550: {
    msg: `코드 그룹중에 공백인 코드 그룹이 존재합니다.`,
  },
  20005560: {
    msg: `코드 그룹중에 5자가 아닌 코드 그룹이 존재합니다.`,
  },
  20005570: {
    msg: `코드 그룹이 올바르지 않습니다.`,
  },


  20006010: {
    msg: `메뉴 카테고리명이 올바르지 않습니다.`,
  },
  20006020: {
    msg: `메뉴 카테고리명은 공백일 수 없습니다.`,
  },
  20006030: {
    msg: `메뉴 카테고리명은 50자를 넘을 수 없습니다.`,
  },
  20006039: {
    msg: `메뉴 카테고리 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20006040: {
    msg: `메뉴 카테고리 설명은 공백일 수 없습니다.`,
  },
  20006050: {
    msg: `메뉴 카테고리 설명은 255자를 넘을 수 없습니다.`,
  },
  20006060: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20006070: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20006080: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20006090: {
    msg: ``,
  },


  20006510: {
    msg: `등록일 시작 날짜가 올바르지 않습니다.`,
  },
  20006520: {
    msg: `등록일 종료 날짜가 올바르지 않습니다.`,
  },


  20007010: {
    msg: `메뉴카테고리 고유 식별키가 올바르지 않습니다.`,
  },
  20007020: {
    msg: `메뉴카테고리 고유 식별키는 공백일 수 없습니다.`,
  },
  20007030: {
    msg: `존재하지 않는 메뉴카테고리의 수정을 요청하였습니다.`,
  },
  20007039: {
    msg: `메뉴 카테고리명에 유효하지 않은 값이 존재합니다.`,
  },
  20007040: {
    msg: `메뉴 카테고리명이 올바르지 않습니다.`,
  },
  20007050: {
    msg: `메뉴 카테고리명은 공백일 수 없습니다.`,
  },
  20007059: {
    msg: `메뉴 카테고리 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20007060: {
    msg: `메뉴 카테고리 설명이 올바르지 않습니다.`,
  },
  20007070: {
    msg: `메뉴 카테고리 설명은 공백일 수 없습니다.`,
  },
  20007080: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20007090: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20007100: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20007110: {
    msg: `메뉴 카테고리 상태가 올바르지 않습니다.`,
  },
  20007120: {
    msg: `메뉴 카테고리 상태는 공백일 수 없습니다.`,
  },
  20007130: {
    msg: `메뉴 카테고리 상태의 형식이 올바르지 않습니다.`,
  },
  20007140: {
    msg: `메뉴 카테고리 상태가 유효하지 않습니다.`,
  },


  20007510: {
    msg: `메뉴 카테고리 고유 식별키는 공백일 수 없습니다.`,
  },
  20007520: {
    msg: `메뉴 카테고리 고유 식별키는 20자이어야 합니다.`,
  },
  20007530: {
    msg: `삭제할 메뉴 카테고리가 없습니다.`,
  },
  20007540: {
    msg: `메뉴 카테고리 고유 식별키중에 올바르지 식별키가 존재합니다.`,
  },
  20007550: {
    msg: `메뉴 카테고리 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20007560: {
    msg: `메뉴 카테고리 고유 식별키중중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20007570: {
    msg: `메뉴 카테고리 고유 식별키가 올바르지 않습니다.`,
  },
  20007580: {
    msg: ``,
  },


  20008010: {
    msg: `메뉴 카테고리 고유 식별키는 공백일 수 없습니다.`,
  },
  20008020: {
    msg: `메뉴 카테고리 고유 식별키는 20자이어야 합니다.`,
  },
  20008030: {
    msg: `복구할 메뉴 카테고리가 없습니다.`,
  },
  20008040: {
    msg: `메뉴 카테고리 고유 식별키중에 올바르지 식별키가 존재합니다.`,
  },
  20008050: {
    msg: `메뉴 카테고리 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20008060: {
    msg: `메뉴 카테고리 고유 식별키중중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20008070: {
    msg: `메뉴 카테고리 고유 식별키가 올바르지 않습니다.`,
  },
  20008080: {
    msg: ``,
  },


  20008509: {
    msg: `부모 메뉴 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20008510: {
    msg: `부모 메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20008520: {
    msg: `부모 메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20008530: {
    msg: `부모 메뉴 고유 식별키로 조회된 메뉴가 없습니다.`,
  },
  20008540: {
    msg: `메뉴 카테고리 고유 식별키가 올바르지 않습니다.`,
  },
  20008550: {
    msg: `메뉴 카테고리 고유 식별키는 공백일 수 없습니다.`,
  },
  20008560: {
    msg: `메뉴 카테고리 고유 식별키는 20자 이어야 합니다.`,
  },
  20008570: {
    msg: `존재하지 않는 메뉴 카테고리입니다.`,
  },
  20008580: {
    msg: `메뉴명이 올바르지 않습니다.`,
  },
  20008590: {
    msg: `메뉴명은 공백이 될 수 없습니다.`,
  },
  20008600: {
    msg: `메뉴명은 50자를 넘을 수 없습니다.`,
  },
  20008609: {
    msg: `메뉴 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20008610: {
    msg: `메뉴 설명은 공백일 수 없습니다.`,
  },
  20008620: {
    msg: `메뉴 설명은 255자를 넘을 수 없습니다.`,
  },
  20008630: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20008640: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20008650: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20008660: {
    msg: ``,
  },
  

  20009010: {
    msg: `부모 메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20009020: {
    msg: `부모 메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20009030: {
    msg: `조회활 부모 메뉴 고유 식별키가 없습니다.`,
  },
  20009040: {
    msg: `부모 메뉴 고유 식별키중에서 올바르지 않은 식별키가 존재합니다.`,
  },
  20009050: {
    msg: `부모 메뉴 고유 식별키중에서 공백인 식별키가 존재합니다.`,
  },
  20009060: {
    msg: `부모 메뉴 고유 식별키중에서 20자가 아닌 식별키가 존재합니다.`,
  },
  20009070: {
    msg: `조회할 부모 메뉴명이 없습니다.`,
  },
  20009080: {
    msg: `부모 메뉴명중에 올바르지 않은 메뉴명이 존재합니다.`,
  },
  20009090: {
    msg: `메뉴 카테고리 고유 식별키는 공백일 수 없습니다.`,
  },
  20009100: {
    msg: `메뉴 카테고리 고유 식별키는 20자 이어야 합니다.`,
  },
  20009110: {
    msg: `조회할 메뉴 카테고리 고유 식별키가 없습니다.`,
  },
  20009120: {
    msg: `메뉴 카테고리 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20009130: {
    msg: `메뉴 카테고리 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20009140: {
    msg: `메뉴 카테고리 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20009150: {
    msg: `조회할 메뉴 카테고리명이 없습니다.`,
  },
  20009160: {
    msg: `메뉴 카테고리명중에 올바르지 않은 메뉴 카테고리명이 존재합니다.`,
  },
  20009170: {
    msg: `메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20009180: {
    msg: `메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20009190: {
    msg: `조회할 메뉴 고유 식별키가 없습니다.`,
  },
  20009200: {
    msg: `메뉴 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20009210: {
    msg: `메뉴 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20009220: {
    msg: `메뉴 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20009230: {
    msg: `조회할 메뉴명이 없습니다.`,
  },
  20009240: {
    msg: `메뉴명중에 올바르지 않은 메뉴명이 존재합니다.`,
  },
  20009250: {
    msg: `조회할 메뉴 설명이 없습니다.`,
  },
  20009260: {
    msg: `조회할 메뉴 설명중에 올바르지 않은 설명이 존재합니다.`,
  },
  20009270: {
    msg: `메뉴 등록일 시작일이 올바르지 않습니다.`,
  },
  20009280: {
    msg: `메뉴 등록일 종료일이 올바르지 않습니다.`,
  },
  20009290: {
    msg: `메뉴 수정일 시작일이 올바르지 않습니다.`,
  },
  20009300: {
    msg: `메뉴 수정일 종료일이 올바르지 않습니다.`,
  },
  20009310: {
    msg: `조회할 메뉴 상태가 없습니다.`,
  },
  20009320: {
    msg: `메뉴 상태중에 올바르지 않은 상태가 존재합니다.`,
  },
  20009330: {
    msg: ``,
  },


  20010010: {
    msg: `메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20010020: {
    msg: `메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20010030: {
    msg: `삭제할 메뉴 고유 식별키가 없습니다.`,
  },
  20010040: {
    msg: `메뉴 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20010050: {
    msg: `메뉴 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20010060: {
    msg: `메뉴 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20010070: {
    msg: `메뉴 식별키가 올바르지 않습니다.`,
  },
  20010080: {
    msg: ``,
  },


  20010510: {
    msg: `메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20010520: {
    msg: `메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20010530: {
    msg: `복구할 메뉴 고유 식별키가 없습니다.`,
  },
  20010540: {
    msg: `메뉴 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20010550: {
    msg: `메뉴 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20010560: {
    msg: `메뉴 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20010570: {
    msg: `메뉴 식별키가 올바르지 않습니다.`,
  },
  20010580: {
    msg: ``,
  },


  20011009: {
    msg: `부모 메뉴 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20011010: {
    msg: `부모 메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20011020: {
    msg: `부모 메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20011030: {
    msg: `부모 메뉴 고유 식별키는 등록되어 있지 않은 메뉴 입니다.`,
  },
  20011040: {
    msg: `메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20011050: {
    msg: `메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20011060: {
    msg: `수정할 메뉴 고유 식별키가 없습니다.`,
  },
  20011070: {
    msg: `메뉴 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20011080: {
    msg: `메뉴 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20011090: {
    msg: `메뉴 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20011100: {
    msg: `메뉴 고유 식별키가 올바르지 않습니다.`,
  },

  20011109: {
    msg: `메뉴 카테고리 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20011110: {
    msg: `메뉴 카테고리 고유 식별키는 공백일 수 없습니다.`,
  },
  20011120: {
    msg: `메뉴 카테고리 고유 식별키는 20자 이어야 합니다.`,
  },
  20011130: {
    msg: `메뉴 카테고리 고유 식별키는 등록되어 있지 않은 메뉴 카테고리 입니다.`,
  },
  20011139: {
    msg: `메뉴명에 유효하지 않은 값이 존재합니다.`,
  },
  20011140: {
    msg: `메뉴명은 공백일 수 없습니다.`,
  },
  20011150: {
    msg: `메뉴명은 50자를 넘을 수 없습니다.`,
  },
  20011159: {
    msg: `메뉴 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20011160: {
    msg: `메뉴 설명은 공백일 수 없습니다.`,
  },
  20011170: {
    msg: `메뉴 설명은 255자를 넘을 수 없습니다.`,
  },
  20011180: {
    msg: `메뉴 순서가 올바르지 않습니다.`,
  },
  20011190: {
    msg: `메뉴 순서가 올바르지 않습니다.`,
  },
  20011200: {
    msg: `메뉴 순서가 올바르지 않습니다.`,
  },
  20011209: {
    msg: `메뉴 상태에 유효하지 않은 값이 존재합니다.`,
  },
  20011210: {
    msg: `메뉴 상태는 공백일 수 없습니다.`,
  },
  20011220: {
    msg: `메뉴 상태는 13자 이어야 합니다.`,
  },
  20011230: {
    msg: `메뉴 상태가 유효한 코드가 아닙니다.`,
  },
  20011200: {
    msg: ``,
  },


  20011510: {
    msg: `메뉴 고유 식별키가 올바르지 않습니다.`,
  },
  20011520: {
    msg: `메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20011530: {
    msg: `메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20011540: {
    msg: `메뉴 고유 식별키로 등록된 메뉴가 존재하지 않습니다.`,
  },
  20011550: {
    msg: `권한명이 올바르지 않습니다.`,
  },
  20011560: {
    msg: `권한명은 공백일 수 없습니다.`,
  },
  20011570: {
    msg: `권한명은 255자를 넘을 수 없습니다.`,
  },
  20011579: {
    msg: `권한 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20011580: {
    msg: `권한 설명이 올바르지 않습니다.`,
  },
  20011590: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20011600: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20011610: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20011620: {
    msg: ``,
  },


  20012010: {
    msg: `메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20012020: {
    msg: `메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20012030: {
    msg: `조회할 메뉴 고유 식별키가 존재하지 않습니다.`,
  },
  20012040: {
    msg: `메뉴 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20012050: {
    msg: `메뉴 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20012060: {
    msg: `메뉴 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20012070: {
    msg: `조회할 메뉴명이 없습니다.`,
  },
  20012080: {
    msg: `조회할 메뉴명중에 올바르지 않은 메뉴명이 존재합니다.`,
  },
  20012090: {
    msg: `권한 고유 식별키는 공백일 수 없습니다.`,
  },
  20012100: {
    msg: `권한 고유 식별키는 20자 이어야 합니다.`,
  },
  20012110: {
    msg: `조회할 권한 고유 식별키가 없습니다.`,
  },
  20012120: {
    msg: `메뉴 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20012130: {
    msg: `메뉴 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20012140: {
    msg: `메뉴 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20012150: {
    msg: `조회할 권한명이 존재하지 않습니다.`,
  },
  20012160: {
    msg: `권한명중에 올바르지 않은 권한명이 존재합니다.`,
  },
  20012170: {
    msg: `조회할 권한 설명이 존재하지 않습니다.`,
  },
  20012180: {
    msg: `권한 설명중에 올바르지 않은 권한 설명이 존재합니다.`,
  },
  20012190: {
    msg: `등록일 기간 시작일이 올바르지 않습니다.`,
  },
  20012200: {
    msg: `등록일 기간 종료일이 올바르지 않습니다.`,
  },
  20012210: {
    msg: `조회할 등록시 IP가 존재하지 않습니다.`,
  },
  20012220: {
    msg: `등록시 IP중에 올바르지 않은 IP가 존재합니다.`,
  },
  20012230: {
    msg: `수정일 기간 시작일이 올바르지 않습니다.`,
  },
  20012240: {
    msg: `수정일 기간 종료일이 올바르지 않습니다.`,
  },
  20012250: {
    msg: `조회할 수정시 IP가 존재하지 않습니다.`,
  },
  20012260: {
    msg: `수정시 IP중에 올바르지 않은 IP가 존재합니다.`,
  },
  20012270: {
    msg: ``,
  },


  20012509: {
    msg: `메뉴 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20012510: {
    msg: `메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20012520: {
    msg: `메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20012530: {
    msg: `메뉴 고유 식별키가 유효한 값이 아닙니다.`,
  },
  20012540: {
    msg: `권한 고유 식별키가 올바르지 않습니다.`,
  },
  20012550: {
    msg: `권한 고유 식별키는 공백일 수 없습니다.`,
  },
  20012560: {
    msg: `권한 고유 식별키는 20자 이어야 합니다.`,
  },
  20012570: {
    msg: `권한 고유 식별키가 유효한 값이 아닙니다.`,
  },
  20012579: {
    msg: `권한명에 유효하지 않은 값이 존재합니다.`,
  },
  20012580: {
    msg: `권한명은 공백일 수 없습니다.`,
  },
  20012590: {
    msg: `권한명은 255자를 넘을 수 없습니다.`,
  },
  20012599: {
    msg: `권한 설명에 유효하지 않은 값이 존재합니다.`,  
  },
  20012600: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20012610: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20012620: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20012630: {
    msg: ``,
  },


  20013010: {
    msg: `권한 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20013020: {
    msg: `권한 고유 식별키는 공백일 수 없습니다.`,
  },
  20013030: {
    msg: `권한 고유 식별키는 20자 이어야 합니다.`,
  },
  20013040: {
    msg: `삭제 복구할 권한 고유 식별키가 존재하지 않습니다.`,
  },
  20013050: {
    msg: `권한 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20013060: {
    msg: `권한 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20013070: {
    msg: `권한 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20013080: {
    msg: ``,
  },


  20013510: {
    msg: `권한 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20013520: {
    msg: `권한 고유 식별키는 공백일 수 없습니다.`,
  },
  20013530: {
    msg: `권한 고유 식별키는 20자 이어야 합니다.`,
  },
  20013540: {
    msg: `삭제 복구할 권한 고유 식별키가 존재하지 않습니다.`,
  },
  20013550: {
    msg: `권한 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20013560: {
    msg: `권한 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20013570: {
    msg: `권한 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20013580: {
    msg: ``,
  },


  20014010: {
    msg: `권한 그룹명이 올바르지 않습니다.`,
  },
  20014020: {
    msg: `권한 그룹명은 공백일 수 없습니다.`,
  },
  20014030: {
    msg: `권한 그룹명은 100자를 넘을 수 없습니다.`,
  },
  20014040: {
    msg: `권한 그룹 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20014050: {
    msg: `권한 그룹 설명은 255자를 넘을 수 없습니다.`,
  },
  20014060: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20014070: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20014080: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20014090: {
    msg: ``,
  },
};

module.exports = myResultCode;
