
const myResultCode = {
  00000000: {
    msg: `미정의`,
  },

  10001001: {
    msg: `테스트`,
  },


  20001010: {
    msg: `로그인 상태가 만료되었습니다.`,
  },
  20001011: {
    msg: `로그인 상태가 만료되었습니다.`,
  },
  20001012: {
    msg: `로그인 상태가 만료되었습니다.`,
  },
  20001013: {
    msg: `로그인 상태가 만료되었습니다.`,
  },
  20001014: {
    msg: `로그인 상태를 갱신하였습니다.`,
  },



  20001508: {
    msg: `권한이 없습니다.`,
  },
  20001509: {
    msg: `코드그룹이 올바르지 않습니다.`,
  },
  20001510: {
    msg: `이미 존재하는 코드그룹으로 요청하셨습니다.`,
  },
  20001520: {
    msg: `코드그룹명이 올바르지 않습니다.`,
  },
  20001530: {
    msg: `코드그룹명은 공백일 수 없습니다.`,
  },
  20001540: {
    msg: `코드그룹명은 100자를 넘을 수 없습니다.`,
  },
  20001550: {
    msg: `코드 그룹 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20001590: {
    msg: `코드그룹은 공백일 수 없습니다.`,
  },
  20001600: {
    msg: `코드그룹은 5자이어야 합니다.`,
  },


  20002009: {
    msg: `권한이 없습니다.`,
  },
  20002010: {
    msg: `코드그룹이 올바르지 않습니다.`,
  },
  20002020: {
    msg: `등록되지 않은 코드그룹으로 요청하셨습니다.`,
  },
  20002030: {
    msg: `코드가 올바르지 않습니다.`,
  },
  20002040: {
    msg: `코드는 공백일 수 없습니다.`,
  },
  20002050: {
    msg: `코드는 13자이어야 합니다.`,
  },
  20002055: {
    msg: `이미 등록된 코드 입니다.`,
  },
  20002060: {
    msg: `코드명이 올바르지 않습니다.`,
  },
  20002070: {
    msg: `코드명은 공백일 수 없습니다.`,
  },
  20002080: {
    msg: `코드명은 50자를 넘을 수 없습니다.`,
  },
  20002089: {
    msg: `코드 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20002090: {
    msg: `코드 설명은 공백이 될 수 없습니다.`,
  },
  20002100: {
    msg: `코드 설명은 100자를 넘을 수 없습니다.`,
  },
  20002109: {
    msg: `코드 필요값 1에 유효하지 않은 값이 존재합니다.`,
  },
  20002110: {
    msg: `코드 필요값 1은 공백일 수 없습니다.`,
  },
  20002120: {
    msg: `코드 필요값 1은 100자를 넘을 수 없습니다.`,
  },
  20002129: {
    msg: `코드 필요값 2에 유효하지 않은 값이 존재합니다.`,
  },
  20002130: {
    msg: `코드 필요값 2는 공백일 수 없습니다.`,
  },
  20002140: {
    msg: `코드 필요값 2는 100자를 넘을 수 없습니다.`,
  },


  20002509: {
    msg: `권한이 없습니다.`,
  },
  20002510: {
    msg: `코드가 올바르지 않습니다.`,
  },
  20002520: {
    msg: `코드는 공백일 수 없습니다.`,
  },
  20002530: {
    msg: `코드 길이는 13자이어야 합니다.`,
  },
  20002540: {
    msg: `코드가 존재하지 않습니다.`,
  },
  20002550: {
    msg: `코드명이 올바르지 않습니다.`,
  },
  20002559: {
    msg: `코드명에 유효하지 않은 값이 존재합니다.`,
  },
  20002560: {
    msg: `코드명은 공백일 수 없습니다.`,
  },
  20002570: {
    msg: `코드명은 50자를 넘을 수 없습니다.`,
  },
  20002579: {
    msg: `코드설명에 유효하지 않은 값이 존재합니다.`,
  },
  20002580: {
    msg: `코드설명이 올바르지 않습니다.`,
  },
  20002590: {
    msg: `코드설명은 100자를 넘을 수 없습니다.`,
  },
  20002659: {
    msg: `코드 필요값1에 유효하지 않은 값이 존재합니다.`,
  },
  20002600: {
    msg: `코드 필요값1이 올바르지 않습니다.`,
  },
  20002610: {
    msg: `코드 필요값1은 100자를 넘을 수 없습니다.`,
  },
  20002619: {
    msg: `코드 필요값2에 유효하지 않은 값이 존재합니다.`,
  },
  20002620: {
    msg: `코드 필요값2가 올바르지 않습니다.`,
  },
  20002630: {
    msg: `코드 필요값2는 100자를 넘을 수 없습니다.`,
  },


  20003009: {
    msg: `권한이 없습니다.`,
  },
  20003010: {
    msg: `코드는 공백일 수 없습니다.`,
  },
  20003020: {
    msg: `코드는 13자이어야 합니다.`,
  },
  20003030: {
    msg: `수정할 코드가 없습니다.`,
  },
  20003040: {
    msg: `코드 중에 올바르지 않은 코드가 존재합니다.`,
  },
  20003050: {
    msg: `코드 중에 공백인 코드가 존재합니다.`,
  },
  20003060: {
    msg: `코드 중에 13자가 아닌 코드가 존재합니다.`,
  },
  20003070: {
    msg: `코드가 올바르지 않습니다.`,
  },
  20003080: {
    msg: ``,
  },



  20003509: {
    msg: `권한이 없습니다.`,
  },
  20003510: {
    msg: `코드는 공백일 수 없습니다.`,
  },
  20003520: {
    msg: `코드는 13자이어야 합니다.`,
  },
  20003530: {
    msg: `복구할 코드가 없습니다.`,
  },
  20003540: {
    msg: `코드 중에 올바르지 않은 코드가 존재합니다.`,
  },
  20003550: {
    msg: `코드 중에 공백인 코드가 존재합니다.`,
  },
  20003560: {
    msg: `코드 중에 13자가 아닌 코드가 존재합니다.`,
  },
  20003570: {
    msg: `코드가 올바르지 않습니다.`,
  },
  20003580: {
    msg: ``,
  },



  20004009: {
    msg: `권한이 없습니다.`,
  },
  20004010: {
    msg: `코드 그룹은 공백일 수 없습니다.`,
  },
  20004020: {
    msg: `코드 그룹은 5자이어야 합니다.`,
  },
  20004030: {
    msg: `조회할 코드 그룹이 없습니다.`,
  },
  20004040: {
    msg: `코드 그룹중에 올바르지 않은 코드 그룹이 존재합니다.`,
  },
  20004050: {
    msg: `코드 그룹중에 공백인 코드 그룹이 존재합니다.`,
  },
  20004060: {
    msg: `코드 그룹중에 5자가 아닌 코드 그룹이 존재합니다.`,
  },
  20004070: {
    msg: `코드그룹이 올바르지 않습니다.`,
  },
  20004080: {
    msg: ``,
  },



  20004509: {
    msg: `권한이 없습니다.`,
  },
  20004510: {
    msg: `코드 그룹이 올바르지 않습니다.`,
  },
  20004520: {
    msg: `코드 그룹은 공백일 수 없습니다.`,
  },
  20004530: {
    msg: `코드 그룹은 5자이어야 합니다.`,
  },
  20004540: {
    msg: `등록 되지 않은 코드 그룹으로 요청하셨습니다.`,
  },
  20004550: {
    msg: `코드 그룹명이 올바르지 않습니다.`,
  },
  20004559: {
    msg: `코드 그룹명에 유효하지 않은 값이 존재합니다.`,
  },
  20004560: {
    msg: `코드 그룹명은 공백일 수 없습니다.`,
  },
  20004570: {
    msg: `코드 그룹명은 100자를 넘을 수 없습니다.`,
  },
  20004580: {
    msg: `코드 그룹 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20004590: {
    msg: `코드 그룹 설명은 100자를 넘을 수 없습니다.`,
  },
  20004600: {
    msg: ``,
  },


  20005009: {
    msg: `권한이 없습니다.`,
  },
  20005010: {
    msg: `코드 그룹명은 공백일 수 없습니다.`,
  },
  20005020: {
    msg: `코드 그룹명은 5자이어야 합니다.`,
  },
  20005030: {
    msg: `삭제할 코드 그룹이 없습니다.`,
  },
  20005040: {
    msg: `코그 그룹중에 올바르지 않은 코드 그룹이 존재합니다.`,
  },
  20005050: {
    msg: `코드 그룹중에 공백인 코드 그룹이 존재합니다.`,
  },
  20005060: {
    msg: `코드 그룹중에 5자가 아닌 코드 그룹이 존재합니다.`,
  },
  20005070: {
    msg: `코드 그룹이 올바르지 않습니다.`,
  },


  20005509: {
    msg: `권한이 없습니다.`,
  },
  20005510: {
    msg: `코드 그룹명은 공백일 수 없습니다.`,
  },
  20005520: {
    msg: `코드 그룹명은 5자이어야 합니다.`,
  },
  20005530: {
    msg: `삭제할 코드 그룹이 없습니다.`,
  },
  20005540: {
    msg: `코그 그룹중에 올바르지 않은 코드 그룹이 존재합니다.`,
  },
  20005550: {
    msg: `코드 그룹중에 공백인 코드 그룹이 존재합니다.`,
  },
  20005560: {
    msg: `코드 그룹중에 5자가 아닌 코드 그룹이 존재합니다.`,
  },
  20005570: {
    msg: `코드 그룹이 올바르지 않습니다.`,
  },



  20005810: {
    msg: `권한이 없습니다.`,
  },



  20006009: {
    msg: `권한이 없습니다.`,
  },
  20006010: {
    msg: `메뉴 카테고리명이 올바르지 않습니다.`,
  },
  20006020: {
    msg: `메뉴 카테고리명은 공백일 수 없습니다.`,
  },
  20006030: {
    msg: `메뉴 카테고리명은 50자를 넘을 수 없습니다.`,
  },
  20006039: {
    msg: `메뉴 카테고리 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20006040: {
    msg: `메뉴 카테고리 설명은 공백일 수 없습니다.`,
  },
  20006050: {
    msg: `메뉴 카테고리 설명은 255자를 넘을 수 없습니다.`,
  },
  20006060: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20006070: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20006080: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20006090: {
    msg: ``,
  },


  20006509: {
    msg: `권한이 없습니다.`,
  },
  20006510: {
    msg: `등록일 시작 날짜가 올바르지 않습니다.`,
  },
  20006520: {
    msg: `등록일 종료 날짜가 올바르지 않습니다.`,
  },


  20007009: {
    msg: `권한이 없습니다.`,
  },
  20007010: {
    msg: `메뉴카테고리 고유 식별키가 올바르지 않습니다.`,
  },
  20007020: {
    msg: `메뉴카테고리 고유 식별키는 공백일 수 없습니다.`,
  },
  20007030: {
    msg: `존재하지 않는 메뉴카테고리의 수정을 요청하였습니다.`,
  },
  20007039: {
    msg: `메뉴 카테고리명에 유효하지 않은 값이 존재합니다.`,
  },
  20007040: {
    msg: `메뉴 카테고리명이 올바르지 않습니다.`,
  },
  20007050: {
    msg: `메뉴 카테고리명은 공백일 수 없습니다.`,
  },
  20007059: {
    msg: `메뉴 카테고리 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20007060: {
    msg: `메뉴 카테고리 설명이 올바르지 않습니다.`,
  },
  20007070: {
    msg: `메뉴 카테고리 설명은 공백일 수 없습니다.`,
  },
  20007080: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20007090: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20007100: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20007110: {
    msg: `메뉴 카테고리 상태가 올바르지 않습니다.`,
  },
  20007120: {
    msg: `메뉴 카테고리 상태는 공백일 수 없습니다.`,
  },
  20007130: {
    msg: `메뉴 카테고리 상태의 형식이 올바르지 않습니다.`,
  },
  20007140: {
    msg: `메뉴 카테고리 상태가 유효하지 않습니다.`,
  },


  20007509: {
    msg: `권한이 없습니다.`,
  },
  20007510: {
    msg: `메뉴 카테고리 고유 식별키는 공백일 수 없습니다.`,
  },
  20007520: {
    msg: `메뉴 카테고리 고유 식별키는 20자이어야 합니다.`,
  },
  20007530: {
    msg: `삭제할 메뉴 카테고리가 없습니다.`,
  },
  20007540: {
    msg: `메뉴 카테고리 고유 식별키중에 올바르지 식별키가 존재합니다.`,
  },
  20007550: {
    msg: `메뉴 카테고리 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20007560: {
    msg: `메뉴 카테고리 고유 식별키중중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20007570: {
    msg: `메뉴 카테고리 고유 식별키가 올바르지 않습니다.`,
  },
  20007580: {
    msg: ``,
  },


  20008009: {
    msg: `권한이 없습니다.`,
  },
  20008010: {
    msg: `메뉴 카테고리 고유 식별키는 공백일 수 없습니다.`,
  },
  20008020: {
    msg: `메뉴 카테고리 고유 식별키는 20자이어야 합니다.`,
  },
  20008030: {
    msg: `복구할 메뉴 카테고리가 없습니다.`,
  },
  20008040: {
    msg: `메뉴 카테고리 고유 식별키중에 올바르지 식별키가 존재합니다.`,
  },
  20008050: {
    msg: `메뉴 카테고리 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20008060: {
    msg: `메뉴 카테고리 고유 식별키중중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20008070: {
    msg: `메뉴 카테고리 고유 식별키가 올바르지 않습니다.`,
  },
  20008080: {
    msg: ``,
  },


  20008508: {
    msg: `권한이 없습니다.`,
  },
  20008509: {
    msg: `부모 메뉴 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20008510: {
    msg: `부모 메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20008520: {
    msg: `부모 메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20008530: {
    msg: `부모 메뉴 고유 식별키로 조회된 메뉴가 없습니다.`,
  },
  20008540: {
    msg: `메뉴 카테고리 고유 식별키가 올바르지 않습니다.`,
  },
  20008550: {
    msg: `메뉴 카테고리 고유 식별키는 공백일 수 없습니다.`,
  },
  20008560: {
    msg: `메뉴 카테고리 고유 식별키는 20자 이어야 합니다.`,
  },
  20008570: {
    msg: `존재하지 않는 메뉴 카테고리입니다.`,
  },
  20008580: {
    msg: `메뉴명이 올바르지 않습니다.`,
  },
  20008590: {
    msg: `메뉴명은 공백이 될 수 없습니다.`,
  },
  20008600: {
    msg: `메뉴명은 50자를 넘을 수 없습니다.`,
  },
  20008609: {
    msg: `메뉴 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20008610: {
    msg: `메뉴 설명은 공백일 수 없습니다.`,
  },
  20008620: {
    msg: `메뉴 설명은 255자를 넘을 수 없습니다.`,
  },
  20008630: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20008640: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20008650: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20008660: {
    msg: ``,
  },
  

  20009009: {
    msg: `권한이 없습니다.`,
  },
  20009010: {
    msg: `부모 메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20009020: {
    msg: `부모 메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20009030: {
    msg: `조회활 부모 메뉴 고유 식별키가 없습니다.`,
  },
  20009040: {
    msg: `부모 메뉴 고유 식별키중에서 올바르지 않은 식별키가 존재합니다.`,
  },
  20009050: {
    msg: `부모 메뉴 고유 식별키중에서 공백인 식별키가 존재합니다.`,
  },
  20009060: {
    msg: `부모 메뉴 고유 식별키중에서 20자가 아닌 식별키가 존재합니다.`,
  },
  20009070: {
    msg: `조회할 부모 메뉴명이 없습니다.`,
  },
  20009080: {
    msg: `부모 메뉴명중에 올바르지 않은 메뉴명이 존재합니다.`,
  },
  20009090: {
    msg: `메뉴 카테고리 고유 식별키는 공백일 수 없습니다.`,
  },
  20009100: {
    msg: `메뉴 카테고리 고유 식별키는 20자 이어야 합니다.`,
  },
  20009110: {
    msg: `조회할 메뉴 카테고리 고유 식별키가 없습니다.`,
  },
  20009120: {
    msg: `메뉴 카테고리 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20009130: {
    msg: `메뉴 카테고리 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20009140: {
    msg: `메뉴 카테고리 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20009150: {
    msg: `조회할 메뉴 카테고리명이 없습니다.`,
  },
  20009160: {
    msg: `메뉴 카테고리명중에 올바르지 않은 메뉴 카테고리명이 존재합니다.`,
  },
  20009170: {
    msg: `메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20009180: {
    msg: `메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20009190: {
    msg: `조회할 메뉴 고유 식별키가 없습니다.`,
  },
  20009200: {
    msg: `메뉴 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20009210: {
    msg: `메뉴 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20009220: {
    msg: `메뉴 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20009230: {
    msg: `조회할 메뉴명이 없습니다.`,
  },
  20009240: {
    msg: `메뉴명중에 올바르지 않은 메뉴명이 존재합니다.`,
  },
  20009250: {
    msg: `조회할 메뉴 설명이 없습니다.`,
  },
  20009260: {
    msg: `조회할 메뉴 설명중에 올바르지 않은 설명이 존재합니다.`,
  },
  20009270: {
    msg: `메뉴 등록일 시작일이 올바르지 않습니다.`,
  },
  20009280: {
    msg: `메뉴 등록일 종료일이 올바르지 않습니다.`,
  },
  20009290: {
    msg: `메뉴 수정일 시작일이 올바르지 않습니다.`,
  },
  20009300: {
    msg: `메뉴 수정일 종료일이 올바르지 않습니다.`,
  },
  20009310: {
    msg: `조회할 메뉴 상태가 없습니다.`,
  },
  20009320: {
    msg: `메뉴 상태중에 올바르지 않은 상태가 존재합니다.`,
  },
  20009330: {
    msg: ``,
  },


  20010009: {
    msg: `권한이 없습니다.`,
  },
  20010010: {
    msg: `메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20010020: {
    msg: `메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20010030: {
    msg: `삭제할 메뉴 고유 식별키가 없습니다.`,
  },
  20010040: {
    msg: `메뉴 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20010050: {
    msg: `메뉴 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20010060: {
    msg: `메뉴 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20010070: {
    msg: `메뉴 식별키가 올바르지 않습니다.`,
  },
  20010080: {
    msg: ``,
  },


  20010509: {
    msg: `권한이 없습니다.`,
  },
  20010510: {
    msg: `메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20010520: {
    msg: `메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20010530: {
    msg: `복구할 메뉴 고유 식별키가 없습니다.`,
  },
  20010540: {
    msg: `메뉴 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20010550: {
    msg: `메뉴 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20010560: {
    msg: `메뉴 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20010570: {
    msg: `메뉴 식별키가 올바르지 않습니다.`,
  },
  20010580: {
    msg: ``,
  },


  20011008: {
    msg: `권한이 없습니다.`,
  },
  20011009: {
    msg: `부모 메뉴 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20011010: {
    msg: `부모 메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20011020: {
    msg: `부모 메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20011030: {
    msg: `부모 메뉴 고유 식별키는 등록되어 있지 않은 메뉴 입니다.`,
  },
  20011040: {
    msg: `메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20011050: {
    msg: `메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20011060: {
    msg: `수정할 메뉴 고유 식별키가 없습니다.`,
  },
  20011070: {
    msg: `메뉴 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20011080: {
    msg: `메뉴 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20011090: {
    msg: `메뉴 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20011100: {
    msg: `메뉴 고유 식별키가 올바르지 않습니다.`,
  },

  20011109: {
    msg: `메뉴 카테고리 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20011110: {
    msg: `메뉴 카테고리 고유 식별키는 공백일 수 없습니다.`,
  },
  20011120: {
    msg: `메뉴 카테고리 고유 식별키는 20자 이어야 합니다.`,
  },
  20011130: {
    msg: `메뉴 카테고리 고유 식별키는 등록되어 있지 않은 메뉴 카테고리 입니다.`,
  },
  20011139: {
    msg: `메뉴명에 유효하지 않은 값이 존재합니다.`,
  },
  20011140: {
    msg: `메뉴명은 공백일 수 없습니다.`,
  },
  20011150: {
    msg: `메뉴명은 50자를 넘을 수 없습니다.`,
  },
  20011159: {
    msg: `메뉴 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20011160: {
    msg: `메뉴 설명은 공백일 수 없습니다.`,
  },
  20011170: {
    msg: `메뉴 설명은 255자를 넘을 수 없습니다.`,
  },
  20011180: {
    msg: `메뉴 순서가 올바르지 않습니다.`,
  },
  20011190: {
    msg: `메뉴 순서가 올바르지 않습니다.`,
  },
  20011200: {
    msg: `메뉴 순서가 올바르지 않습니다.`,
  },
  20011209: {
    msg: `메뉴 상태에 유효하지 않은 값이 존재합니다.`,
  },
  20011210: {
    msg: `메뉴 상태는 공백일 수 없습니다.`,
  },
  20011220: {
    msg: `메뉴 상태는 13자 이어야 합니다.`,
  },
  20011230: {
    msg: `메뉴 상태가 유효한 코드가 아닙니다.`,
  },
  20011200: {
    msg: ``,
  },


  20011509: {
    msg: `권한이 없습니다.`,
  },
  20011510: {
    msg: `메뉴 고유 식별키가 올바르지 않습니다.`,
  },
  20011520: {
    msg: `메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20011530: {
    msg: `메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20011540: {
    msg: `메뉴 고유 식별키로 등록된 메뉴가 존재하지 않습니다.`,
  },
  20011550: {
    msg: `권한명이 올바르지 않습니다.`,
  },
  20011560: {
    msg: `권한명은 공백일 수 없습니다.`,
  },
  20011570: {
    msg: `권한명은 255자를 넘을 수 없습니다.`,
  },
  20011579: {
    msg: `권한 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20011580: {
    msg: `권한 설명이 올바르지 않습니다.`,
  },
  20011590: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20011600: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20011610: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20011620: {
    msg: ``,
  },


  20012009: {
    msg: `권한이 없습니다.`,
  },
  20012010: {
    msg: `메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20012020: {
    msg: `메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20012030: {
    msg: `조회할 메뉴 고유 식별키가 존재하지 않습니다.`,
  },
  20012040: {
    msg: `메뉴 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20012050: {
    msg: `메뉴 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20012060: {
    msg: `메뉴 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20012070: {
    msg: `조회할 메뉴명이 없습니다.`,
  },
  20012080: {
    msg: `조회할 메뉴명중에 올바르지 않은 메뉴명이 존재합니다.`,
  },
  20012090: {
    msg: `권한 고유 식별키는 공백일 수 없습니다.`,
  },
  20012100: {
    msg: `권한 고유 식별키는 20자 이어야 합니다.`,
  },
  20012110: {
    msg: `조회할 권한 고유 식별키가 없습니다.`,
  },
  20012120: {
    msg: `메뉴 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20012130: {
    msg: `메뉴 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20012140: {
    msg: `메뉴 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20012150: {
    msg: `조회할 권한명이 존재하지 않습니다.`,
  },
  20012160: {
    msg: `권한명중에 올바르지 않은 권한명이 존재합니다.`,
  },
  20012170: {
    msg: `조회할 권한 설명이 존재하지 않습니다.`,
  },
  20012180: {
    msg: `권한 설명중에 올바르지 않은 권한 설명이 존재합니다.`,
  },
  20012190: {
    msg: `등록일 기간 시작일이 올바르지 않습니다.`,
  },
  20012200: {
    msg: `등록일 기간 종료일이 올바르지 않습니다.`,
  },
  20012210: {
    msg: `조회할 등록시 IP가 존재하지 않습니다.`,
  },
  20012220: {
    msg: `등록시 IP중에 올바르지 않은 IP가 존재합니다.`,
  },
  20012230: {
    msg: `수정일 기간 시작일이 올바르지 않습니다.`,
  },
  20012240: {
    msg: `수정일 기간 종료일이 올바르지 않습니다.`,
  },
  20012250: {
    msg: `조회할 수정시 IP가 존재하지 않습니다.`,
  },
  20012260: {
    msg: `수정시 IP중에 올바르지 않은 IP가 존재합니다.`,
  },
  20012270: {
    msg: ``,
  },


  20012508: {
    msg: `권한이 없습니다.`,
  },
  20012509: {
    msg: `메뉴 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20012510: {
    msg: `메뉴 고유 식별키는 공백일 수 없습니다.`,
  },
  20012520: {
    msg: `메뉴 고유 식별키는 20자 이어야 합니다.`,
  },
  20012530: {
    msg: `메뉴 고유 식별키가 유효한 값이 아닙니다.`,
  },
  20012540: {
    msg: `권한 고유 식별키가 올바르지 않습니다.`,
  },
  20012550: {
    msg: `권한 고유 식별키는 공백일 수 없습니다.`,
  },
  20012560: {
    msg: `권한 고유 식별키는 20자 이어야 합니다.`,
  },
  20012570: {
    msg: `권한 고유 식별키가 유효한 값이 아닙니다.`,
  },
  20012579: {
    msg: `권한명에 유효하지 않은 값이 존재합니다.`,
  },
  20012580: {
    msg: `권한명은 공백일 수 없습니다.`,
  },
  20012590: {
    msg: `권한명은 255자를 넘을 수 없습니다.`,
  },
  20012599: {
    msg: `권한 설명에 유효하지 않은 값이 존재합니다.`,  
  },
  20012600: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20012610: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20012620: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20012630: {
    msg: ``,
  },


  20013009: {
    msg: `권한이 없습니다.`,
  },
  20013010: {
    msg: `권한 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20013020: {
    msg: `권한 고유 식별키는 공백일 수 없습니다.`,
  },
  20013030: {
    msg: `권한 고유 식별키는 20자 이어야 합니다.`,
  },
  20013040: {
    msg: `삭제 복구할 권한 고유 식별키가 존재하지 않습니다.`,
  },
  20013050: {
    msg: `권한 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20013060: {
    msg: `권한 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20013070: {
    msg: `권한 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20013080: {
    msg: ``,
  },


  20013509: {
    msg: `권한이 없습니다.`,
  },
  20013510: {
    msg: `권한 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20013520: {
    msg: `권한 고유 식별키는 공백일 수 없습니다.`,
  },
  20013530: {
    msg: `권한 고유 식별키는 20자 이어야 합니다.`,
  },
  20013540: {
    msg: `삭제 복구할 권한 고유 식별키가 존재하지 않습니다.`,
  },
  20013550: {
    msg: `권한 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20013560: {
    msg: `권한 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20013570: {
    msg: `권한 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20013580: {
    msg: ``,
  },


  20014009: {
    msg: `권한 그룹을 등록할 수 있는 권한이 없습니다.`,
  },
  20014010: {
    msg: `권한 그룹명이 올바르지 않습니다.`,
  },
  20014020: {
    msg: `권한 그룹명은 공백일 수 없습니다.`,
  },
  20014030: {
    msg: `권한 그룹명은 100자를 넘을 수 없습니다.`,
  },
  20014040: {
    msg: `권한 그룹 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20014050: {
    msg: `권한 그룹 설명은 255자를 넘을 수 없습니다.`,
  },
  20014060: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20014070: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20014080: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20014090: {
    msg: `권한 그룹을 등록하는데 실패하였습니다.`,
  },


  20014510: {
    msg: `권한 그룹 고유 식별키가 올바르지 않습니다.`,
  },
  20014520: {
    msg: `권한 그룹 고유 식별키는 공백일 수 없습니다.`,
  },
  20014530: {
    msg: `권한 그룹 고유 식별키는 20자 이어야 합니다.`,
  },
  20014540: {
    msg: `권한 그룹명에 유효하지 않은 값이 존재합니다.`,
  },
  20014549: {
    msg: `권한 그룹명을 수정할 권한이 없습니다.`,
  },
  20014550: {
    msg: `권한 그룹명은 공백일 수 없습니다.`,
  },
  20014560: {
    msg: `권한 그룹명은 100자를 넘을 수 없습니다.`,
  },
  20014570: {
    msg: `권한 그룹 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20014575: {
    msg: `권한 그룹 설명을 수정할 권한이 없습니다.`,
  },
  20014580: {
    msg: `권한 그룹 설명은 255자를 넘을 수 없습니다.`,
  },
  20014589: {
    msg: `순서를 수정할 권한이 없습니다.`,
  },
  20014590: {
    msg: `순서에 유효하지 않은 값이 존재합니다.`,
  },
  20014600: {
    msg: `권한 그룹 상태에 유효하지 않은 값이 존재합니다.`,
  },
  20014609: {
    msg: `권한 그룹 상태를 수정할 권한이 없습니다.`,
  },
  20014610: {
    msg: `권한 그룹 상태는 공백일 수 없습니다.`,
  },
  20014620: {
    msg: `권한 그룹 상태는 13자 이어야 합니다.`,
  },
  20014630: {
    msg: `권한 그룹 상태가 유효한 상태 코드가 아닙니다.`,
  },
  20014640: {
    msg: ``,
  },


  20015009: {
    msg: `권한 그룹을 삭제할 수 있는 권한이 없습니다.`,
  },
  20015010: {
    msg: `권한 그룹 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20015020: {
    msg: `권한 그룹 고유 식별키는 공백일 수 없습니다.`,
  },
  20015030: {
    msg: `권한 그룹 고유 식별키는 20자 이어야 합니다.`,
  },
  20015040: {
    msg: `삭제할 권한 고유 그룹 식별키가 없습니다.`,
  },
  20015050: {
    msg: `권한 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20015060: {
    msg: `권한 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20015070: {
    msg: `권한 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20015080: {
    msg: `삭제하려는 권한 그룹중에 계정에서 사용중인 권한 그룹이 존재하여 선택된 권한 그룹을 삭제하는데 실패하였습니다.`,
  },



  20015210: {
    msg: `권한 그룹 목록을 볼 수 있는 권한이 없습니다.`,
  },



  20015509: {
    msg: `권한이 없습니다.`,
  },
  20015510: {
    msg: `권한 그룹 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20015520: {
    msg: `권한 그룹 고유 식별키는 공백일 수 없습니다.`,
  },
  20015530: {
    msg: `권한 그룹 고유 식별키는 20자 이어야 합니다.`,
  },
  20015540: {
    msg: `복구할 권한 고유 그룹 식별키가 없습니다.`,
  },
  20015550: {
    msg: `권한 고유 식별키중에 올바르지 않은 식별키가 존재합니다.`,
  },
  20015560: {
    msg: `권한 고유 식별키중에 공백인 식별키가 존재합니다.`,
  },
  20015570: {
    msg: `권한 고유 식별키중에 20자가 아닌 식별키가 존재합니다.`,
  },
  20015580: {
    msg: ``,
  },


  20016009: {
    msg: `권한 그룹의 권한을 설정할 권한이 없습니다.`,
  },
  20016010: {
    msg: `권한 그룹 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20016011: {
    msg: `권한 그룹을 등록할 권한이 없습니다.`,
  },
  20016020: {
    msg: `권한 그룹 고유 식별키는 공백일 수 없습니다.`,
  },
  20016030: {
    msg: `권한 그룹 고유 식별키는 20자 이어야 합니다.`,
  },
  20016040: {
    msg: `권한 정보가 올바르지 않습니다.`,
  },
  20016050: {
    msg: `권한 정보가 없습니다.`,
  },
  20016051: {
    msg: `권한 그룹의 권한을 수정할 권한이 없습니다.`,
  },
  20016060: {
    msg: `권한 그룹명이 올바르지 않습니다.`,
  },
  20016070: {
    msg: `권한 그룹명은 공백일 수 없습니다.`,
  },
  20016080: {
    msg: `권한 그룹명은 100자를 넘을 수 없습니다.`,
  },
  20016081: {
    msg: `권한 그룹명을 수정할 권한이 없습니다.`,
  },
  20016090: {
    msg: `권한 그룹 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20016091: {
    msg: `권한 그룹 설명을 수정할 권한이 없습니다.`,
  },
  20016100: {
    msg: `권한 그룹 설명은 255자를 넘을 수 없습니다.`,
  },
  20016109: {
    msg: `순서를 수정할 권한이 없습니다.`,
  },
  20016110: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20016120: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20016130: {
    msg: `순서가 올바르지 않습니다.`,
  },
  20016131: {
    msg: `권한 그룹 상태에 유효하지 않은 값이 존재합니다.`,
  },
  20016132: {
    msg: `권한 그룹 상태는 공백일 수 없습니다.`,
  },
  20016133: {
    msg: `권한 그룹 상태는 13자 이어야 합니다.`,
  },
  20016134: {
    msg: `권한 그룹 코드가 유효한 상태코드가 아닙니다.`,
  },
  20016135: {
    msg: `권한 그룹 상태를 수정할 권한이 없습니다.`,
  },
  20016140: {
    msg: `권한 그룹 정보 생성 및 업데이트에 실패하였습니다.`,
  },
  20016150: {
    msg: `등록되어 있지 않은 권한 그룹 고유 식별키 입니다.`,
  },
  20016160: {
    msg: ``,
  },


  20016509: {
    msg: `권한 그룹 상세 내용을 볼 수 있는 권한이 없습니다.`,
  },
  20016510: {
    msg: `권한 그룹 고유 식별키가 올바르지 않습니다.`,
  },
  20016520: {
    msg: `권한 그룹 고유 식별키는 공백일 수 없습니다.`,
  },
  20016530: {
    msg: `권한 그룹 고유 식별키는 20자 이어야 합니다.`,
  },
  20016540: {
    msg: ``,
  },


  20017009: {
    msg: `회원 생성 권한이 없습니다.`,
  },
  20017010: {
    msg: `회사 고유 식별키에 유효하지 않은 값이 존재합니다.`,
  },
  20017020: {
    msg: `회사 고유 식별키는 공백일 수 없습니다.`,
  },
  20017030: {
    msg: `회사 고유 식별키는 20자 이어야 합니다.`,
  },
  20017040: {
    msg: `회사 고유 식별키가 유효한 식별키가 아닙니다.`,
  },
  20017050: {
    msg: `권한 그룹 고유 식별키가 올바르지 않습니다.`,
  },
  20017060: {
    msg: `권한 그룹 고유 식별키는 공백일 수 없습니다.`,
  },
  20017070: {
    msg: `권한 그룹 고유 식별키는 20자 이어야 합니다.`,
  },
  20017080: {
    msg: `권한 그룹 고유 식별키가 유효한 식별키가 아닙니다.`,
  },
  20017081: {
    msg: `회원 등급을 선택해주세요.`,
  },
  20017082: {
    msg: `회원 등급을 선택해주세요.`,
  },
  20017083: {
    msg: `회원 등급이 올바르지 않습니다.`,
  },
  20017084: {
    msg: `회원 등급이 유효하지 않습니다.`,
  },
  20017090: {
    msg: `회원 ID가 올바르지 않습니다.`,
  },
  20017100: {
    msg: `회원 ID는 공백일 수 없습니다.`,
  },
  20017110: {
    msg: `회원 ID는 숫자로만 구성될 수 없습니다.`,
  },
  20017120: {
    msg: `회원 ID는 영문 또는 숫자 조합만 허용됩니다.`,
  },
  20017130: {
    msg: `회원 ID는 50자를 넘을 수 없습니다.`,
  },
  20017140: {
    msg: `회원 비밀번호가 올바르지 않습니다.`,
  },
  20017150: {
    msg: `회원 비밀번호는 공백일 수 없습니다.`,
  },
  20017151: {
    msg: `회원 비밀번호는 최소 6자 이상이어야 합니다.`,
  },
  20017160: {
    msg: `회원명이 올바르지 않습니다.`,
  },
  20017170: {
    msg: `회원명은 공백일 수 없습니다.`,
  },
  20017180: {
    msg: `회원명은 50자를 넘을 수 없습니다.`,
  },
  20017190: {
    msg: `회원 휴대폰 번호에 유효하지 않은 값이 존재합니다.`,
  },
  20017200: {
    msg: `회원 휴대폰 번호는 공백일 수 없습니다.`,
  },
  20017210: {
    msg: `회원 휴대폰 번호는 15자를 넘을 수 없습니다.`,
  },
  20017220: {
    msg: `회원 메모에 유효하지 않은 값이 존재합니다.`,
  },
  20017230: {
    msg: `회원 상태가 올바르지 않습니다.`,
  },
  20017240: {
    msg: `회원 상태는 공백일 수 없습니다.`,
  },
  20017250: {
    msg: `회원 상태는 13자 이어야 합니다.`,
  },
  20017260: {
    msg: `회원 상태가 유효한 상태 코드가 아닙니다.`,
  },
  20017270: {
    msg: ``,
  },
  20017280: {
    msg: ``,
  },
  20017290: {
    msg: ``,
  },
  20017300: {
    msg: ``,
  },


  20018010: {
    msg: `회원 아이디를 입력해주세요.`,
  },
  20018020: {
    msg: `회원 아이디를 입력해주세요.`,
  },
  20018030: {
    msg: `회원 아이디는 50자를 넘을 수 없습니다.`,
  },
  20018040: {
    msg: `회원 비밀번호를 입력해주세요.`,
  },
  20018050: {
    msg: `회원 비밀번호를 입력해주세요.`,
  },
  20018060: {
    msg: `가입된 정보가 없습니다.`,
  },
  20018070: {
    msg: `회원 상태가 정상이 아닙니다. 관리자에 문의해주세요.`,
  },
  20018080: {
    msg: ``,
  },
  20018090: {
    msg: ``,
  },


  20018510: {
    msg: `수정 대상의 회원 정보가 올바르지 않습니다.`,
  },
  20018520: {
    msg: `수정 대상의 회원 정보가 없습니다.`,
  },
  20018530: {
    msg: `수정 대상의 회원 정보가 유효하지 않습니다.`,
  },
  20018540: {
    msg: `수정 대상의 회원 정보가 없습니다.`,
  },
  20018550: {
    msg: `수정 대상의 회원 정보중에 올바르지 않은 정보가 존재합니다.`,
  },
  20018560: {
    msg: `수정 대상의 회원 정보중에 정보가 없는 것이 존재합니다.`,
  },
  20018570: {
    msg: `수정 대상의 회원 정보중에 올바르지 않은 정보가 존재합니다.`,
  },
  20018580: {
    msg: `회사 정보가 유효하지 않습니다.`,
  },
  20018589: {
    msg: `회사 정보를 수정할 권한이 없습니다.`,
  },
  20018590: {
    msg: `회사 정보가 올바르지 않습니다.`,
  },
  20018600: {
    msg: `회사 정보가 올바르지 않습니다.`,
  },
  20018610: {
    msg: `회사 정보가 유효하지 않습니다.`,
  },
  20018620: {
    msg: `권한 그룹이 올바르지 않습니다.`,
  },
  20018629: {
    msg: `권한 그룹을 수정할 권한이 없습니다.`,
  },
  20018630: {
    msg: `권한 그룹이 올바르지 않습니다.`,
  },
  20018640: {
    msg: `권한 그룹이 올바르지 않습니다.`,
  },
  20018650: {
    msg: `권한 그룹이 유효하지 않습니다.`,
  },
  20018651: {
    msg: `회원 등급을 선택해주세요.`,
  },
  20018652: {
    msg: `회원 등급을 선택해주세요.`,
  },
  20018653: {
    msg: `회원 등급을 선택해주세요.`,
  },
  20018654: {
    msg: `회원 등급이 유효하지 않습니다.`,
  },
  20018655: {
    msg: `회원 등급을 수정할 권한이 없습니다.`,
  },
  20018660: {
    msg: `회원 비밀번호가 올바르지 않습니다.`,
  },
  20018669: {
    msg: `회원 비밀번호를 수정할 권한이 없습니다.`,
  },
  20018670: {
    msg: `회원 비밀번호를 입력해주세요.`,
  },
  20018680: {
    msg: `회원 비밀번호는 6자 이상이어야 합니다.`,
  },
  20018690: {
    msg: `회원명이 올바르지 않습니다.`,
  },
  20018699: {
    msg: `회원명을 수정할 권한이 없습니다.`,
  },
  20018700: {
    msg: `회원명을 입력해주세요.`,
  },
  20018710: {
    msg: `회원명은 50자를 넘길 수 없습니다.`,
  },
  20018720: {
    msg: `회원 휴대폰 번호가 올바르지 않습니다.`,
  },
  20018729: {
    msg: `회원 휴대폰 번호를 수정할 권한이 없습니다.`,
  },
  20018730: {
    msg: `회원 휴대폰 번호를 입력해주세요.`,
  },
  20018740: {
    msg: `회원 휴대폰 번호는 15자를 넘길 수 없습니다.`,
  },
  20018750: {
    msg: `회원 메모가 올바르지 않습니다.`,
  },
  20018751: {
    msg: `회원 메모를 수정할 권한이 없습니다.`,
  },
  20018760: {
    msg: `회원 상태가 올바르지 않습니다.`,
  },
  20018769: {
    msg: `회원 상태를 수정할 권한이 없습니다.`,
  },
  20018770: {
    msg: `회원 상태를 선택해주세요.`,
  },
  20018780: {
    msg: `회원 상태가 올바르지 않습니다.`,
  },
  20018790: {
    msg: `회원 상태가 유효하지 않습니다.`,
  },
  20018800: {
    msg: ``,
  },



  20019509: {
    msg: `회원을 삭제할 권한이 없습니다.`,
  },
  20019510: {
    msg: `삭제 대상의 회원 정보가 올바르지 않습니다.`,
  },
  20019520: {
    msg: `삭제 대상의 회원 정보가 없습니다.`,
  },
  20019530: {
    msg: `삭제 대상의 회원 정보가 유효하지 않습니다.`,
  },
  20019540: {
    msg: `삭제 대상의 회원 정보가 없습니다.`,
  },
  20019550: {
    msg: `삭제 대상의 회원 정보중에 올바르지 않은 정보가 존재합니다.`,
  },
  20019560: {
    msg: `삭제 대상의 회원 정보중에 정보가 없는 것이 존재합니다.`,
  },
  20019570: {
    msg: `삭제 대상의 회원 정보중에 올바르지 않은 정보가 존재합니다.`,
  },
  20019580: {
    msg: `삭제 대상의 회원중에 다운로드 URL 타겟 계정으로 설정된 계정이 존재하여 선택된 회원 삭제에 실패하였습니다.`,
  },


  20020010: {
    msg: `복구 대상의 회원 정보가 올바르지 않습니다.`,
  },
  20020020: {
    msg: `복구 대상의 회원 정보가 없습니다.`,
  },
  20020030: {
    msg: `복구 대상의 회원 정보가 유효하지 않습니다.`,
  },
  20020040: {
    msg: `복구 대상의 회원 정보가 없습니다.`,
  },
  20020050: {
    msg: `복구 대상의 회원 정보중에 올바르지 않은 정보가 존재합니다.`,
  },
  20020060: {
    msg: `복구 대상의 회원 정보중에 정보가 없는 것이 존재합니다.`,
  },
  20020070: {
    msg: `복구 대상의 회원 정보중에 올바르지 않은 정보가 존재합니다.`,
  },
  20020080: {
    msg: ``,
  },


  20020509: {
    msg: `권한이 없습니다.`,
  },
  20020510: {
    msg: `회사명을 입력해주세요.`,
  },
  20020520: {
    msg: `회사명을 입력해주세요.`,
  },
  20020530: {
    msg: `회사명은 100자를 넘을 수 없습니다.`,
  },
  20020540: {
    msg: `회사 대표자명에 유효하지 않은 값이 존재합니다.`,
  },
  20020550: {
    msg: `회사 대표자명을 입력해주세요.`,
  },
  20020560: {
    msg: `회사 대표자명을 100자를 넘을 수 없습니다.`,
  },
  20020570: {
    msg: `회사 대표자의 연락처에 유효하지 않은 값이 존재합니다.`,
  },
  20020580: {
    msg: `회사 대표자의 연락처를 입력해주세요.`,
  },
  20020590: {
    msg: `회사 대표자의 연락처는 15자를 넘을 수 없습니다.`,
  },
  20020600: {
    msg: `회사대표번호에 유효하지 않은 값이 존재합니다.`,
  },
  20020610: {
    msg: `회사대표번호를 입력해주세요.`,
  },
  20020620: {
    msg: `회사대표번호는 15자를 넘을 수 없습니다.`,
  },
  20020630: {
    msg: `사업자번호에 유효하지 않은 값이 존재합니다.`,
  },
  20020640: {
    msg: `사업자번호를 입력해주세요.`,
  },
  20020650: {
    msg: `사업자번호는 15자를 넘을 수 없습니다.`,
  },
  20020660: {
    msg: `사업장주소에 유효하지 않은 값이 존재합니다.`,
  },
  20020670: {
    msg: `사업장주소를 입력해주세요.`,
  },
  20020680: {
    msg: `사업장주소는 150자를 넘을 수 없습니다.`,
  },
  20020690: {
    msg: `회사 메모에 유효하지 않은 값이 존재합니다.`,
  },
  20020700: {
    msg: `회사 메모를 입력해주세요.`,
  },
  20020710: {
    msg: `회사 상태를 선택해주세요.`,
  },
  20020720: {
    msg: `회사 상태를 선택해주세요.`,
  },
  20020730: {
    msg: `회사 상태 값이 올바르지 않습니다.`,
  },
  20020740: {
    msg: `회사 상태 값이 유효하지 않습니다.`,
  },
  20020750: {
    msg: `회사 등록에 실패하였습니다.`,
  },


  20020810: {
    msg: `회사 목록을 볼 권한이 없습니다.`,
  },


  20021010: {
    msg: `수정 대상의 회사 정보가 없습니다.`,
  },
  20021020: {
    msg: `수정 대상의 회사 정보가 없습니다.`,
  },
  20021030: {
    msg: `수정 대상의 회사 정보가 올바르지 않습니다.`,
  },
  20021040: {
    msg: `수정 대상의 회사 정보가 유효하지 않습니다.`,
  },
  20021050: {
    msg: `수정 대상의 회사들의 정보가 없습니다.`,
  },
  20021060: {
    msg: `수정 대상의 회사들의 정보중 올바르지 않은 회사 정보가 존재합니다.`,
  },
  20021070: {
    msg: `수정 대상의 회사들의 정보중 올바르지 않은 회사 정보가 존재합니다.`,
  },
  20021080: {
    msg: `수정 대상의 회사들의 정보중 올바르지 않은 회사 정보가 존재합니다.`,
  },
  20021090: {
    msg: `수정 대상의 회사들의 정보중 유효하지 않은 정보가 존재합니다.`,
  },
  20021100: {
    msg: `회사명에 유효하지 않은 값이 존재합니다.`,
  },
  20021109: {
    msg: `회사명을 수정할 권한이 없습니다.`,
  },
  20021110: {
    msg: `회사명을 입력해주세요.`,
  },
  20021120: {
    msg: `회사명은 100자를 넘을 수 없습니다.`,
  },
  20021130: {
    msg: `회사 대표자명에 유효하지 않은 값이 존재합니다.`,
  },
  20021139: {
    msg: `회사 대표자명을 수정할 권한이 없습니다.`,
  },
  20021140: {
    msg: `회사 대표자명을 입력해주세요.`,
  },
  20021150: {
    msg: `회사 대표자명은 100자를 넘을 수 없습니다.`,
  },
  20021160: {
    msg: `회사 대표자의 연락처에 유효하지 않은 값이 존재합니다.`,
  },
  20021169: {
    msg: `회사 대표자의 연락처를 수정할 권한이 없습니다.`,
  },
  20021170: {
    msg: `회사 대표자의 연락처를 입력해주세요.`,
  },
  20021180: {
    msg: `회사 대표자의 연락처는 15자를 넘을 수 없습니다.`,
  },
  20021190: {
    msg: `회사대표번호에 유효하지 않은 값이 존재합니다.`,
  },
  20021199: {
    msg: `회사대표번호를 수정할 권한이 없습니다.`,
  },
  20021200: {
    msg: `회사대표번호를 입력해주세요.`,
  },
  20021210: {
    msg: `회사대표번호는 15자를 넘을 수 없습니다.`,
  },
  20021220: {
    msg: `사업자번호에 유효하지 않은 값이 존재합니다.`,
  },
  20021229: {
    msg: `사업자번호를 수정할 권한이 없습니다.`,
  },
  20021230: {
    msg: `사업자번호를 입력해주세요.`,
  },
  20021240: {
    msg: `사업자번호는 15자를 넘을 수 없습니다.`,
  },
  20021250: {
    msg: `사업장주소에 유효하지 않은 값이 존재합니다.`,
  },
  20021259: {
    msg: `사업장주소를 수정할 권한이 없습니다.`,
  },
  20021260: {
    msg: `사업장주소를 입력해주세요.`,
  },
  20021270: {
    msg: `사업장주소는 150자를 넘을 수 없습니다.`,
  },
  20021280: {
    msg: `메모에 유효하지 않은 값이 존재합니다.`,
  },
  20021289: {
    msg: `메모를 수정할 권한이 없습니다.`,
  },
  20021290: {
    msg: `메모를 입력해주세요.`,
  },
  20021300: {
    msg: `회사 상태가 올바르지 않습니다.`,
  },
  20021309: {
    msg: `회사 상태를 수정할 권한이 없습니다.`,
  },
  20021310: {
    msg: `회사 상태를 선택해주세요.`,
  },
  20021320: {
    msg: `회사 상태가 유효하지 않습니다.`,
  },
  20021330: {
    msg: `회사 상태가 유효한 코드가 아닙니다.`,
  },
  20021340: {
    msg: ``,
  },


  20022009: {
    msg: `권한이 없습니다.`,
  },
  20022010: {
    msg: `삭제 대상의 회사 정보가 없습니다.`,
  },
  20022020: {
    msg: `삭제 대상의 회사 정보가 없습니다.`,
  },
  20022030: {
    msg: `삭제 대상의 회사 정보가 올바르지 않습니다.`,
  },
  20022040: {
    msg: `삭제 대상의 회사 정보가 유효하지 않습니다.`,
  },
  20022050: {
    msg: `삭제하려는 회사는 이미 삭제된 상태입니다.`,
  },
  20022060: {
    msg: `삭제하려는 회사들의 정보가 없습니다.`,
  },
  20022070: {
    msg: `삭제하려는 회사들의 정보중에 올바르지 않은 정보가 존재합니다.`,
  },
  20022080: {
    msg: `삭제하려는 회사들의 정보중에 올바르지 않은 정보가 존재합니다.`,
  },
  20022090: {
    msg: `삭제하려는 회사들의 정보중에 올바르지 않은 정보가 존재합니다.`,
  },
  20022100: {
    msg: `삭제하려는 회사들의 정보중에 이미 삭제된 회사 정보가 존재합니다.`,
  },
  20022110: {
    msg: `회사로 선택되어 있는 계정이 존재하기 때문에 선택된 회사를 삭제할 수 없습니다.`,
  },


  20022510: {
    msg: `복구 대상의 회사 정보가 없습니다.`,
  },
  20022520: {
    msg: `복구 대상의 회사 정보가 없습니다.`,
  },
  20022530: {
    msg: `복구 대상의 회사 정보가 올바르지 않습니다.`,
  },
  20022540: {
    msg: `복구 대상의 회사 정보가 유효하지 않습니다.`,
  },
  20022550: {
    msg: `복구하려는 회사는 삭제 되어 있지 않습니다.`,
  },
  20022560: {
    msg: `복구하려는 회사들의 정보가 없습니다.`,
  },
  20022570: {
    msg: `복구하려는 회사들의 정보중에 올바르지 않은 정보가 존재합니다.`,
  },
  20022580: {
    msg: `복구하려는 회사들의 정보중에 올바르지 않은 정보가 존재합니다.`,
  },
  20022590: {
    msg: `복구하려는 회사들의 정보중에 올바르지 않은 정보가 존재합니다.`,
  },
  20022600: {
    msg: `복구하려는 회사들의 정보중에 삭제되어 있지 않은 회사 정보가 존재합니다.`,
  },
  20022610: {
    msg: ``,
  },


  20023009: {
    msg: `파일을 등록할 권한이 없습니다.`,
  },
  20023010: {
    msg: `파일 라벨명이 올바르지 않습니다.`,
  },
  20023020: {
    msg: `파일 라벨명을 입력해주세요.`,
  },
  20023030: {
    msg: `파일 라벨명은 100자를 넘을 수 없습니다.`,
  },
  20023040: {
    msg: `파일 메모에 유효하지 않은 값이 존재합니다.`,
  },
  20023050: {
    msg: `파일 메모를 입력해주세요.`,
  },
  20023060: {
    msg: `파일 설명글에 유효하지 않은 값이 존재합니다.`,
  },
  20023070: {
    msg: `파일 설명글을 입력해주세요.`,
  },
  20023080: {
    msg: `외부에 파일 버전의 변경 이력 노출 여부 값이 유효하지 않습니다.`,
  },
  20023090: {
    msg: `외부에 파일 설명글 노출 여부 값이 유효하지 않습니다.`,
  },
  20023100: {
    msg: `파일 상태가 올바르지 않습니다.`,
  },
  20023110: {
    msg: `파일 상태를 선택해주세요.`,
  },
  20023120: {
    msg: `파일 상태가 유효하지 않습니다.`,
  },
  20023130: {
    msg: `파일 상태가 유효하지 않습니다.`,
  },
  20023140: {
    msg: `새 파일 등록에 실패하였습니다.`,
  },
  20023150: {
    msg: ``,
  },


  20024009: {
    msg: `새로운 파일 버전을 등록할 수 있는 권한이 없습니다.`,
  },
  20024010: {
    msg: `파일 정보가 올바르지 않습니다.`,
  },
  20024020: {
    msg: `파일 정보가 올바르지 않습니다.`,
  },
  20024030: {
    msg: `파일 정보가 올바르지 않습니다.`,
  },
  20024040: {
    msg: `유효한 파일 정보가 아닙니다.`,
  },
  20024050: {
    msg: `버전명이 올바르지 않습니다.`,
  },
  20024060: {
    msg: `버전명을 입력해주세요.`,
  },
  20024070: {
    msg: `버전명은 30자를 넘을 수 없습니다.`,
  },
  20024080: {
    msg: `이미 해당 버전명으로 등록된 버전이 존재합니다.`,
  },
  20024090: {
    // msg: `이전에 등록되었던 버전명보다 현재 등록하려는 버전명이 더 높은 값이어야 합니다.`,
    msg: `등록하려는 버전명은 이미 등록되어 있습니다.`,
  },
  20024100: {
    msg: `버전코드가 올바르지 않습니다.`,
  },
  20024110: {
    msg: `이미 해당 버전코드로 등록된 버전이 존재합니다.`,
  },
  20024120: {
    // msg: `이전에 등록되었던 버전코드보다 현재 등록하려는 버전코드가 더 높은 값이어야 합니다.`,
    msg: `등록하려는 버전코드는 이미 등록되어 있습니다.`,
  },
  20024130: {
    msg: `버전 메모에 유효하지 않은 값이 존재합니다.`,
  },
  20024140: {
    msg: `버전 메모를 입력해주세요.`,
  },
  20024150: {
    msg: `버전 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20024160: {
    msg: `버전 설명을 입력해주세요.`,
  },
  20024170: {
    msg: `버전 상태가 올바르지 않습니다.`,
  },
  20024180: {
    msg: `버전 상태를 선택해주세요.`,
  },
  20024190: {
    msg: `버전 상태가 유효하지 않습니다.`,
  },
  20024200: {
    msg: `버전 상태가 유효하지 않습니다.`,
  },
  20024210: {
    msg: `버전 파일이 존재하지 않습니다.`,
  },
  20024220: {
    msg: `버전 파일의 업로드가 정상적으로 되지 않았습니다.`,
  },
  20024230: {
    msg: ``,
  },


  20025010: {
    msg: `수정할 파일 버전 정보가 올바르지 않습니다.`,
  },
  20025020: {
    msg: `수정할 파일 버전 정보가 없습니다.`,
  },
  20025030: {
    msg: `수정할 파일 버전 정보가 올바르지 않습니다.`,
  },
  20025040: {
    msg: `수정할 파일 버전 정보가 유효하지 않습니다.`,
  },
  20025050: {
    msg: `다운로드 될 때의 파일 이름에 유효하지 않은 값이 존재합니다.`,
  },
  20025059: {
    msg: `다운로드 될 때의 파일 이름을 수정할 권한이 없습니다.`,
  },
  20025060: {
    msg: `다운로드 될 때의 파일 이름은 공백일 수 없습니다.`,
  },
  20025070: {
    msg: `다운로드 될 때의 파일 이름은 255자를 넘을 수 없습니다.`,
  },
  20025080: {
    msg: `파일 버전 메모에 유효하지 않은 값이 존재합니다.`,
  },
  20025085: {
    msg: `파일 버전 메모를 수정할 권한이 없습니다.`,
  },
  20025090: {
    msg: `파일 버전 메모는 공백일 수 없습니다.`,
  },
  20025100: {
    msg: `파일 버전 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20025105: {
    msg: `파일 버전 설명을 수정할 권한이 없습니다.`,
  },
  20025110: {
    msg: `파일 버전 설명은 공백일 수 없습니다.`,
  },
  20025120: {
    msg: `파일 버전 상태에 유효하지 않은 값이 존재합니다.`,
  },
  20025129: {
    msg: `파일 버전 상태를 수정할 권한이 없습니다.`,
  },
  20025130: {
    msg: `파일 버전 상태가 올바르지 않습니다.`,
  },
  20025140: {
    msg: `파일 버전 상태가 올바르지 않습니다.`,
  },
  20025150: {
    msg: `파일 버전 상태가 유효하지 않습니다.`,
  },
  20025160: {
    msg: ``,
  },


  20025510: {
    msg: `파일 관련 스크린샷을 수정할 권한이 없습니다.`,
  },
  20025520: {
    msg: `파일 대표 이미지를 수정할 권한이 없습니다.`,
  },



  20026010: {
    msg: `수정할 파일 정보가 없습니다.`,
  },
  20026020: {
    msg: `수정할 파일 정보가 없습니다.`,
  },
  20026030: {
    msg: `수정할 파일 정보가 올바르지 않습니다.`,
  },
  20026040: {
    msg: `수정할 파일 정보가 유효하지 않습니다.`,
  },
  20026050: {
    msg: `파일 라벨명에 유효하지 않은 값이 존재합니다.`,
  },
  20026059: {
    msg: `파일 라벨명을 수정할 권한이 없습니다.`,
  },
  20026060: {
    msg: `파일 라벨명을 입력해주세요.`,
  },
  20026070: {
    msg: `파일 라벨명은 100자를 넘을 수 없습니다.`,
  },
  20026080: {
    msg: `파일 메모에 유효하지 않은 값이 존재합니다.`,
  },
  20026089: {
    msg: `파일 메모를 수정할 권한이 없습니다.`,
  },
  20026090: {
    msg: `파일 메모를 수정할 권한이 없습니다.`,
  },
  20026090: {
    msg: `파일 메모를 입력해주세요.`,
  },
  20026100: {
    msg: `파일 설명에 유효하지 않은 값이 존재합니다.`,
  },
  20026109: {
    msg: `파일 설명을 수정할 권한이 없습니다.`,
  },
  20026110: {
    msg: `파일 설명을 입력해주세요.`,
  },
  20026120: {
    msg: `파일 스크린샷 정보가 유효하지 않습니다.`,
  },
  20026130: {
    msg: `파일 스크린샷 정보가 유효하지 않습니다.`,
  },
  20026140: {
    msg: `파일 스크린샷 정보가 유효하지 않습니다.`,
  },
  20026141: {
    msg: `파일 스크린샷을 수정할 권한이 없습니다.`,
  },
  20026142: {
    msg: `파일 스크린샷 정보가 유효하지 않습니다.`,
  },
  20026150: {
    msg: `파일 대표이미지 정보가 유효하지 않습니다.`,
  },
  20026160: {
    msg: `파일 대표이미지 정보가 유효하지 않습니다.`,
  },
  20026170: {
    msg: `파일 대표이미지 정보가 유효하지 않습니다.`,
  },
  20026171: {
    msg: `파일 대표이미지를 수정할 권한이 없습니다.`,
  },
  20026172: {
    msg: `파일 대표이미지 정보가 유효하지 않습니다.`,
  },
  20026180: {
    msg: `외부에 파일 버전의 변경 이력 노출 여부에 유효하지 않은 값이 존재합니다.`,
  },
  20026189: {
    msg: `외부에 파일 버전의 변경 이력 노출 여부를 수정할 수 있는 권한이 없습니다.`,
  },
  20026190: {
    msg: `외부에 파일 버전의 변경 이력 노출 여부에 유효하지 않은 값이 존재합니다.`,
  },
  20026200: {
    msg: `외부에 파일 설명글 노출 여부에 유효하지 않은 값이 존재합니다.`,
  },
  20026209: {
    msg: `외부에 파일 설명글 노출 여부를 수정할 권한이 없습니다.`,
  },
  20026210: {
    msg: `외부에 파일 설명글 노출 여부에 유효하지 않은 값이 존재합니다.`,
  },
  20026220: {
    msg: `파일 상태에 유효하지 않은 값이 존재합니다.`,
  },
  20026229: {
    msg: `파일 상태를 수정할 권한이 없습니다.`,
  },
  20026230: {
    msg: `파일 상태가 올바르지 않습니다.`,
  },
  20026240: {
    msg: `파일 상태가 올바르지 않습니다.`,
  },
  20026250: {
    msg: `파일 상태가 유효한 값이 아닙니다.`,
  },
  20026260: {
    msg: `파일 정보 수정에 실패하였습니다.`,
  },
  20026270: {
    msg: ``,
  },


  20027009: {
    msg: `파일 다운로드 URL 생성 권한이 없습니다.`,
  },
  20027010: {
    msg: `대상 회원 정보가 올바르지 않습니다.`,
  },
  20027020: {
    msg: `대상 회원 정보가 올바르지 않습니다.`,
  },
  20027030: {
    msg: `대상 회원 정보가 올바르지 않습니다.`,
  },
  20027040: {
    msg: `대상 회원 정보가 유효하지 않습니다.`,
  },
  20027050: {
    msg: `파일 정보가 올바르지 않습니다.`,
  },
  20027060: {
    msg: `파일 정보가 올바르지 않습니다.`,
  },
  20027070: {
    msg: `파일 정보가 올바르지 않습니다.`,
  },
  20027080: {
    msg: `파일 정보가 유효하지 않습니다.`,
  },
  20027090: {
    msg: `파일 버전 정보가 올바르지 않습니다.`,
  },
  20027100: {
    msg: `파일 버전 정보가 올바르지 않습니다.`,
  },
  20027110: {
    msg: `파일 버전 정보가 올바르지 않습니다.`,
  },
  20027120: {
    msg: `파일 버전 정보가 유효하지 않습니다.`,
  },
  20027130: {
    msg: `파일 다운로드 제한 시작일 값이 올바르지 않습니다.`,
  },
  20027140: {
    msg: `파일 다운로드 제한 시작일 값이 올바르지 않습니다.`,
  },
  20027150: {
    msg: `파일 다운로드 제한 시작일 값이 유효한 값이 아닙니다.`,
  },
  20027160: {
    msg: `파일 다운로드 제한 종료일 값이 올바르지 않습니다.`,
  },
  20027170: {
    msg: `파일 다운로드 제한 종료일 값이 올바르지 않습니다.`,
  },
  20027180: {
    msg: `파일 다운로드 제한 종료일 값이 유효한 값이 아닙니다.`,
  },
  20027190: {
    msg: `파일 다운로드 제한 시작일이 파일 다운로드 제한 종료일보다 이후 날짜 입니다.`,
  },
  20027200: {
    msg: `다운로드 가능한 최대 수가 유효한 값이 아닙니다.`,
  },
  20027210: {
    msg: `파일 다운로드 URL 접근 조건 정보가 올바르지 않습니다.`,
  },
  20027220: {
    msg: `파일 다운로드 URL 접근 조건 정보가 올바르지 않습니다.`,
  },
  20027230: {
    msg: `파일 다운로드 URL 접근 조건 정보가 올바르지 않습니다.`,
  },
  20027240: {
    msg: `파일 다운로드 URL 접근 조건 정보가 올바르지 않습니다.`,
  },
  20027250: {
    msg: `파일 다운로드 URL 접근 조건 정보가 올바르지 않습니다.`,
  },
  20027260: {
    msg: `파일 다운로드 URL 접근 조건 정보가 올바르지 않습니다.`,
  },
  20027270: {
    msg: `파일 다운로드 URL 접근 조건 정보가 올바르지 않습니다.`,
  },
  20027271: {
    msg: `파일 다운로드 URL 접근 조건 종류가 유효하지 않습니다.`,
  },
  20027272: {
    msg: `파일 다운로드 URL 접근 조건 상태가 유효하지 않습니다.`,
  },
  20027280: {
    msg: `파일 다운로드 URL 상태가 올바르지 않습니다.`,
  },
  20027290: {
    msg: `파일 다운로드 URL 상태가 올바르지 않습니다.`,
  },
  20027300: {
    msg: `파일 다운로드 URL 상태가 올바르지 않습니다.`,
  },
  20027310: {
    msg: `파일 다운로드 URL 상태가 유효하지 않습니다.`,
  },
  20027320: {
    msg: `파일 다운로드 URL을 생성하는데 실패하였습니다.`,
  },
  20027330: {
    msg: `외부에 파일 다운로드 가능 여부 값이 올바르지 않습니다.`,
  },
  20027340: {
    msg: `외부에 파일 다운로드 가능 여부 값이 올바르지 않습니다.`,
  },
  20027350: {
    msg: `외부에 파일 다운로드 횟수 정보 값이 올바르지 않습니다.`,
  },
  20027360: {
    msg: `외부에 파일 다운로드 횟수 정보 값이 올바르지 않습니다.`,
  },
  

  20028010: {
    msg: `회원 목록을 볼 권한이 없습니다.`,
  },


  20029010: {
    msg: `파일 리스트 조회 권한이 없습니다.`,
  },


  20030010: {  
    msg: `파일 다운로드 URL 리스트 조회 권한이 없습니다.`,
  },


  20031010: {
    msg: `수정할 파일 다운로드 URL 정보가 없습니다.`,
  },
  20031020: {
    msg: `수정할 파일 다운로드 URL 정보가 없습니다.`,
  },
  20031030: {
    msg: `수정할 파일 다운로드 URL 정보가 올바르지 않습니다.`,
  },
  20031035: {
    msg: `수정할 파일 다운로드 URL 정보가 유효하지 않습니다.`,
  },
  20031040: {
    msg: `수정할 파일 다운로드 URL 정보에 유효하지 않은 값이 존재합니다.`,
  },
  20031049: {
    msg: `대상 회원을 수정할 권한이 없습니다.`,
  },
  20031050: {
    msg: `대상 회원 정보가 없습니다.`,
  },
  20031060: {
    msg: `대상 회원 정보가 올바르지 않습니다.`,
  },
  20031070: {
    msg: `대상 회원 정보가 유효하지 않습니다.`,
  },
  20031080: {
    msg: `파일 정보에 유효하지 않은 값이 존재합니다.`,
  },
  20031090: {
    msg: `파일 정보가 없습니다.`,
  },
  20031100: {
    msg: `파일 정보가 올바르지 않습니다.`,
  },
  20031110: {
    msg: `파일 정보가 유효하지 않습니다.`,
  },
  20031120: {
    msg: `파일 버전 정보에 유효하지 않은 값이 존재합니다.`,
  },
  20031129: {
    msg: `파일 버전을 수정할 권한이 없습니다.`,
  },
  20031130: {
    msg: `파일 버전 정보가 없습니다.`,
  },
  20031140: {
    msg: `파일 버전 정보가 올바르지 않습니다.`,
  },
  20031150: {
    msg: `파일 버전 정보가 유효하지 않습니다.`,
  },
  20031160: {
    msg: `파일 다운로드 제한 시작일에 유효하지 않은 값이 존재합니다.`,
  },
  20031169: {
    msg: `파일 다운로드 제한일을 수정할 권한이 없습니다.`,
  },
  20031170: {
    msg: `파일 다운로드 제한 시작일이 날짜 형식이 아닙니다.`,
  },
  20031180: {
    msg: `파일 다운로드 제한 종료일에 유효하지 않은 값이 존재합니다.`,
  },
  20031189: {
    msg: `파일 다운로드 제한일을 수정할 권한이 없습니다.`,
  },
  20031190: {
    msg: `파일 다운로드 제한 종료일이 날짜 형식이 아닙니다.`,
  },
  20031200: {
    msg: `파일 다운로드 제한 시작일이 유효하지 않습니다.`,
  },
  20031210: {
    msg: `파일 다운로드 제한 종료일이 유효하지 않습니다.`,
  },
  20031220: {
    msg: `파일 다운로드 제한 시작일이 종료일보다 이후 날짜 입니다.`,
  },
  20031230: {
    msg: `다운로드 가능한 최대 수에 유효하지 않은 값이 존재합니다.`,
  },
  20031235: {
    msg: `다운로드 가능한 최대 수를 수정할 권한이 없습니다.`,
  },
  20031240: {
    msg: `파일 다운로드 된 수에 유효하지 않은 값이 존재합니다.`,
  },
  20031249: {
    msg: `파일 다운로드 된 수를 수정할 권한이 없습니다.`,
  },
  20031250: {
    msg: `파일 다운로드 된 수는 0으로만 수정 가능합니다.`,
  },
  20031260: {
    msg: `파일 다운로드 URL 접근 제한 설정 정보가 유효하지 않습니다.`,
  },
  20031265: {
    msg: `파일 다운로드 URL 접근 제한 설정 정보를 수정할 권한이 없습니다.`,
  },
  20031270: {
    msg: `파일 다운로드 URL 접근 제한 설정 정보가 유효하지 않습니다.`,
  },
  20031280: {
    msg: `파일 다운로드 URL 접근 제한 설정 정보가 유효하지 않습니다.`,
  },
  20031290: {
    msg: `파일 다운로드 URL 접근 제한 설정 정보가 유효하지 않습니다.`,
  },
  20031300: {
    msg: `파일 다운로드 URL 접근 제한 설정 정보가 유효하지 않습니다.`,
  },
  20031310: {
    msg: `파일 다운로드 URL 접근 제한 설정 정보가 유효하지 않습니다.`,
  },
  20031320: {
    msg: `파일 다운로드 URL 접근 제한 설정 정보가 유효하지 않습니다.`,
  },
  20031330: {
    msg: `파일 다운로드 URL 접근 제한 종류가 유효하지 않습니다.`,
  },
  20031340: {
    msg: `파일 다운로드 URL 접근 제한 상태가 유효하지 않습니다.`,
  },
  20031350: {
    msg: `파일 다운로드 URL 상태에 유효하지 않은 값이 존재합니다.`,
  },
  20031359: {
    msg: `파일 다운로드 URL 상태를 수정할 권한이 없습니다.`,
  },
  20031360: {
    msg: `파일 다운로드 URL 상태가 없습니다.`,
  },
  20031370: {
    msg: `파일 다운로드 URL 상태가 올바르지 않습니다.`,
  },
  20031380: {
    msg: `파일 다운로드 URL 상태가 유효하지 않습니다.`,
  },
  20031390: {
    msg: `파일 다운로드 URL 을 수정하는데 실패하였습니다.`,
  },



  20032010: {
    msg: `파일 버전을 등록할 권한이 없습니다.`,
  },
  20032020: {
    msg: `파일 버전의 파일을 수정할 권한이 없습니다.`,
  },



  20033010: {
    msg: `파일 버전 목록에 대한 접근 권한이 없습니다.`,
  },



  20034010: {
    msg: `아이디를 확인해주세요.`,
  },
  20034020: {
    msg: `아이디를 입력해주세요.`,
  },
  20034030: {
    msg: `아이디는 50자를 넘을 수 없습니다.`,
  },


  20035010: {
    msg: `아이디를 확인해주세요.`,
  },
  20035020: {
    msg: `아이디를 입력해주세요.`,
  },
  20035030: {
    msg: `아이디는 50자를 넘을 수 없습니다.`,
  },
  20035035: {
    msg: `이미 가입된 아이디 입니다.`,
  },
  20035040: {
    msg: `비밀번호를 확인해주세요.`,
  },
  20035050: {
    msg: `비밀번호를 입력해주세요.`,
  },
  20035060: {
    msg: `비밀번호는 6자 이상으로 입력해주세요.`,
  },
  20035070: {
    msg: `이름을 확인해주세요.`,
  },
  20035080: {
    msg: `이름을 입력해주세요.`,
  },
  20035090: {
    msg: `이름은 50자를 넘을 수 없습니다..`,
  },
  20035100: {
    msg: `휴대폰 번호를 확인해주세요.`,
  },
  20035110: {
    msg: `휴대폰 번호를 입력해주세요.`,
  },
  20035120: {
    msg: `휴대폰 번호에 숫자만 입력해주세요.`,
  },
  20035130: {
    msg: `휴대폰 번호를 다시 확인해주세요.`,
  },


  20036009: {
    msg: `다운로드 된 갯수에 대한 접근 권한이 없습니다.`,
  },
  20036010: {
    msg: `조회 대상 시작일이 날짜 형식이 아닙니다.`,
  },
  20036020: {
    msg: `조회 대상 종료일이 날짜 형식이 아닙니다.`,
  },
  20036030: {
    msg: `조회 대상 시작일이 종료일보다 이후 날짜입니다.`,
  },


  20037010: {
    msg: `총 업로드된 파일 갯수에 대한 접근 권한이 없습니다.`,
  },
  20037020: {
    msg: `검색 대상 시작일이 날짜 형식이 아닙니다.`,
  },
  20037030: {
    msg: `검색 대상 시작일이 날짜 형식이 아닙니다.`,
  },
  20037040: {
    msg: `검색 대상 시작일이 종료일보다 이후 날짜입니다.`,
  },


  20038010: {
    msg: `총 다운로드 된 용량에 대한 접근 권한이 없습니다.`,
  },
  20038020: {
    msg: `조회 대상 시작일이 날짜 형식이 아닙니다.`,
  },
  20038030: {
    msg: `조회 대상 종료일이 날짜 형식이 아닙니다.`,
  },
  20038040: {
    msg: `조회 대상 시작일이 종료일보다 이후 날짜입니다.`,
  },



  20039010: {
    msg: `총 파일 다운로드 시도 횟수에 대한 접근 권한이 없습니다.`,
  },
  20039020: {
    msg: `검색 대상 시작일이 날짜 형식이 아닙니다.`,
  },
  20039030: {
    msg: `검색 대상 종료일이 날짜 형식이 아닙니다.`,
  },
  20039040: {
    msg: `검색 대상 시작일이 종료일보다 이후 날짜입니다.`,
  },


  20040010: {
    msg: `날짜별 다운로드 횟수에 대한 접근 권한이 없습니다.`,
  },
  20040020: {
    msg: `조회 대상일이 날짜 형식이 아닙니다.`,
  },
  20040030: {
    msg: `조회 대상일이 날짜 형식이 아닙니다.`,
  },


  20041010: {
    msg: `회사명으로 검색할 수 있는 권한이 없습니다.`,
  },
  20041020: {
    msg: `회사명으로 검색할 수 있는 권한이 없습니다.`,
  },
  20041030: {
    msg: `회사 대표자명으로 검색할 수 있는 권한이 없습니다.`,
  },
  20041040: {
    msg: `회사 대표자명으로 검색할 수 있는 권한이 없습니다.`,
  },
  20041050: {
    msg: `회사 대표자 연락처로 검색할 수 있는 권한이 없습니다.`,
  },
  20041060: {
    msg: `회사 대표자 연락처로 검색할 수 있는 권한이 없습니다.`,
  },
  20041070: {
    msg: `회사 전화번호로 검색할 수 있는 권한이 없습니다.`,
  },
  20041080: {
    msg: `회사 전화번호로 검색할 수 있는 권한이 없습니다.`,
  },
  20041090: {
    msg: `사업자번호로 검색할 수 있는 권한이 없습니다.`,
  },
  20041100: {
    msg: `사업자번호로 검색할 수 있는 권한이 없습니다.`,
  },
  20041110: {
    msg: `사업장주소로 검색할 수 있는 권한이 없습니다.`,
  },
  20041120: {
    msg: `사업장주소로 검색할 수 있는 권한이 없습니다.`,
  },
  20041130: {
    msg: `메모로 검색할 수 있는 권한이 없습니다.`,
  },
  20041140: {
    msg: `메모로 검색할 수 있는 권한이 없습니다.`,
  },
  20041150: {
    msg: `등록일 기간으로 검색할 수 있는 권한이 없습니다.`,
  },
  20041160: {
    msg: `등록일 기간으로 검색할 수 있는 권한이 없습니다.`,
  },
  20041170: {
    msg: `회사 등록시 IP로 검색할 수 있는 권한이 없습니다.`,
  },
  20041180: {
    msg: `회사 등록시 IP로 검색할 수 있는 권한이 없습니다.`,
  },
  20041190: {
    msg: `회사 최근 수정 기간으로 검색할 수 있는 권한이 없습니다.`,
  },
  20041200: {
    msg: `회사 최근 수정 기간으로 검색할 수 있는 권한이 없습니다.`,
  },
  20041210: {
    msg: `회사 최근 수정시 IP로 검색할 수 있는 권한이 없습니다.`,
  },
  20041220: {
    msg: `회사 최근 수정시 IP로 검색할 수 있는 권한이 없습니다.`,
  },
  20041230: {
    msg: `회사 상태로 검색할 수 있는 권한이 없습니다.`,
  },
  20041240: {
    msg: `회사 상태로 검색할 수 있는 권한이 없습니다.`,
  },



  20042010: {
    msg: `부모 회원 ID로 검색할 수 있는 권한이 없습니다.`,
  },
  20042020: {
    msg: `부모 회원 ID로 검색할 수 있는 권한이 없습니다.`,
  },
  20042030: {
    msg: `부모 회원명으로 검색할 수 있는 권한이 없습니다.`,
  },
  20042040: {
    msg: `부모 회원명으로 검색할 수 있는 권한이 없습니다.`,
  },
  20042050: {
    msg: `회원의 회사명으로 검색할 수 있는 권한이 없습니다.`,
  },
  20042060: {
    msg: `회원의 회사명으로 검색할 수 있는 권한이 없습니다.`,
  },
  20042070: {
    msg: `회원의 회사 대표자명으로 검색할 수 있는 권한이 없습니다.`,
  },
  20042080: {
    msg: `회원의 회사 대표자명으로 검색할 수 있는 권한이 없습니다.`,
  },
  20042090: {
    msg: `회원의 권한 그룹명으로 검색할 수 있는 권한이 없습니다.`,
  },
  20042100: {
    msg: `회원의 권한 그룹명으로 검색할 수 있는 권한이 없습니다.`,
  },
  20042110: {
    msg: `회원 등급 으로 검색할 수 있는 권한이 없습니다.`,
  },
  20042120: {
    msg: `회원 등급 으로 검색할 수 있는 권한이 없습니다.`,
  },
  20042130: {
    msg: `회원 ID로 검색할 수 있는 권한이 없습니다.`,
  },
  20042140: {
    msg: `회원 ID로 검색할 수 있는 권한이 없습니다.`,
  },
  20042150: {
    msg: `회원명으로 검색할 수 있는 권한이 없습니다.`,
  },
  20042160: {
    msg: `회원명으로 검색할 수 있는 권한이 없습니다.`,
  },
  20042170: {
    msg: `회원 휴대폰번호로 검색할 수 있는 권한이 없습니다.`,
  },
  20042180: {
    msg: `회원 휴대폰번호로 검색할 수 있는 권한이 없습니다.`,
  },
  20042190: {
    msg: `회원 메모로 검색할 수 있는 권한이 없습니다.`,
  },
  20042200: {
    msg: `회원 메모로 검색할 수 있는 권한이 없습니다.`,
  },
  20042210: {
    msg: `회원 상태로 검색할 수 있는 권한이 없습니다.`,
  },
  20042220: {
    msg: `회원 상태로 검색할 수 있는 권한이 없습니다.`,
  },
  20042230: {
    msg: `회원 등록일(가입일) 기간으로 검색할 수 있는 권한이 없습니다.`,
  },
  20042240: {
    msg: `회원 등록일(가입일) 기간으로 수 있는 권한이 없습니다.`,
  },
  20042250: {
    msg: `회원 최근 수정일 기간으로 검색할 수 있는 권한이 없습니다.`,
  },
  20042260: {
    msg: `회원 최근 수정일 기간으로 수 있는 권한이 없습니다.`,
  },


  20043010: {
    msg: `파일 라벨명에 대한 검색 권한이 없습니다.`,
  },
  20043020: {
    msg: `파일 라벨명에 대한 검색 권한이 없습니다.`,
  },
  20043030: {
    msg: `파일 메모에 대한 검색 권한이 없습니다.`,
  },
  20043040: {
    msg: `파일 메모에 대한 검색 권한이 없습니다.`,
  },
  20043050: {
    msg: `파일 설명에 대한 검색 권한이 없습니다.`,
  },
  20043060: {
    msg: `파일 설명에 대한 검색 권한이 없습니다.`,
  },
  20043070: {
    msg: `파일 등록일 기간에 대한 검색 권한이 없습니다.`,
  },
  20043080: {
    msg: `파일 등록일 기간에 대한 검색 권한이 없습니다.`,
  },
  20043090: {
    msg: `파일 등록시 IP에 대한 검색 권한이 없습니다.`,
  },
  20043100: {
    msg: `파일 등록시 IP에 대한 검색 권한이 없습니다.`,
  },
  20043110: {
    msg: `파일 등록자의 ID에 대한 검색 권한이 없습니다.`,
  },
  20043120: {
    msg: `파일 등록자의 ID에 대한 검색 권한이 없습니다.`,
  },
  20043130: {
    msg: `파일 등록자의 이름에 대한 검색 권한이 없습니다.`,
  },
  20043140: {
    msg: `파일 등록자의 이름에 대한 검색 권한이 없습니다.`,
  },
  20043150: {
    msg: `파일 최근 수정일 기간에 대한 검색 권한이 없습니다.`,
  },
  20043160: {
    msg: `파일 최근 수정일 기간에 대한 검색 권한이 없습니다.`,
  },
  20043170: {
    msg: `파일 최근 수정시 IP에 대한 검색 권한이 없습니다.`,
  },
  20043180: {
    msg: `파일 최근 수정시 IP에 대한 검색 권한이 없습니다.`,
  },
  20043190: {
    msg: `파일 최근 수정자 ID에 대한 검색 권한이 없습니다.`,
  },
  20043200: {
    msg: `파일 최근 수정자 ID에 대한 검색 권한이 없습니다.`,
  },
  20043210: {
    msg: `파일 최근 수정자의 이름에 대한 검색 권한이 없습니다.`,
  },
  20043220: {
    msg: `파일 최근 수정자의 이름에 대한 검색 권한이 없습니다.`,
  },
  20043230: {
    msg: `파일 상태에 대한 검색 권한이 없습니다.`,
  },
  20043240: {
    msg: `파일 상태에 대한 검색 권한이 없습니다.`,
  },
  20043250: {
    msg: ``,
  },



  20044010: {
    msg: `파일 상세 정보에 대한 접근 권한이 없습니다.`,
  },
  20044020: {
    msg: `파일 정보를 확인해주세요.`,
  },
  20044030: {
    msg: `파일 정보가 없습니다.`,
  },
  20044040: {
    msg: `파일 정보가 올바르지 않습니다.`,
  },
  20044050: {
    msg: `유효한 파일 정보가 아닙니다.`,
  },
  20044060: {
    msg: ``,
  },


  20045010: {
    msg: `파일 버전명으로 검색할 수 있는 권한이 없습니다.`,
  },
  20045020: {
    msg: `파일 버전명으로 검색할 수 있는 권한이 없습니다.`,
  },
  20045030: {
    msg: `파일 버전코드로 검색할 수 있는 권한이 없습니다.`,
  },
  20045040: {
    msg: `파일 버전코드로 검색할 수 있는 권한이 없습니다.`,
  },
  20045050: {
    msg: `원본 파일명으로 검색할 수 있는 권한이 없습니다.`,
  },
  20045060: {
    msg: `원본 파일명으로 검색할 수 있는 권한이 없습니다.`,
  },
  20045070: {
    msg: `다운로드될 파일명으로 검색할 수 있는 권한이 없습니다.`,
  },
  20045080: {
    msg: `다운로드될 파일명으로 검색할 수 있는 권한이 없습니다.`,
  },
  20045090: {
    msg: `버전 메모로 검색할 수 있는 권한이 없습니다.`,
  },
  20045100: {
    msg: `버전 메모로 검색할 수 있는 권한이 없습니다.`,
  },
  20045110: {
    msg: `버전 설명으로 검색할 수 있는 권한이 없습니다.`,
  },
  20045120: {
    msg: `버전 설명으로 검색할 수 있는 권한이 없습니다.`,
  },
  20045130: {
    msg: `파일 용량으로 검색할 수 있는 권한이 없습니다.`,
  },
  20045140: {
    msg: `파일 용량으로 검색할 수 있는 권한이 없습니다.`,
  },
  20045150: {
    msg: `파일 종류로 검색할 수 있는 권한이 없습니다.`,
  },
  20045160: {
    msg: `파일 종류로 검색할 수 있는 권한이 없습니다.`,
  },
  20045170: {
    msg: `버전 등록일로 검색할 수 있는 권한이 없습니다.`,
  },
  20045180: {
    msg: `버전 등록일로 검색할 수 있는 권한이 없습니다.`,
  },
  20045190: {
    msg: `버전 등록시 IP로 검색할 수 있는 권한이 없습니다.`,
  },
  20045200: {
    msg: `버전 등록시 IP로 검색할 수 있는 권한이 없습니다.`,
  },
  20045210: {
    msg: `버전 상태로 검색할 수 있는 권한이 없습니다.`,
  },
  20045220: {
    msg: `버전 상태로 검색할 수 있는 권한이 없습니다.`,
  },
  20045230: {
    msg: ``,
  },


  20046010: {
    msg: `파일 다운로드 URL 키로 검색할 수 있는 권한이 없습니다.`,
  },
  20046020: {
    msg: `파일 다운로드 URL 키로 검색할 수 있는 권한이 없습니다.`,
  },
  20046030: {
    msg: `파일 버전으로 검색할 수 있는 권한이 없습니다.`,
  },
  20046040: {
    msg: `파일 버전으로 검색할 수 있는 권한이 없습니다.`,
  },
  20046042: {
    msg: `생성일로 검색할 수 있는 권한이 없습니다.`,
  },
  20046043: {
    msg: `생성일로 검색할 수 있는 권한이 없습니다.`,
  },
  20046050: {
    msg: `파일 다운로드 URL 접근 시도 횟수로 검색할 수 있는 권한이 없습니다.`,
  },
  20046060: {
    msg: `파일 다운로드 URL 접근 시도 횟수로 검색할 수 있는 권한이 없습니다.`,
  },
  20046070: {
    msg: `파일 다운로드 제한일로 검색할 수 있는 권한이 없습니다.`,
  },
  20046080: {
    msg: `파일 다운로드 제한일로 검색할 수 있는 권한이 없습니다.`,
  },
  20046090: {
    msg: `다운로드 가능한 최대 수로 검색할 수 있는 권한이 없습니다.`,
  },
  20046100: {
    msg: `다운로드 가능한 최대 수로 검색할 수 있는 권한이 없습니다.`,
  },
  20046110: {
    msg: `파일 다운로드 된 수로 검색할 수 있는 권한이 없습니다.`,
  },
  20046120: {
    msg: `파일 다운로드 된 수로 검색할 수 있는 권한이 없습니다.`,
  },
  20046130: {
    msg: `다운로드 (접근)제한으로 검색할 수 있는 권한이 없습니다.`,
  },
  20046140: {
    msg: `다운로드 (접근)제한으로 검색할 수 있는 권한이 없습니다.`,
  },
  20046150: {
    msg: `URL 상태로 검색할 수 있는 권한이 없습니다.`,
  },
  20046160: {
    msg: `URL 상태로 검색할 수 있는 권한이 없습니다.`,
  },
  20046170: {
    msg: ``,
  },


  20047009: {
    msg: `파일 버전 상세 정보에 대한 접근 권한이 없습니다.`,
  },
  20047010: {
    msg: `파일 버전 고유 정보가 없습니다.`,
  },
  20047020: {
    msg: `파일 버전 고유 정보가 없습니다.`,
  },
  20047030: {
    msg: `파일 버전 고유 정보가 올바르지 않습니다.`,
  },


  20048009: {
    msg: `파일 다운로드 URL 상세 정보에 대한 접근 권한이 없습니다.`,
  },
  20048010: {
    msg: `파일 다운로드 URL 고유 정보가 없습니다.`,
  },
  20048020: {
    msg: `파일 다운로드 URL 고유 정보가 없습니다.`,
  },
  20048030: {
    msg: `파일 다운로드 URL 고유 정보가 올바르지 않습니다.`,
  },


  20049010: {
    msg: `유효한 접근이 아닙니다.`,
  },
  20049020: {
    msg: `유효한 접근이 아닙니다.`,
  },
  20049030: {
    msg: `유효한 접근이 아닙니다.`,
  },
  20049040: {
    msg: `유효한 접근이 아닙니다.`,
  },
  20049050: {
    msg: `만료된 URL 입니다.`,
  },
  20049052: {
    msg: `다운로드 가능한 횟수가 초과되었습니다.`,
  },
  20049054: {
    msg: `다운로드 가능한 기간이 아닙니다.`,
  },
  20049060: {
    msg: `접근 하실 수 없습니다.`,
  },
  20049070: {
    msg: `유효한 요청이 아닙니다.`,
  },
  20049080: {
    msg: `다운로드에 필요한 암호 정보가 없습니다.`,
  },
  20049085: {
    msg: `다운로드에 필요한 이전 절차가 없습니다.`,
  },
  20049090: {
    msg: `다운로드에 필요한 암호 정보가 유효하지 않습니다.`,
  },
  20049100: {
    msg: `파일 버전 정보가 유효하지 않습니다.`,
  },
  20049110: {
    msg: `파일이 이동되었거나 삭제되었습니다.`,
  },
  20049120: {
    msg: `파일 다운로드에 실패하였습니다.`,
  },
  20049130: {
    msg: `파일 소유자 정보가 올바르지 않습니다.`,
  },
  20049140: {
    msg: `다운로드 가능한 횟수가 초과되었습니다.`,
  },


  20050010: {
    msg: `유효한 접근이 아닙니다.`,
  },
  20050020: {
    msg: `유효한 접근이 아닙니다.`,
  },
  20050030: {
    msg: `유효한 접근이 아닙니다.`,
  },
  20050040: {
    msg: `유효한 접근이 아닙니다.`,
  },
  20050050: {
    msg: `유효한 접근이 아닙니다.`,
  },
  20050060: {
    msg: `유효한 접근이 아닙니다.`,
  },
  20050070: {
    msg: `암호를 확인해주세요.`,
  },
  20050080: {
    msg: `암호를 입력해주세요.`,
  },
  20050090: {
    msg: `암호가 올바르지 않습니다.`,
  },


  20051009: {
    msg: `파일 다운로드 현황을 볼 권한이 없습니다.`,
  },
  20051010: {
    msg: `조회 대상 날짜에 대한 정보가 없습니다.`,
  },
  20051020: {
    msg: `조회 대상 날짜에 대한 정보가 없습니다.`,
  },
  20051030: {
    msg: `조회 대상 날짜가 유효하지 않습니다.`,
  },


  20052010: {
    msg: `조회 대상 날짜에 대한 정보가 없습니다.`,
  },
  20052020: {
    msg: `조회 대상 날짜에 대한 정보가 없습니다.`,
  },
  20052030: {
    msg: `조회 대상 날짜가 유효하지 않습니다.`,
  },
  20052040: {
    msg: `조회 대상 회원 정보가 유효하지 않습니다.`,
  },
  20052050: {
    msg: `조회 대상 회원 정보가 유효하지 않습니다.`,
  },
  20052060: {
    msg: `조회 대상 회원 정보가 유효하지 않습니다.`,
  },
  20052070: {
    msg: `조회 대상 회원 정보가 유효하지 않습니다.`,
  },


  20053010: {
    msg: `메뉴 정보가 올바르지 않습니다.`,
  },
  20053020: {
    msg: `메뉴 정보가 올바르지 않습니다.`,
  },
  20053030: {
    msg: `메뉴 정보가 올바르지 않습니다.`,
  },


  20054010: {
    msg: `파일 다운로드 정보가 올바르지 않습니다.`,
  },
  20054020: {
    msg: `파일 다운로드 정보가 올바르지 않습니다.`,
  },
  20054030: {
    msg: `파일 다운로드 정보가 올바르지 않습니다.`,
  },
  20054040: {
    msg: `파일 다운로드 정보가 유효하지 않습니다.`,
  },
  20054050: {
    msg: `다운로드 링크 상태가 유효하지 않습니다.`,
  },
  20054060: {
    msg: `파일 정보가 유효하지 않습니다.`,
  },
  20054070: {
    msg: `파일 상태가 유효하지 않습니다.`,
  },
  20054080: {
    msg: `파일 버전 정보 또는 상태가 유효하지 않습니다.`,
  },
  20054090: {
    msg: ``,
  },


  20055010: {
    msg: `회사 상세정보를 볼 권한이 없습니다.`,
  },
  20055020: {
    msg: `회사 정보가 올바르지 않습니다.`,
  },
  20055030: {
    msg: `회사 정보가 올바르지 않습니다.`,
  },
  20055040: {
    msg: `회사 정보가 올바르지 않습니다.`,
  },
  20055050: {
    msg: `조회된 회사 정보가 없습니다.`,
  },


  20056010: {
    msg: `회원 상세정보를 볼 권한이 없습니다.`,
  },
  20056020: {
    msg: `회원 정보가 올바르지 않습니다.`,
  },
  20056030: {
    msg: `회원 정보가 올바르지 않습니다.`,
  },
  20056040: {
    msg: `회원 정보가 올바르지 않습니다.`,
  },
  20056050: {
    msg: `조회된 회원 정보가 없습니다.`,
  },


  20057010: {
    msg: `권한 그룹 상세정보를 볼 권한이 없습니다.`,
  },
  20057020: {
    msg: `권한 그룹 정보가 올바르지 않습니다.`,
  },
  20057030: {
    msg: `권한 그룹 정보가 올바르지 않습니다.`,
  },
  20057040: {
    msg: `권한 그룹 정보가 올바르지 않습니다.`,
  },
  20057050: {
    msg: `조회된 권한 그룹 정보가 없습니다.`,
  },


  20058010: {
    msg: `유효한 접근이 아닙니다.`
  },
  20058020: {
    msg: `유효한 접근이 아닙니다.`
  },
  20058030: {
    msg: `유효한 접근이 아닙니다.`
  },
  20058040: {
    msg: `유효한 접근이 아닙니다.`
  },
  20058050: {
    msg: `유효한 접근이 아닙니다.`
  },


  20059010: {
    msg: `파일 고유 정보가 올바르지 않습니다.`,
  },
  20059020: {
    msg: `파일 고유 정보가 올바르지 않습니다.`,
  },
  20059030: {
    msg: `파일 고유 정보가 올바르지 않습니다.`,
  },



  20061010: {
    msg: `매칭되는 권한이 없습니다.`,
  },
  20061020: {
    msg: `권한이 없습니다.`,
  },



  20062010: {
    msg: `권한 그룹을 복제할 권한이 없습니다.`,
  },
  20062020: {
    msg: `권한 그룹 정보가 없습니다.`,
  },
  20062030: {
    msg: `권한 그룹 정보가 없습니다.`,
  },
  20062040: {
    msg: `권한 그룹 정보가 유효하지 않습니다.`,
  },
  20062050: {
    msg: `유효한 권한 그룹 정보가 아닙니다.`,
  },
  20062060: {
    msg: `권한 그룹을 복제하던 도중 에러가 발생하였습니다.`,
  },


  20063010: {
    msg: `파일을 삭제할 권한이 없습니다.`,
  },
  20063020: {
    msg: `파일 정보가 없습니다.`,
  },
  20063030: {
    msg: `파일 정보가 유효하지 않습니다.`,
  },
  20063040: {
    msg: `파일 정보가 없습니다.`,
  },
  20063050: {
    msg: `파일 정보중에 일부가 유효하지 않습니다.`,
  },
  20063060: {
    msg: `파일 정보가 없습니다.`,
  },
  20063070: {
    msg: `파일을 삭제하던 도중 오류가 발생하였습니다.`,
  },


  20064010: {
    msg: `파일 버전을 삭제할 권한이 없습니다.`,
  },
  20064020: {
    msg: `파일 버전 정보가 없습니다.`,
  },
  20064030: {
    msg: `파일 버전 정보가 유효하지 않습니다.`,
  },
  20064040: {
    msg: `파일 버전 정보가 없습니다.`,
  },
  20064050: {
    msg: `파일 버전 정보중에 일부가 유효하지 않습니다.`,
  },
  20064060: {
    msg: `파일 버전 정보가 없습니다.`,
  },
  20064070: {
    msg: `선택된 파일 버전중에 파일 다운로드 URL 로 지정된 버전이 존재하여 선택된 파일 버전을 삭제하는데 실패하였습니다.`,
  },
  20064080: {
    msg: `파일 버전을 삭제하는 도중 오류가 발생하였습니다.`,
  },


  20065010: {
    msg: `파일 다운로드 URL을 삭제할 권한이 없습니다.`,
  },
  20065020: {
    msg: `파일 다운로드 URL 정보가 없습니다.`,
  },
  20065030: {
    msg: `파일 다운로드 URL 정보가 유효하지 않습니다.`,
  },
  20065040: {
    msg: `파일 다운로드 URL 정보가 없습니다.`,
  },
  20065050: {
    msg: `파일 다운로드 URL 정보중에 일부가 유효하지 않습니다.`,
  },
  20065060: {
    msg: `파일 다운로드 URL 정보가 없습니다.`,
  },
  20065070: {
    msg: `선택된 파일 다운로드 URL중에 파일 다운로드 URL 로 지정된 버전이 존재하여 선택된 파일 다운로드 URL을 삭제하는데 실패하였습니다.`,
  },
  20065080: {
    msg: `파일 다운로드 URL을 삭제하는 도중 오류가 발생하였습니다.`,
  },


  20066010: {
    msg: `매칭되는 권한이 없습니다.`,
  },


  20067010: {
    msg: `짧은 시간에 너무 많은 로그인 요청을 하셨습니다. 잠시 후 다시 시도해주세요.`,
  },
  



  20068009: {
    msg: `잘못된 접근입니다.`,
  },
  20068010: {
    msg: `파일 버전 정보가 없습니다.`,
  },
  20068020: {
    msg: `파일 버전 정보가 없습니다.`,
  },
  20068030: {
    msg: `파일 버전 정보가 올바르지 않습니다.`,
  },
  20068040: {
    msg: `버전 정보가 없습니다.`,
  },
  20068050: {
    msg: `파일이 존재하지 않습니다.`,
  },
  20068060: {
    msg: `파일을 다운로드 하는데 실패하였습니다.`,
  },
};

module.exports = myResultCode;
