
const myResultCode = {
  20001010: {
    msg: `로그인 상태가 만료되었습니다.`,
  },
  20001011: {
    msg: `로그인 상태가 만료되었습니다.`,
  },
  20001012: {
    msg: `로그인 상태가 만료되었습니다.`,
  },
  20001013: {
    msg: `로그인 상태가 만료되었습니다.`,
  },
  20001014: {
    msg: `로그인 상태를 갱신하였습니다.`,
  },


  20001509: {
    msg: `코드그룹이 올바르지 않습니다.`,
  },
  20001510: {
    msg: `이미 존재하는 코드그룹으로 요청하셨습니다.`,
  },
  20001520: {
    msg: `코드그룹명이 올바르지 않습니다.`,
  },
  20001530: {
    msg: `코드그룹명은 공백일 수 없습니다.`,
  },
  20001540: {
    msg: `코드그룹명은 100자를 넘을 수 없습니다.`,
  },
  20001590: {
    msg: `코드그룹은 공백일 수 없습니다.`,
  },
  20001600: {
    msg: `코드그룹은 5자이어야 합니다.`,
  },


  20002010: {
    msg: `코드그룹이 올바르지 않습니다.`,
  },
  20002020: {
    msg: `등록되지 않은 코드그룹으로 요청하셨습니다.`,
  },
  20002030: {
    msg: `코드가 올바르지 않습니다.`,
  },
  20002040: {
    msg: `코드는 공백일 수 없습니다.`,
  },
  20002050: {
    msg: `코드는 13자이어야 합니다.`,
  },
  20002055: {
    msg: `이미 등록된 코드 입니다.`,
  },
  20002060: {
    msg: `코드명이 올바르지 않습니다.`,
  },
  20002070: {
    msg: `코드명은 공백일 수 없습니다.`,
  },
  20002080: {
    msg: `코드명은 50자를 넘을 수 없습니다.`,
  },
  20002090: {
    msg: `코드 설명은 공백이 될 수 없습니다.`,
  },
  20002100: {
    msg: `코드 설명은 100자를 넘을 수 없습니다.`,
  },
  20002110: {
    msg: `코드 필요값 1은 공백일 수 없습니다.`,
  },
  20002120: {
    msg: `코드 필요값 1은 100자를 넘을 수 없습니다.`,
  },
  20002130: {
    msg: `코드 필요값 2는 공백일 수 없습니다.`,
  },
  20002140: {
    msg: `코드 필요값 2는 100자를 넘을 수 없습니다.`,
  },


  20002510: {
    msg: `코드가 올바르지 않습니다.`,
  },
  20002520: {
    msg: `코드는 공백일 수 없습니다.`,
  },
  20002530: {
    msg: `코드 길이는 13자이어야 합니다.`,
  },
  20002540: {
    msg: `코드가 존재하지 않습니다.`,
  },
  20002550: {
    msg: `코드명이 올바르지 않습니다.`,
  },
  20002560: {
    msg: `코드명은 공백일 수 없습니다.`,
  },
  20002570: {
    msg: `코드명은 50자를 넘을 수 없습니다.`,
  },
  20002580: {
    msg: `코드설명이 올바르지 않습니다.`,
  },
  20002590: {
    msg: `코드설명은 100자를 넘을 수 없습니다.`,
  },
  20002600: {
    msg: `코드 필요값1이 올바르지 않습니다.`,
  },
  20002610: {
    msg: `코드 필요값1은 100자를 넘을 수 없습니다.`,
  },
  20002620: {
    msg: `코드 필요값2가 올바르지 않습니다.`,
  },
  20002630: {
    msg: `코드 필요값2는 100자를 넘을 수 없습니다.`,
  },


  20003010: {
    msg: `코드는 공백일 수 없습니다.`,
  },
  20003020: {
    msg: `코드는 13자이어야 합니다.`,
  },
  20003030: {
    msg: `수정할 코드가 없습니다.`,
  },
  20003040: {
    msg: `코드 중에 올바르지 않은 코드가 존재합니다.`,
  },
  20003050: {
    msg: `코드 중에 공백인 코드가 존재합니다.`,
  },
  20003060: {
    msg: `코드 중에 13자가 아닌 코드가 존재합니다.`,
  },
  20003070: {
    msg: `코드가 올바르지 않습니다.`,
  },
  20003080: {
    msg: ``,
  },



  20003510: {
    msg: `코드는 공백일 수 없습니다.`,
  },
  20003520: {
    msg: `코드는 13자이어야 합니다.`,
  },
  20003530: {
    msg: `복구할 코드가 없습니다.`,
  },
  20003540: {
    msg: `코드 중에 올바르지 않은 코드가 존재합니다.`,
  },
  20003550: {
    msg: `코드 중에 공백인 코드가 존재합니다.`,
  },
  20003560: {
    msg: `코드 중에 13자가 아닌 코드가 존재합니다.`,
  },
  20003570: {
    msg: `코드가 올바르지 않습니다.`,
  },
  20003580: {
    msg: ``,
  },



  20004010: {
    msg: `코드 그룹은 공백일 수 없습니다.`,
  },
  20004020: {
    msg: `코드 그룹은 5자이어야 합니다.`,
  },
  20004030: {
    msg: `조회할 코드 그룹이 없습니다.`,
  },
  20004040: {
    msg: `코드 그룹중에 올바르지 않은 코드 그룹이 존재합니다.`,
  },
  20004050: {
    msg: `코드 그룹중에 공백인 코드 그룹이 존재합니다.`,
  },
  20004060: {
    msg: `코드 그룹중에 5자가 아닌 코드 그룹이 존재합니다.`,
  },
  20004070: {
    msg: `코드그룹이 올바르지 않습니다.`,
  },
  20004080: {
    msg: ``,
  },



  20004510: {
    msg: `코드 그룹이 올바르지 않습니다.`,
  },
  20004520: {
    msg: `코드 그룹은 공백일 수 없습니다.`,
  },
  20004530: {
    msg: `코드 그룹은 5자이어야 합니다.`,
  },
  20004540: {
    msg: `등록 되지 않은 코드 그룹으로 요청하셨습니다.`,
  },
  20004550: {
    msg: `코드 그룹명이 올바르지 않습니다.`,
  },
  20004560: {
    msg: `코드 그룹명은 공백일 수 없습니다.`,
  },
  20004570: {
    msg: `코드 그룹명은 100자를 넘을 수 없습니다.`,
  },
  20004580: {
    msg: ``,
  },


  20005010: {
    msg: `코드 그룹명은 공백일 수 없습니다.`,
  },
  20005020: {
    msg: `코드 그룹명은 5자이어야 합니다.`,
  },
  20005030: {
    msg: `삭제할 코드 그룹이 없습니다.`,
  },
  20005040: {
    msg: `코그 그룹중에 올바르지 않은 코드 그룹이 존재합니다.`,
  },
  20005050: {
    msg: `코드 그룹중에 공백인 코드 그룹이 존재합니다.`,
  },
  20005060: {
    msg: `코드 그룹중에 5자가 아닌 코드 그룹이 존재합니다.`,
  },
  20005070: {
    msg: `코드 그룹이 올바르지 않습니다.`,
  },


  20005510: {
    msg: `코드 그룹명은 공백일 수 없습니다.`,
  },
  20005520: {
    msg: `코드 그룹명은 5자이어야 합니다.`,
  },
  20005530: {
    msg: `삭제할 코드 그룹이 없습니다.`,
  },
  20005540: {
    msg: `코그 그룹중에 올바르지 않은 코드 그룹이 존재합니다.`,
  },
  20005550: {
    msg: `코드 그룹중에 공백인 코드 그룹이 존재합니다.`,
  },
  20005560: {
    msg: `코드 그룹중에 5자가 아닌 코드 그룹이 존재합니다.`,
  },
  20005570: {
    msg: `코드 그룹이 올바르지 않습니다.`,
  },
};

module.exports = myResultCode;
